{
  "templates": [
    {
      "id": "kombu",
      "name": "Kombattantutbildning för krigsplacerad, obeväpnad personal (KombU)",
      "shortName": "KombU",
      "category": "Grundläggande militärutbildning",
      "courseCode": "UTPGK450KU02",
      "description": "Grundläggande utbildning som ger personal förståelse för sin roll, status och uppgifter i Försvarsmaktens krigsorganisation. Kursen omfattar fysisk träning, exercis, CBRN, hälso- och sjukvårdsutbildning, försvarsupplysning, FM värdegrund, folkrätt, förmanskap, uniformssystem 90, förevisningsskjutning och brandutbildning.",
      "targetAudience": "Krigsplacerad, obeväpnad personal, såväl kombattanter som icke kombattanter (dessa icke kombattanter kan efter särskild utbildning tilldelas lättare beväpning).",
      "syllabus": "Fysisk träning, exercis, CBRN, hälso- och sjukvårdsutbildning, försvarsupplysning, FM värdegrund, folkrätt, förmanskap, uniformssystem 90, förevisningsskjutning, brandutbildning.",
      "purpose": "Att ge deltagarna kunskap om totalförsvaret, Försvarsmaktens värdegrund, folkrätt och det egna krigsförbandets uppgift och funktion i krigsorganisationen samt förmåga att krigsplaceras på avsedd befattning.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna försvara sig själv och tillsammans med andra kunna försvara plats eller anläggning samt handla i enlighet med gällande lagar, regler och bestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå sin roll och status som kombattant eller icke kombattant i krigsorganisationen.",
        "Tillämpa Försvarsmaktens värdegrund och folkrätt.",
        "Kunna agera enligt soldatregler och förmanskap.",
        "Behärska grundläggande militär färdighet och säkerhet."
      ],
      "examination": "Godkänt deltagande i samtliga utbildningsmoment krävs. Eventuell komplettering ska ske inom 6 månader från kurstillfället.",
      "prerequisites": [
        "Befattning i Hemvärnet eller anställd i Försvarsmakten.",
        "Rekryterad mot konkret befattning i insatsorganisationen.",
        "Upprättad utbildningsplan och tecknat utbildningsavtal med Försvarsmakten inklusive säkerhetsprövning."
      ],
      "literature": [
        "Försvarsmaktens reglementen och handböcker enligt kursbeskrivning."
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-130849"
    },
    {
      "id": "gruppchef-1",
      "name": "Gruppchefskurs 1",
      "shortName": "GC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK2011230",
      "description": "Kursen omfattar grundläggande gruppchefsutbildning där fokus ligger på orderträning, stridsteknik, beslutsfattning där teori varvas med praktiska övningar utomhus.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som gruppchef/stf inom Hemvärnet.",
      "syllabus": "Grundläggande ledarskap, ordergivning, gruppens stridsteknik, soldatregler och tillämpade övningar.",
      "purpose": "Att deltagaren skall kunna verka som gruppchef/stf inom Hemvärnet eller frivilligorganisation.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som gruppchef inom Hemvärnet eller frivilligorganisation.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla gruppchefens roll, ansvar och utförande av befälsföring av grupp vid uppgifts lösande samt tillämpandet av soldatreglerna, FM Värdegrund och fysiskt stridsvärde.",
        "Förklara och använda högre chefs order i form av att ge order till egen grupp.",
        "Exemplifiera och använda stridsteknik enligt handbok hemvärnspluton-grupp vid framryckande och tagande av skyddsobjekt inom hemvärnsplutons ram.",
        "Beskriva upprättandet av förläggning, observationsplats och postställe.",
        "Definiera och beskriva hemvärnsplutonernas organisation och uppgifter."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av plutonchefs order, användande av OBO alternativt 5 punkts order enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen med tyngdpunkt på fältdygnen. Max 2 examinationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, eller GU.",
        "Genomfört kompetensprov Ak 4B/C.",
        "Fysisk status för att klara minst två fältdygn."
      ],
      "literature": "Handbok Hvplut/Hvgrp del 1-2, (Grunder och Objektet), MSR, FM Handböcker och reglementen",
      "additionalInfo": "Utbildning till gruppchef/stf omfattar två kurser; Gruppchefskurs1 och Gruppchefskurs 2. Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": "10 dagar om totalt 106 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-130858"
    },
    {
      "id": "gruppchef-2",
      "name": "Gruppchefskurs 2",
      "shortName": "GC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011181",
      "description": "Kursen omfattar fortsatt gruppchefsutbildning med teori och praktik, där fokus ligger på orderträning, stridsteknik och beslutsfattning i tillämpad och simulerad miljö med praktiska övningar utomhus.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som gruppchef/stf inom Hemvärnet.",
      "syllabus": "Orderträning, stridsteknik vid tagande av objekt och sammanstöt i urban och betäckt terräng, uppdragsutvärdering, stresshantering, tillämpning av fysiskt stridsvärde, eskortuppgifter med hemvärnsgrupp, användning av hundekipage vid bevakning och skydd, samt hemvärnsplutonernas organisation och uppgifter.",
      "purpose": "Att deltagaren skall kunna verka som gruppchef/stf inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som gruppchef inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Behärska gruppens stridsteknik vid tagande av objekt och sammanstöt i urban och betäckt terräng inom plutons ram.",
        "Förklara och använda uppdragsutvärdering samt förstå hur stress och konfliktnivå påverkar uppgiftslösning och tillämpning av fysiskt stridsvärde.",
        "Förklara och använda hemvärnsgrupp vid eskortuppgift inom plutons ram.",
        "Förklara och använda hundekipage vid bevakning och skydd av objekt.",
        "Sammanfatta och förklara hemvärnsplutonernas uppgifter, såsom insatspluton och bevakningspluton."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av plutonchefs order, användande av OBO alternativt 5-punkts order enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomfört Gruppchefskurs 1 eller motsvarande utbildning under värnplikt/grundutbildning.",
        "Godkänt kompetensprov AK 4B/C.",
        "Bör ha innehaft befattningen under minst en söf eller kfö.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-2 (Grunder och Objektet)",
        "MSR",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": "Utbildning till gruppchef/stf omfattar två kurser; Gruppchefskurs 1 och Gruppchefskurs 2. Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-130906"
    },
    {
      "id": "gruppchef-3",
      "name": "Gruppchefskurs 3",
      "shortName": "GC3",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011231",
      "description": "Kursen omfattar praktik mot gruppchef för understödsgrupp och inkluderar repetitionsutbildning i granatgevärsteori och praktik, skjutning med olika ammunitionstyper samt förevisning av vapenverkan.",
      "targetAudience": "Avsedd för dig som är eller skall placeras som chef eller ställföreträdare för en understödsgrupp inom Hemvärnet.",
      "syllabus": "Praktisk ledning och stridsteknik för understödsgrupp, granatgevärshantering inklusive skjutning och vapenverkan, orderträning med fokus på nedbrytning av plutonchefs order och användning av 5-punktsorder enligt handbok.",
      "purpose": "Att deltagaren skall kunna verka som understödsgruppchef eller ställföreträdare inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som understödsgruppchef/stf inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara understödsgruppens stridsteknik och ledning vid tagande av objekt samt sammanstöt inom insatsplutons ram.",
        "Kunna beskriva, förklara och tillämpa granatgevärets funktion, prestanda och handhavande.",
        "Beskriva och tillämpa vikten av fysiskt stridsvärde vid ledning av understödsgrupp."
      ],
      "examination": "Praktiskt lärande examinationer där elevens handhavande av granatgevär samt ordergivning och agerande som understödsgruppchef utvärderas fortlöpande under kursen. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd Gruppchefskurs 1.",
        "Utbildad på granatgevär m/48 i lägst nivå brukare dokumenterat i PRIO.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-2 (Grunder och Objektet)",
        "Manual 8,4 cm granatgevär",
        "MSR, FM Handböcker och reglementen"
      ],
      "additionalInfo": "Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-130913"
    },
    {
      "id": "gruppchef-12",
      "name": "Gruppchefskurs 1 + 2",
      "shortName": "GC12",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "primaryLearningObjective": "",
      "secondaryLearningObjectives": [],
      "examination": "",
      "prerequisites": [],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [
        "gruppchef-1",
        "gruppchef-2"
      ],
      "sourceFiles": [
        "hvss-kurskatalog-2025.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "gruppchef-x",
      "name": "Gruppchefskurs X",
      "shortName": "GCX",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119GP00",
      "description": "Kursen omfattar grundläggande gruppchefsutbildning där fokus ligger på orderträning, stridsteknik och beslutsfattning. Teori varvas med praktiska övningar utomhus, inklusive tre dygn i fält.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som x-gruppchef/stf inom Hemvärnet eller i frivilligorganisationer.",
      "syllabus": "Grundläggande ledarskap, orderträning, stridsteknik, beslutsfattning, maskering och gruppering av typfordon, upprättande av förläggning och postställe.",
      "purpose": "Att deltagaren skall kunna verka som x-gruppchef/stf inom Hemvärnet eller frivilligorganisation.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som x-gruppchef inom Hemvärnet eller frivilligorganisation.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla gruppchefens roll, ansvar och befälsföring av grupp vid uppgiftslösning samt tillämpandet av FM värdegrund och fysiskt stridsvärde.",
        "Förklara och använda högre chefs order genom att bryta ned den och ge order till egen grupp.",
        "Beskriva grunderna och genomföra maskering och gruppering av egna gruppens typfordon.",
        "Förstå framryckning och ingående i stridsställning.",
        "Beskriva upprättandet av förläggning och postställe.",
        "Definiera och beskriva hemvärnsplutonernas organisation och uppgifter."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning efter nedbrytande av plutonchefs order, användande av OBO enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen med tyngdpunkt på fältdygnen. Max två omexaminationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GMU, GU eller GUF motsvarande.",
        "Genomfört kompetensprov AK 4B, C eller pistol m/88.",
        "Fysisk status för att klara minst tre fältdygn."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-2 (grunder), senaste utgåvor.",
        "Markstridshandböcker, senaste utgåvor.",
        "FM handböcker och reglementen, senaste utgåvor."
      ],
      "additionalInfo": "Utbildning till x-gruppchef/stf. För att erhålla gruppchefsgraden furir skall individen genomföra en gruppchefskurs inom sitt specialistområde samt instruktörskurs 1.",
      "typicalDuration": "10 dagar om totalt 106 timmar, varav 3 dygn i fält.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-130921"
    },
    {
      "id": "troppchef-stab-tross",
      "name": "Troppchef Stab och Tross",
      "shortName": "CSOT",
      "category": "Chefsutbildningar",
      "courseCode": "HVT422CGP01",
      "description": "Kursen omfattar grundläggande troppchefsutbildning med fokus på ansvarsförhållande, orderträning och grupperingsteknik där teori varvas med praktiska övningar utomhus. Kursen omfattar 46 timmar fördelat på 5 dagar.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som stab/tross troppchef inom Hemvärnet. Öppen för gruppchefer inom stab/tross troppen för vidareutbildning.",
      "syllabus": "Ansvarsförhållanden, orderträning, grupperingsteknik, marschorder, försvar av grupperingsplats, praktiska övningar.",
      "purpose": "Att deltagaren skall kunna verka som troppchef för stab och tross inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som troppchef för stab och tross inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla troppchefens roll, ansvar och utförande av befälsföring av tropp vid uppgiftslösande.",
        "Förklara och använda högre chefs order i form av att ge order till egen tropp.",
        "Beskriva grunderna och använda rätt order vid marschorder.",
        "Beskriva gruppering för stab och tross samt förstå åtgärder vid försvar av grupperingsplats."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av kompanichefs order, fortsatt utbildning av 5-punktsorder enligt handbok och agerande i rollen som troppchef utvärderas fortlöpande under kursen med tyngdpunkt på ansvaret i troppchefens olika uppgifter. Eleven bedöms mot godkänd/icke godkänd skalan vid ämnesexaminationer. Max 1 omexaminationstillfälle under kursen.",
      "prerequisites": [
        "Genomförd plutonchefskurs 1 för troppchefer.",
        "Genomförd gruppchefskurs x alternativt gruppchefskurs 1 för gruppchefer."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 3",
        "Handbok Hvkomp del 1-3",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "Denna kurs räknas som plutonchefskurs 2 för troppchefer på stab och tross.",
      "typicalDuration": "5 dagar om totalt 46 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-130940"
    },
    {
      "id": "plutonchef-1",
      "name": "Plutonchefskurs 1",
      "shortName": "PC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK2011222",
      "description": "Kursen omfattar grundläggande plutonchefskunskaper och färdigheter med tyngdpunkt på orderträning och stridsteknik. Utbildningen genomförs med lärarledda lektioner, grupparbeten, enskilda redovisningar och spel på stridsplaner i terrängen.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som plutonchef/stf, kompanikvartermästare eller chef för hemvärnets flygtropp. Öppen även för chef ledningstropp och gruppchef/stf i stridande befattning.",
      "syllabus": "Grundläggande plutonchefsbefattning, orderträning, stridsteknik, befälsföring, tillämpning av soldatregler, FM värdegrund och fysiskt stridsvärde.",
      "purpose": "Att deltagaren skall verka som plutonchef/stf inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som plutonchef/stf inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla plutonchefens roll, ansvar och utförande av befälsföring av pluton vid uppgiftslösning samt tillämpandet av soldatreglerna, FM värdegrund och fysiskt stridsvärde.",
        "Exemplifiera och använda stridsteknik enligt handbok hemvärnspluton-grupp vid framryckande och tagande av skyddsobjekt samt skydda/bevaka inom hemvärnskompaniets ram.",
        "Förklara och använda högre chefs order i form av att ge order till egen pluton i form av 5-punktsorder och uppdragstaktik.",
        "Definiera och beskriva hemvärnskompaniets organisation, uppgifter och stridsteknik."
      ],
      "examination": "Praktiskt lärande examinationer där elevens nedbrytande av kompanichefs order och användande av 5-punktsorder vid ordergivning enligt handbok samt agerandet i rollen som plutonchef utvärderas fortlöpande under kursen med tyngdpunkt på kader- och lektionspassen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GU eller GMU.",
        "Gruppchefskurs 2.",
        "Genomförd skyddsvaktsutbildning.",
        "Godkänt kompetensprov AK 4B/C.",
        "God fysisk status för att klara minst ett dygn i fält."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-3 (Grunder och Objektet, Anvisningar)",
        "MSR",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "Kursen är öppen för gruppchefer i Hemvärnet med orienterande syfte. Utbildning till plutonchef/stf omfattar två kurser; plutonchefskurs 1 och plutonchefskurs 2. Plutonchefskurs 3 är företrädesvis avsedd för de som skall bli chef/stf för insatspluton.",
      "typicalDuration": "10 dagar om totalt 96 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131001"
    },
    {
      "id": "plutonchef-2",
      "name": "Plutonchefskurs 2",
      "shortName": "PC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011223",
      "description": "Kursen omfattar fortsatt plutonchefsutbildning med teori och praktik, där fokus ligger på orderträning, stridsteknik och beslutsfattning i tillämpad och simulerad miljö, inklusive övningar utomhus och i stridssimulator (strisim pc).",
      "targetAudience": "Avsedd för dig som skall placeras eller tjänstgör som plutonchef/ställföreträdare, samt ledningsplutonchef/stf.",
      "syllabus": "Orderträning, stridsteknik, beslutsfattning under tidspress, tillämpning av 5-punktsorder, stridsteknik enligt handbok hemvärnspluton-grupp, skydd och bevakning, ytövervakning, uppdragsutvärdering, ledning av skydd och bevakning med hundekipage.",
      "purpose": "Att deltagaren skall kunna verka som plutonchef/stf inom hemvärnet med fördjupade kunskaper och färdigheter i ledning och stridsteknik.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som plutonchef inom hemvärnet och leda plutonens strid och uppgifter effektivt.",
      "secondaryLearningObjectives": [
        "Tillämpa 5-punktsorder vid framtagande av stridsplan och ordergivning vid plutonens tagande av objekt och sammanstöt i urban och betäckt terräng.",
        "Använda stridsteknik enligt handbok hemvärnspluton-grupp vid framryckning, tagande av skyddsobjekt samt skydd och bevakning inom hemvärnskompaniets ram.",
        "Tillämpa uppdragsutvärdering och förstå stress- och konfliktnivåers påverkan på uppgiftslösning samt fysiskt stridsvärde.",
        "Planera och leda skydd och bevakning med hundekipage."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning, användande av 5-punktsorder och agerande som plutonchef utvärderas fortlöpande under kursen med tyngdpunkt på kadersessioner. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd plutonchefskurs 1.",
        "Godkänd skyddsvaktsutbildning.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-3 (Grunder, Objektet, Anvisningar)",
        "MSR",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": "Bör ha genomfört en kfö eller söf på plutonchefsnivå. Utbildning till plutonchef/stf omfattar två kurser; plutonchefskurs 1 och plutonchefskurs 2. Plutonchefskurs 3 är avsedd för de som skall bli chef/stf för en insatspluton.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131021"
    },
    {
      "id": "plutonchef-3",
      "name": "Plutonchefskurs 3",
      "shortName": "PC3",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011520",
      "description": "Kursen omfattar fortsatt plutonchefsutbildning med fokus på orderträning och beslutsfattning under tidspress. Utbildningen genomförs med lärarledda lektioner, grupparbeten, redovisningar och spel på stridsplaner i terrängen.",
      "targetAudience": "Avsedd för dig som är placerad som plutonchef/stf i en insatspluton. Öppen i mån av plats för bevakningsplutonchef/stf, hvundplutonchef/stf och grkplutonchef. Sökande ska vara krigsplacerad som plutonchef/stf med minst en genomförd kfö.",
      "syllabus": "Orderträning, beslutsfattning under tidspress, stridsteknik, ledarskap, praktiska övningar i terräng, användande av 5-punktsorder och OBO enligt handbok hemvärnspluton-grupp.",
      "purpose": "Att deltagaren ska kunna verka som plutonchef/stf vid en insatspluton i Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna leda och fatta beslut som plutonchef i insatspluton inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Producera och genomföra bedömningar utifrån högre chefs order och ta fram stridsplan.",
        "Ge plutonchefens order och marschorder med begränsad tid för förberedelser.",
        "Tillämpa stridsteknik vid framryckning och tagande av skyddsobjekt samt skydda och bevaka inom insatskompaniets ram.",
        "Använda rätt teknik vid ytövervakning och tagande av objekt i urban terräng.",
        "Förstå och tillämpa grunder för försvar och stridsuppgiften eldöverfall.",
        "Utveckla och använda insatsplutonens organisation vid skydd av transport."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning, användande av OBO och 5-punktsorder enligt handbok samt agerande som plutonchef utvärderas fortlöpande under kursen med tyngdpunkt på kader- och lektionspass. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomfört plutonchefskurs 2.",
        "Godkänt kompetensprov AK 4B/C Hemvärnet.",
        "Godkänd skyddsvaktsutbildning.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-3 (Grunder, Objektet, Anvisningar)",
        "Markstridshandbok Hemvärnspluton-Gruppe",
        "FM Handböcker och Reglementen",
        "MSR"
      ],
      "additionalInfo": "Plutonchefskurs 3 är avsedd för de som ska bli chef/stf för en insatspluton. Kursen genomförs av Hemvärnets stridsskola och utbildningsgrupper.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131044"
    },
    {
      "id": "plutonchef-12",
      "name": "Plutonchefskurs 1 + 2",
      "shortName": "PC12",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK8100030",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "primaryLearningObjective": "",
      "secondaryLearningObjectives": [],
      "examination": "",
      "prerequisites": [],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [
        "plutonchef-1",
        "plutonchef-2"
      ],
      "sourceFiles": [
        "hvss-kurskatalog-2025.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "ledningsplutonchef",
      "name": "Ledningsplutonchefskurs",
      "shortName": "LPC",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK2011502",
      "description": "Kursen omfattar ledningsplutonens organisation och uppgifter samt upprättande av bataljonsstab. Utbildningen genomförs i form av lärarledda lektioner och grupparbeten, där ledningsplutonchefens roll belyses och tränas.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som chef/stf i en ledningspluton/ledningstropp inom hemvärnsbataljon/militärregion stab. Öppen i mån av plats för ledningstroppchef vid hemvärnsundkompani.",
      "syllabus": "Ledningsplutonens organisation och materiel, upprättande, försvar och betjäning av bataljonsstab/militärregion stab, sambandstjänstens uppbyggnad vid hemvärnsbataljon, ordergivning och ledning inom plutonens ram.",
      "purpose": "Få en grundlagd förmåga att agera och leda som plutonchef vid ledningspluton/militärregion stab.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha färdighet att leda och samordna verksamheten inom plutonen.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara hur man organiserar, upprättar, försvarar samt betjänar en bataljonsstab/militärregion stab.",
        "Kunna producera en order till egen pluton utifrån högre chefs order med gott om tid.",
        "Beskriva och förklara ledningsplutonens organisation och materiel.",
        "Beskriva och förklara sambandstjänstens uppbyggnad vid hemvärnsbataljon."
      ],
      "examination": "Praktiskt lärande gruppexamination inom plutons ram inklusive ordergivning. Obligatoriska moment är genomgångar som belyser plutonens verksamhet, organisation och uppgifter samt övning i att bygga ledningsplats för bataljonsstab i kvarter/tält. Max 1 examinationstillfälle under kursen.",
      "prerequisites": [
        "Genomförd plutonchefskurs 1."
      ],
      "literature": [
        "KFS",
        "FM Handbok stabstjänst",
        "FM Handbok sambandstjänst"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning.",
      "typicalDuration": "10 dagar om totalt 96 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131106"
    },
    {
      "id": "kompanichef-1",
      "name": "Kompanichefskurs 1",
      "shortName": "KC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB11",
      "description": "Kursen omfattar grundläggande kompanichefsutbildning med fokus på stridsteknik och taktik på kompani, funktioner inom kompaniet samt bedömande fram till en färdig stridsplan, beslutsfattning och orderträning med varierad planeringstid. Utbildningen sker genom lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på framtagna stridsplaner i betäckt terräng. Kursen kan delvis genomföras tillsammans med plutonchefskurs.",
      "targetAudience": "Avsedd för kompanichefer och ställföreträdande kompanichefer.",
      "syllabus": "Stridsteknik och taktik på kompaninivå, kompanifunktioner, framtagande av stridsplan, beslutsfattning, orderträning, rekognosering, spel på stridsplaner.",
      "purpose": "Att deltagaren ska få grundläggande förmåga att agera och leda som chef vid eget kompani.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla en stridsplan, utverka order och leda sitt kompani vid skydd och bevakning av objekt i terräng och urban miljö.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen och planering under tidspress för att ta fram en stridsplan för kompani utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva hur plutoner leds och samordnas inom kompaniets strid vid framryckning och tagande av oförsvarad terräng.",
        "Utveckla ledarskapet kopplat till rollen som kompanichef.",
        "Beskriva motståndarens organisation och verksamhet samt tillämpliga lagar och mandat för kompanichefen.",
        "Beskriva aktivering av hemvärnet och praktiska åtgärder vid beredskapshöjningar.",
        "Identifiera kompanichefens ansvar och konsekvenser av beslut ur ett moraliskt och etiskt perspektiv."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av bataljonchefs order, användande av fempunktsorder enligt handbok och agerande i rollen som kompanichef utvärderas fortlöpande genom taktik- och ledarskapsmoment samt spel på stridsplaner i terrängen. Aktivt deltagande krävs för godkänt resultat.",
      "prerequisites": [
        "Grundkurs stabstjänst (gks).",
        "Plutonchefskurs 2 och erfarenhet från befattning."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärnsbataljon/kompani/pluton",
        "Handbok markstrid – kompani 2016",
        "Handbok motståndaren 2016",
        "Arméreglemente taktik 2013"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Utbildning till kompanichef omfattar kompanichefskurs 1 och 2 (formell) samt kompanichefskurs 3 (fördjupningskurs).",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131127"
    },
    {
      "id": "kompanichef-2",
      "name": "Kompanichefskurs 2",
      "shortName": "KC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011220",
      "description": "Kursen omfattar fortsatt kompanichefsutbildning med fokus på stridsteknik på pluton/kompani, funktioner inom kompaniet samt bedömande fram till färdig stridsplan och beslutsfattning/orderträning med gott/ont om tid inklusive förmågan att utvecklas i ledarskapet som kompanichef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på egna framtagna stridsplaner vid objekt i urban miljö samt broar/förbindelser. Kursen genomförs till del tillsammans med plutonchefskurs 2.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som kompanichef/stf. Kursen är öppen i mån av plats för c s3/5, c ledningslag/stribef.",
      "syllabus": "Stridsteknik på pluton/kompani, kompanifunktioner, bedömning och framtagande av stridsplan, beslutsfattning och orderträning, ledarskapsutveckling, rekognosering, spel på stridsplaner i urban miljö och vid broar/förbindelser.",
      "purpose": "Att ge deltagaren ökad förmåga att agera och leda som kompanichef med begränsad tid till förfogande vid skydd och bevakning av objekt i urban miljö, broar och förbindelser samt principer för ytövervakning och försvar på kompaninivå.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utarbeta en stridsplan och leda sitt kompani vid skydd och bevakning av objekt i urban miljö, broar och förbindelser med begränsad tid till förfogande.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen (PUT) vid genomförande av bedömning för att ta fram en stridsplan för kompaniet utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva och förklara hur plutonerna leds och samordnas inom ramen för kompaniets strid vid framryckning och tagande av objekt i urban miljö samt broar och förbindelser.",
        "Beskriva principer för ytövervakning i täckt terräng och modeller för försvar enligt handbok hemvärnskompani.",
        "Beskriva hur sabotageförband och luftlandsatt motståndare är organiserade och verkar.",
        "Identifiera och förklara kompanichefens ansvar samt konsekvenser av beslut på kort och lång sikt, även ur ett moraliskt och etiskt perspektiv i kris (typinsats 5)."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av bataljonchefens order, användande av fempunktsorder enligt handbok samt agerande i rollen som kompanichef utvärderas fortlöpande under kursen genom taktiska nötter, ledarskapsnötter samt spel på stridsplaner i terrängen med tyngdpunkt på applikatoriska exempel. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Kompanichefskurs 1."
      ],
      "literature": [
        "KFS",
        "Arméhandbok del 2",
        "Metodhandbok ledning bataljon 2007",
        "Handbok bataljon/kompani",
        "Handbok markstrid – kompani 2016"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning. Utbildning till kompanichef omfattar kompanichefskurs 1 och 2. Kompanichefskurs 3 är obligatorisk för insatskompanichefer och frivillig för övriga kompanichefer. Kompanichefskurs 3 kan även genomföras som repetitionskurs vid behov.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131144"
    },
    {
      "id": "kompanichef-3",
      "name": "Kompanichefskurs 3",
      "shortName": "KC3",
      "category": "Chefsutbildningar",
      "courseCode": "HVT422FKB03",
      "description": "Kursen omfattar fortsatt kompanichefsutbildning för kompanichefer samt repetitionskurs med fokus på stridsteknik på pluton/kompani, funktioner inom kompaniet samt bedömande fram till färdig stridsplan och beslutsfattning/orderträning med gott/ont om tid inklusive förmågan att utvecklas i ledarskapet som kompanichef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på egna framtagna stridsplaner vid broar/förbindelser, eskort, försvar och störastrid. Kursen kan genomföras till del tillsammans med plutonchefskurs 3.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som kompanichef/stf vid hemvärnskompani. Öppen i mån av plats för c s3, kompanichef/stf (hvund och båtkompani). Kan även genomföras som repetitionskurs för alla kompanichefer/stf vid behov.",
      "syllabus": "Fördjupning i kompaniets stridsteknik och taktik, funktioner inom kompaniet, framtagande av stridsplan, beslutsfattning och orderträning. Rekognosering i terräng, spel på stridsplaner, ledarskapsutveckling och praktiska ledarskapsövningar.",
      "purpose": "Att deltagaren skall få en fördjupad färdighet att vara chef vid eget kompani och kunna leda kompaniet vid skydd, bevakning, eskort, försvar och störastrid med begränsad tid till förberedelser.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna producera en stridsplan och leda sitt kompani vid skydd och bevakning av objekt i urban miljö, broar/förbindelser samt vid eskort, försvar och störastrid.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa kompaniets ledning och samordning inom ramen för lösandet av stridsuppgifterna bevaka, skydda, försvara samt störa.",
        "Beskriva och förklara hur motståndaren (sabotageförband samt ll-förband) är organiserade och verkar.",
        "Beskriva och förklara hur kompaniet stör en mekaniserad motståndare.",
        "Beskriva och förklara hur eskort genomförs på plutonsnivå inom insatskompaniets ram.",
        "Utveckla insikt och förståelse för vikten av att skapa en god förbandsanda vid kompaniet."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av bataljonchefens order, användande av 5-punktsorder enligt handbok samt agerande i rollen som kompanichef utvärderas fortlöpande under kursen. Examination sker under ordergivningar, spel på stridsplaner i terrängen, diskussioner i seminarieform samt praktiska ledarskapsövningar. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Kompanichefskurs 2.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok hemvärnsbataljon (remissutgåva)",
        "Handbok hemvärnskompani del 1-3 2017",
        "Handbok markstrid – kompani 2016",
        "Handbok markstrid- motståndaren 2016",
        "Handbok IKFN 2016",
        "Handbok stabstjänst grunder 2016"
      ],
      "additionalInfo": "Utbildningen kan delvis genomföras parallellt på två tätorter beroende på bakgrundskunskaper hos elever som genomför kursen som repetitionskurs. Kursen kan bedrivas till del på distans.",
      "typicalDuration": "7 dagar om totalt 60 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131205"
    },
    {
      "id": "kompanistridskurs",
      "name": "Kompanistridskurs",
      "shortName": "KSTR",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB10",
      "description": "Kursen omfattar grundläggande utbildning på kompaninivå med fokus på taktik, funktioner inom bataljon och kompani, organisation och uppgifter samt framtagande av stridsplan. Utbildningen genomförs med lärarledda lektioner, grupparbeten, redovisningar, rekognoscering och spel på stridsplan.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som stridsledare på kompani och bataljon. Kan även genomföras som repetitionskurs för kompanichefer och stf kompanichefer samt som fördjupningskurs för kvartermästare, plutonchefer och stabsmedlemmar.",
      "syllabus": "Taktik på kompaninivå, funktioner inom bataljon och kompani, organisation och uppgifter i bataljon och kompani, framtagande av stridsplan, ledarskapsmoment.",
      "purpose": "Att ge deltagaren grundläggande förståelse för stridsteknik och taktik på kompaninivå vid lösande av olika typer av uppgifter enligt KFM.",
      "primaryLearningObjective": "Efter kursen ska deltagaren med ökad förståelse för kompaniets taktik kunna verka i egen befattning på ett bättre och effektivare sätt.",
      "secondaryLearningObjectives": [
        "Kunna ta fram en stridsplan för kompani utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva och förklara hur kompaniet leds och samordnas vid skydd och bevakning av objekt som hamn, bro/förbindelser och flygbas.",
        "Beskriva hur motståndaren är organiserad och verkar mot förbanden.",
        "Beskriva hur hemvärnet aktiveras och vilka praktiska åtgärder som ska genomföras vid olika beredskapshöjningar."
      ],
      "examination": "Genom diskussioner, muntliga och skriftliga redovisningar samt spel på elevernas redovisningar. Aktivt deltagande krävs för godkänt betyg.",
      "prerequisites": [
        "Grundkurs stabstjänst (GKS)."
      ],
      "literature": [
        "Handbok hemvärns-bataljon/kompani",
        "AH Ledning 2016",
        "Handbok markstrid – kompani 2016"
      ],
      "additionalInfo": "Kompanistridskurs kan genomföras som repetitionskurs för alla kompanichefer vid behov.",
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131225"
    },
    {
      "id": "bataljonchef-1",
      "name": "Bataljonchefskurs 1",
      "shortName": "BC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB01",
      "description": "Kursen omfattar grundläggande bataljonchefsutbildning med fokus på stridsteknik och taktik på bataljon, funktioner inom bataljon samt bedömande fram till färdig stridsplan. Beslutsfattning och orderträning med gott om tid, samt förmåga att utveckla sitt ledarskap som bataljonchef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på framtagna stridsplaner.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som bataljonchef, stf bataljonchef. Även öppen för stabschef, chef s3 samt bekämpningschef s3. Övriga befattningar hänvisas till bataljonsstridskurs.",
      "syllabus": "Stridsteknik och taktik på bataljon, funktioner inom bataljon, bedömande fram till färdig stridsplan, beslutsfattning och orderträning, ledarskapsutveckling.",
      "purpose": "Att deltagaren skall få en grundlagd färdighet i bataljonchefsbefattningen.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som bataljonchef och leda bataljon vid skydd och bevakning av objekt, marinbas, hamnar, broar och förbindelser.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen och planering under tidspress (PUT) för att skapa en stridsplan för bataljon utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva hur kompanierna leds och samordnas över tid vid skydd och bevakning av hamnar, broar och förbindelser.",
        "Beskriva och förklara hur bataljonen kan störa en mekaniserad motståndare.",
        "Beskriva hur s2-funktionen bör utnyttjas effektivt inom ramen för bataljonens uppgift.",
        "Förstå motståndarens organisation och verksamhet.",
        "Förstå insatsreglernas påverkan på bataljonchefens agerande.",
        "Förklara praktiska åtgärder vid olika beredskapshöjningar.",
        "Utveckla det indirekta ledarskapet.",
        "Identifiera bataljonchefens ansvar och konsekvenser av beslut ur ett moraliskt och etiskt perspektiv i krig."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av mr order, användande av 5-punktsorder enligt handbok samt agerande i rollen som bataljonchef utvärderas fortlöpande under kursen genom taktiska och ledarskapsmoment. Spel på stridsplaner i terrängen ingår. Aktivt deltagande krävs för godkänt.",
      "prerequisites": [
        "Genomförd kompanichefskurs 2 eller kompanistridskurs.",
        "Brukare av informationssystem hemvärnet (ishv)."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärnsbataljon (remissutgåva)",
        "Handbok hemvärnskompani del 1-3 2017",
        "Handbok markstrid – kompani 2016",
        "Handbok markstrid – motståndaren 2016",
        "Reglemente armé taktik 2013",
        "Handbok IKFN 2016",
        "Handbok stabstjänst grunder 2016",
        "Handbok undsäktjänst för hemvärnet 2017"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Utbildning till bataljonchef omfattar två kurser: bataljonchefskurs 1 och bataljonchefskurs 2. Som fördjupning genomförs bataljonchefskurs 3.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131249"
    },
    {
      "id": "bataljonchef-2",
      "name": "Bataljonchefskurs 2",
      "shortName": "BC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011218",
      "description": "Kursen omfattar fortsatt bataljonchefsutbildning med fokus på stridsteknik och taktik på bataljon, funktioner inom bataljon samt bedömande fram till färdig stridsplan. Beslutsfattning och orderträning med gott/ont om tid, samt förmåga att utveckla sitt ledarskap som bataljonchef.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som bataljonchef eller ställföreträdande bataljonchef. Även öppen för stabschef.",
      "syllabus": "Stridsteknik och taktik på bataljonsnivå, funktioner inom bataljon, framtagande av stridsplan, beslutsfattning, orderträning, ledarskapsutveckling.",
      "purpose": "Att utveckla och fördjupa färdigheter i bataljonchefsbefattningen för att kunna leda bataljon vid skydd och bevakning av objekt, flygbas, broar och förbindelser.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla en stridsplan och leda bataljon vid skydd och bevakning av objekt med begränsad tid.",
      "secondaryLearningObjectives": [
        "Tillämpa bedömandemallen och planering under tidspress (PUT) för att skapa stridsplan utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar stridsplanen och behovet av samordning mellan militära och civila aktörer.",
        "Värdera hur kompanier leds och samordnas över tid vid skydd och bevakning av flygbas, broar och förbindelser.",
        "Beskriva hur bataljonen kan försvara knutpunkt mot luftlandsatt motståndare.",
        "Förstå insatsreglernas påverkan på bataljonchefens agerande.",
        "Utveckla det indirekta ledarskapet.",
        "Identifiera och beskriva bataljonchefens ansvar och konsekvenser av beslut ur ett moraliskt och etiskt perspektiv i fred och kris."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av MR-order, användande av 5-punktsorder enligt handbok samt agerande i rollen som bataljonchef utvärderas fortlöpande under kursen. Examination sker även genom spel på stridsplaner med applikatoriska exempel. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd bataljonchefskurs 1.",
        "Brukare av informationssystem hemvärnet (ISHV)."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok Ledning Bataljon 2007",
        "Handbok Hemvärnsbataljon (remissutgåva)",
        "Handbok Hemvärnskompani del 1-3 2017",
        "Handbok Markstrid – Kompani 2016",
        "Handbok Markstrid – Motståndaren 2016",
        "Reglemente Armé Taktik 2013",
        "Handbok IKFN 2016",
        "Handbok Stabstjänst Grunder 2016"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Utbildning till bataljonchef omfattar två kurser: bataljonchefskurs 1 och bataljonchefskurs 2. Som fördjupning genomförs bataljonchefskurs 3.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131305"
    },
    {
      "id": "bataljonchef-3",
      "name": "Bataljonchefskurs 3",
      "shortName": "BC3",
      "category": "Chefsutbildningar",
      "courseCode": "HVT422FKB04",
      "description": "Kursen omfattar fördjupad bataljonchefsutbildning med fokus på föreläsningar, seminarier och grupparbeten. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, redovisningar och spel på framtagna planer.",
      "targetAudience": "Avsedd för dig som är i befattning som bataljonchef eller ställföreträdande bataljonchef.",
      "syllabus": "Fördjupade studier i ledarskap, samordning och samverkan mellan militära och civila aktörer, försvar av knutpunkter mot luftlandsatt motståndare, insatsregler samt kommunikationstjänst inom Försvarsmakten.",
      "purpose": "Att ge ökade kunskaper och färdigheter för djupare kompetens på bataljonchefsnivå.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som bataljonchef med fördjupad förmåga att leda och samordna bataljonen i fred, kris och krig.",
      "secondaryLearningObjectives": [
        "Använda kunskaper från lektioner och seminarier i praktisk tillämpning.",
        "Genomföra samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva och förklara försvar av knutpunkter mot luftlandsatt motståndare.",
        "Förstå och tillämpa insatsregler som påverkar bataljonchefens agerande.",
        "Utveckla och fördjupa det indirekta ledarskapet.",
        "Erhålla ökade kunskaper i Försvarsmaktens kommunikationstjänst.",
        "Identifiera och beskriva bataljonchefens ansvar samt konsekvenser av beslut ur ett moraliskt och etiskt perspektiv."
      ],
      "examination": "Relevanta och tillämpbara slutsatser ska kunna redovisas efter seminarier och föreläsningar. Kunskapskontroll av hemstudier genomförs. Aktivt deltagande och minst 90 % närvaro krävs för godkännande.",
      "prerequisites": [
        "Genomförd bataljonchefskurs 2.",
        "Minst 3 års tjänstgöring i befattning som bataljonchef eller ställföreträdande bataljonchef."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok Ledning Bataljon 2007",
        "Handbok Hemvärnsbataljon (remissutgåva)",
        "Handbok Markstrid – Motståndaren 2016",
        "Reglemente Armé Taktik 2013",
        "Handbok IKFN 2016"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Bataljonchefskurs 3 kan även nyttjas som repetitionskurs för erfarna bataljonchefer som inte genomfört kurs på HVSS under en längre tid (5-10 år). Utbildning till bataljonchef omfattar bataljonchefskurs 1 och 2 som grund, med bataljonchefskurs 3 som fördjupning.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131326"
    },
    {
      "id": "bataljonstridskurs",
      "name": "Bataljonstridskurs",
      "shortName": "BSTR",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB00",
      "description": "Grundläggande utbildning på bataljonsnivå med fokus på taktik på kompani och bataljon, funktioner inom bataljon, organisation och uppgifter i bataljonsstab samt framtagande och utmynnande i en stridsplan. Ledarskapsmoment ingår som en naturlig del i utbildningen.",
      "targetAudience": "Avsedd för dig som är placerad eller skall placeras i befattning som sektionschef och befäl i bataljonstab. Även öppen för funktionsplutonchefer och kompanichef/stf. Kan också genomföras som repetitionskurs för bataljonschefer/stf som inte genomfört kurs på många år.",
      "syllabus": "Taktik på kompani och bataljon, funktioner inom bataljon, organisation och uppgifter i bataljonsstab, framtagande av stridsplan, ledarskapsmoment.",
      "purpose": "Att ge deltagaren grundläggande kunskaper och färdigheter för att verka i bataljonsstab och leda bataljonsrelaterade uppgifter.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka i befattning som sektionschef eller befäl i bataljonstab och bidra till bataljonens stridsledning.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa taktik på kompani och bataljonsnivå.",
        "Kunna organisera och leda funktioner inom bataljon och bataljonsstab.",
        "Utveckla förmåga att ta fram och utmynna i en stridsplan.",
        "Tillämpa ledarskapsmoment i bataljonsmiljö."
      ],
      "examination": "Genom diskussioner, muntliga och skriftliga redovisningar samt spel på elevernas redovisningar. Aktivt deltagande krävs för godkännande.",
      "prerequisites": [
        "Grundkurs stabstjänst (gks)."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok Ledning Bataljon 2007",
        "Handbok Hemvärns-Bataljon/Komapni",
        "Handbok Markstrid – Kompani 2016",
        "Handbok Motståndaren 2016",
        "Arméreglemente Taktik 2013",
        "Handbok IKFN"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131346"
    },
    {
      "id": "instruktörskurs-1",
      "name": "Instruktörskurs 1",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar 80 timmar och består av teoretiska grunder samt praktiska trupputbildningsövningar. Undervisningen varvar teori med praktik. Elevledda övningar sker både inomhus och utomhus.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som gruppchef/stf alternativt ska bli instruktör inom hemvärnet.",
      "syllabus": "Teoretiska grunder i utbildningsmetodik, planering och genomförande av trupputbildningsövningar, praktiska elevledda övningar enligt HVSS övningsplansmall.",
      "purpose": "Efter genomförd och godkänd kurs tjänstgöra som biträdande generell instruktör inom hemvärnet och frivilligorganisation.",
      "primaryLearningObjective": "Att med handledning planera, genomföra och utvärdera motsvarande hemvärnsintroduktionsövningar (ej vapen) upp till grupps nivå.",
      "secondaryLearningObjectives": [
        "Bryta ner (analysera och förstå) tilldelad övning.",
        "Med handledning skriva övningsplan enligt HVSS fastställd mall samt genomföra övning och återkoppla till måluppfyllnad.",
        "Under övningsmoment och planskrivning kunna genomföra säkerhetsanalys och med handledning inarbeta riskhantering i övningsplanen.",
        "Använda förmedlad utbildningsmetod enligt handbok utbildningsmetodik.",
        "Använda utvärderingsmetoder enligt handbok utbildningsmetodik."
      ],
      "examination": "Praktiskt lärande examinationer där eleven ska använda sig av kurslitteratur för att planera och genomföra fyra övningar med stöd av HVSS övningsplansmall. Max 1 omexaminationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, GU eller GU-F."
      ],
      "literature": [
        "Handbok utbildningsmetodik",
        "MSR",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "För att erhålla gruppchefsgrad furir skall gruppchefskurs 1 och 2 också vara genomförda.",
      "typicalDuration": "10 dagar om totalt 80 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131404"
    },
    {
      "id": "instruktörskurs-2",
      "name": "Instruktörskurs 2",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar av övningsplaner samt elevledda övningar både inomhus och utomhus.",
      "targetAudience": "Kursen är avsedd för dig som är placerad i befattning som plutonchef/stf. Öppen i mån av plats för troppchef och gruppchef/stf i stridande befattning.",
      "syllabus": "Planering och genomförande av tre övningar med stöd av HVSS övningsplansmall. Övning 1 omfattar 30 minuter vapenutbildning baserat på AK4B manual. Övning 2 omfattar stridsutbildning med lös ammunition om 45 minuter där teori och praktik varvas. Övning 3 omfattar planering för introduktionsutbildning Hemvärn.",
      "purpose": "Att deltagaren efter genomförd kurs ska kunna tjänstgöra som allmän instruktör inom Hemvärnet och frivilligorganisation.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera introduktionsövningar upp till plutonsnivå med handledning.",
      "secondaryLearningObjectives": [
        "Bryta ner (analysera och förstå) tilldelad övning.",
        "Med handledning skriva övningsplan enligt HVSS mall samt genomföra övning och återkoppla till måluppfyllnad.",
        "Använda biträden och instruktörer vid planering och genomförande.",
        "Genomföra säkerhetsanalys och med handledning inarbeta riskhantering i övningsplanen.",
        "Använda förmedlad och gruppinriktad utbildningsmetod enligt handbok utbildningsmetodik.",
        "Använda utvärderingsmetoder enligt handbok utbildningsmetodik."
      ],
      "examination": "Praktiskt lärande examinationer där eleven ska använda kurslitteratur för att planera och genomföra tre övningar med stöd av HVSS övningsplansmall. Stor vikt läggs vid planeringsskrivning och tydlighet omfattande mål, krav och syfte. Max 1 examinationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, GU eller GU-F.",
        "Genomförd Instruktörskurs 1.",
        "Godkänt kompetensprov AK4 B/C."
      ],
      "literature": [
        "Handbok utbildningsmetodik",
        "MSR",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": null,
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131428"
    },
    {
      "id": "instruktörskurs-fusa-grupp",
      "name": "Instruktörskurs FUSA grupp",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar skjutinstruktörsutbildning för förbandsutbildning av hemvärnsgrupp med skarp ammunition i både dags- och mörkerförhållanden enligt gällande skjutreglemente. Fokus ligger på förmågan att instruera och utveckla soldater inom gruppens stridsteknik i olika stridsuppgifter och terräng. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för blivande skjutinstruktörer för förbandsutbildning av hemvärnsgrupp inom Hemvärnet.",
      "syllabus": "Instruktion i skjutreglemente och manualer för respektive vapen, säker vapenhantering, riskhantering, planering och genomförande av skjutövningar, tillämpning av eld och rörelse inom grupp, utvärdering av skjutresultat, användning av biträde och säkerhetskontrollant vid skjutövningar.",
      "purpose": "Att ge kursdeltagaren erforderlig kompetens att leda och genomföra grundläggande stridsutbildning för hemvärnsgrupp med skarp ammunition i både dags- och mörkerförhållanden.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande stridsutbildning för hemvärnsgrupp med skarp ammunition enligt gällande skjutreglemente och säkerhetsbestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manualer med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för skjutterräng.",
        "Genomföra riskhantering före, under och efter skjutövningar.",
        "Kunna använda eld och rörelse inom skyttegrupp.",
        "Kunna utvärdera skjutresultat och genomförande.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och förmåga som skjutledare genom kortare genomförandemoment under kursen samt ett uppslagsprov i säkerhetsbestämmelser. Max tre examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 och 2.",
        "Genomförd instruktörskurs säkr skjutbana och säkr avlyst terräng.",
        "Godkänd skjutinstruktörsutbildning för respektive vapen.",
        "Väl förtrogen med handbok hemvärnsgrupp-pluton.",
        "Godkänt omdöme och personlig färdighet.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkerhetsbestämmelser (säkr)",
        "Skjutreglemente för respektive vapen",
        "Manual för respektive vapen",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131450"
    },
    {
      "id": "instruktörskurs-gevär-22-ungdomsvapen",
      "name": "Instruktörskurs Gevär 22 Ungdomsvapen",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ6121005",
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för gevär .22 ungdom med fokus på förmågan att instruera och utveckla ungdomar till goda säkerhetsmedvetna skyttar inom respektive ungdomsorganisation. Kursen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som blivande skjutinstruktör gevär 22 ungdom.",
      "syllabus": "Studier av skjutreglemente, manualer och lokala bestämmelser. Praktiska moment med skjutförmåga och trupputbildning som skjutinstruktör.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för gevär 22 ungdom.",
      "primaryLearningObjective": "Efter genomförd kurs ska eleven kunna planera, genomföra och utvärdera grundläggande brukarutbildning med gevär 22 på av Försvarsmakten godkända skjutbanor med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente gevär 22.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala regler för skjutbana.",
        "Kunna använda riskhantering före, under och efter övning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt ett uppslagsprov i säkerhet. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning.",
        "Godkänt omdöme och personlig färdighet.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutr gevär 22 2004",
        "Manual gevär 22",
        "Lokala bestämmelser"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS). Organisationsenheten förordnar och ordersätter godkänd elev med giltighet om högst 5 år. Förordnandet specificerar skjutbana/skjutfält/skjutplats. Vid verksamhet utanför egen organisationsenhet krävs utbildning på lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131508"
    },
    {
      "id": "instruktörskurs-granattillsats-ak4b",
      "name": "Instruktörskurs Granattillsats Ak4B",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för granattillsats AK enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som skyttar inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör för AK granattillsats inom Hemvärnet.",
      "syllabus": "Instruktion och utveckling av skyttar, säkerhetsbestämmelser, skjutövningar med granattillsats AK, tillämpning av riskhantering och säkerhetskontroll vid skjutövningar.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på granattillsats AK för Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska eleven kunna planera, genomföra och utvärdera grundläggande brukarutbildning med granattillsats AK på godkända skjutbanor eller fast skjutplats med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för granattillsats med tyngdpunkt på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala föreskrifter för aktuell skjutbana.",
        "Använda riskhantering före, under och efter egen övning.",
        "Kunna använda biträde/säkerhetskontrollant vid skjutövningar och lösa uppgiften som säkerhetskontrollant."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt förmåga att instruera under kursens praktiska moment. Skriftligt uppslagsprov i säkerhet genomförs. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs AK4 del 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning automatkarbin.",
        "Godkänt omdöme och personlig färdighet.",
        "Genomförd registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente granattillsats",
        "Manual granattillsats",
        "Lokala bestämmelser"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan i utbildningsgrupp eller frivilligorganisation. Organisationsenheten förordnar och ordersätter godkänd elev med giltighet upp till 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131527"
    },
    {
      "id": "instruktörskurs-grg-m48",
      "name": "Instruktörskurs Grg m/48",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111556",
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för granatgevär m/48 enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som grg-skyttar inom hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana och innehåller både teori och praktik.",
      "targetAudience": "Avsedd för blivande skjutinstruktörer för granatgevär m/48 inom hemvärnet.",
      "syllabus": "Instruktion i handhavande, säkerhet, skjutteknik och utbildningsmetodik för granatgevär m/48. Praktiska moment i skjutterräng och skjutbana med övningar i skjutledning och utbildning av skyttar.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på granatgevär m/48 för hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning avseende skjutningar med granatgevär m/48 på godkända skjutbanor eller fast skjutplats med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa gällande skjutreglementen och manualer med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för aktuell skjutbana.",
        "Använda riskhantering före, under och efter egen övning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar och lösa säkerhetsuppgifter.",
        "Utveckla förmåga att instruera och leda skjututbildning för granatgevärsskyttar."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt förmåga att instruera under kursens praktiska moment. Skriftligt uppslagsprov i säkerhet genomförs. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs automatkarbin del 1 med godkänt resultat.",
        "Genomförd instruktörskurs säker skjutbana.",
        "Egen brukarutbildning i granatgevär m/48.",
        "Godkänt registerkontroll enligt organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjutning granatgevär m/48",
        "Manual 8,4 cm granatgevär",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan i utbildningsgrupp eller frivilligorganisation enligt fastställda instruktioner. Förordnande som skjutinstruktör gäller i högst 5 år och omfattar specifik skjutbana/skjutfält.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131548"
    },
    {
      "id": "instruktörskurs-is-hv",
      "name": "Instruktörskurs IS Hv",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar teknik- och metodutbildning för instruktörer som ska verka med informationssystem inom Hemvärnet. Utbildningen genomförs som teoretiska föreläsningar och praktiska moment.",
      "targetAudience": "Avsedd för dig som ska verka som IS Hv-instruktör vid egen bataljonsstab och är krigsplacerad i bataljonsstaben.",
      "syllabus": "Teknisk systemkunskap, montage och uppsättning, installation och laddning av grunddata, klienthantering, antivirus, kontoadministration, meddelandehantering, verksamhetsjournal, tablåer, mallar och fillagring samt metodutbildning för utbildning av användare.",
      "purpose": "Att deltagaren efter kursen ska kunna utbilda egen bataljonsstab i informationssystemet IS Hv och utveckla sin egen förmåga över tid.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna beskriva och tillämpa programvaror som Sitaware avseende karttjänst, lägeskarta, lagerhantering, orderhantering samt systemkunskap inklusive installation, uppsättning och drift av IS Hv.",
      "secondaryLearningObjectives": [
        "Beskriva och tillämpa montage och uppsättning inklusive stand-alone-lösningar.",
        "Hantera klientadministration och arkivering.",
        "Använda allmän programvara och antivirusprogram.",
        "Genomföra metodutbildning avseende kontoadministration och meddelandehantering.",
        "Planera och genomföra utbildning av användare i IS Hv."
      ],
      "examination": "Kursen avslutas med ett enskilt teoretiskt prov och en gruppexamination i form av en stabsorientering. Max 2 examinationstillfällen under kurstiden.",
      "prerequisites": [
        "Genomförd kurs FM AP/HR.",
        "Krigsplacerad i bataljonsstaben."
      ],
      "literature": [
        "Metodhandbok IS Hv 1 & 2"
      ],
      "additionalInfo": "Frivilliga Radioorganisationen har uppdraget som frivilligorganisation för kursen.",
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131607"
    },
    {
      "id": "instruktörskurs-ksp-58b",
      "name": "Instruktörskurs Ksp 58B",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för kulspruta m/58 enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som skyttar inom hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana och innehåller både teori och praktik.",
      "targetAudience": "Avsedd för blivande skjutinstruktörer för kulspruta m/58 inom hemvärnet.",
      "syllabus": "Instruktion och utveckling av skyttar, säkerhetsbestämmelser, skjutförmåga, praktiska övningar i skjutterräng/skjutbana.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för kulspruta m/58 inom hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning avseende skjutningar med kulspruta m/58 på godkända skjutbanor eller fasta skjutplatser med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa gällande skjutreglemente och manual för kulspruta m/58 med fokus på säker vapenhantering.",
        "Tillämpa säkerhetsbestämmelser och lokala regler för skjutbana där deltagaren är förordnad.",
        "Använda riskhantering före, under och efter skjutövningar.",
        "Använda biträde och säkerhetskontrollant vid skjutövningar samt kunna lösa säkerhetskontrollantens uppgifter."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt trupputbildningsförmåga genom praktiska moment och skriftligt uppslagsprov. Max tre examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs AK4 del 1.",
        "Instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning med kulspruta m/58.",
        "Godkänt kompetensprov för vapen.",
        "Registerkontroll genomförd enligt organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjutning ksp m/58",
        "Manual ksp m/58",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS) utan vid utbildningsgrupp eller frivilligorganisation.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131628"
    },
    {
      "id": "instruktörskurs-oden",
      "name": "Instruktörskurs ODEN",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande teoretisk och praktisk utbildning i förmågan att möta fientliga förband i olika konfliktnivåer samt att lösa stridsuppgiften störa och/eller bedriva fortsatt motstånd. Utbildningen genomförs som lärarledda lektioner och praktiska moment i terrängen.",
      "targetAudience": "Avsedd för yrkesofficer placerad på militärregionens utbildningsgrupp som instruktör eller utbildningsansvarig.",
      "syllabus": "Teoretiska föreläsningar och praktiska övningar med fokus på planering och ledning av stridsinsatser för att störa motståndare. Innehåller moment om infiltration, passage av egna linjer, exfiltration, möte med annan enhet, spaning, upplagstjänst samt samverkan med civila samhällsaktörer.",
      "purpose": "Att som utbildningsbefäl öka förmågan att lägga upp egna övningar för hemvärnsförband mot realistisk motståndare och stödja hemvärnsförband vid tilldelning av utländska resurser.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, leda och genomföra stridsinsatser i syfte att störa motståndares förband eller verksamhet inom eget ansvarsområde.",
      "secondaryLearningObjectives": [
        "Förstå motståndarens beteende vid olika konfliktnivåer.",
        "Kunskap om stridsmetoder såsom överfall och eldöverfall.",
        "Kunskap i infiltration, passage och exfiltration.",
        "Kunskap i möte med annan enhet och spaning för egen strid.",
        "Förståelse för risker och fördelar vid kontakt med civila samhällsaktörer."
      ],
      "examination": "Praktiskt lärande examinationer där elevens förmåga att omsätta teori i praktik värderas fortlöpande under kursen. Eleven genomför egen planering av motsvarande utbildning vid egen utbildningsgrupp.",
      "prerequisites": [
        "Genomförd officersprogrammet (OP) eller motsvarande utbildning."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "11 dagar, totalt 120 timmar varav 4 fältdygn.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131649"
    },
    {
      "id": "instruktörskurs-pansarskott-m86",
      "name": "Instruktörskurs Pansarskott m86",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för pansarskott m/86 enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som skyttar inom hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör för pansarskott m/86 inom hemvärnet.",
      "syllabus": "Teoretiska och praktiska moment med fokus på vapenhantering, säkerhetsbestämmelser, skjutinstruktion och utbildning av skyttar. Kursen innehåller övningar i skjutterräng/skjutbana samt tillämpning av reglementen och manualer.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på pansarskott m/86 för hemvärnet.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning avseende skjutningar med pansarskott m/86 på godkända skjutbanor eller fast skjutplats med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för pansarskott m/86 med tyngdpunkt på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för aktuell skjutbana.",
        "Kunna använda riskhantering före, under och efter egen övning.",
        "Kunna använda biträde/säkerhetskontrollant vid skjutövningar och kunna lösa uppgiften som säkerhetskontrollant."
      ],
      "examination": "Fortlöpande praktiska examinationer av personlig färdighet och skjutförmåga samt förmåga att instruera. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs AK4 del 1.",
        "Instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning med pansarskott m/86.",
        "Godkänt kompetensprov för vapen.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjutning pansarskott m/86",
        "Manual pansarskott m/86",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS). Efter godkänd kurs förordnas eleven av organisationsenheten med giltighet i fem år.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131712"
    },
    {
      "id": "instruktörskurs-pistol-88",
      "name": "Instruktörskurs Pistol 88",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för pistol 88 enligt gällande skjutreglemente och övningsföreskrifter. Fokus ligger på att utveckla förmågan att instruera och utveckla soldater som skyttar inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana med både teoretiska och praktiska moment.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör pistol 88 inom Hemvärnet.",
      "syllabus": "Studier av skjutreglemente, handbok för pistol 88, säkerhetsbestämmelser, skjutteknik, vapenhantering, pedagogik för instruktörer samt praktisk instruktion och övning i skjutbana.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för pistol 88 inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande skjututbildning med pistol 88 på godkända skjutbanor, med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för pistol 88 med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala regler för skjutbana.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Utveckla förmåga att instruera och leda skjututbildning för skyttar inom Hemvärnet."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga under kursen genom praktiska moment och uppslagsprov i säkerhet. Max tre examinationstillfällen ges. Godkänt betyg krävs på samtliga examinationer.",
      "prerequisites": [
        "Genomförd instruktörskurs 1.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Genomförd brukarutbildning och eget kompetensprov med pistol 88.",
        "Godkänt omdöme av omdöme och föregångsmannaskap.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente FM grunder 2011",
        "Manual Pistol 88",
        "Skjutreglemente FM öft pistol",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan i utbildningsgrupp eller frivilligorganisation. Organisationsenheten förordnar och ordersätter godkänd elev med giltighet upp till 5 år. Förordnandet specificerar skjutbana/skjutfält där instruktören får verka. Vid verksamhet utanför egen enhet krävs utbildning på lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 18 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131733"
    },
    {
      "id": "instruktörskurs-psg90-alt-ak4b-med-kikarsikte",
      "name": "Instruktörskurs Psg90 alt. AK4B med kikarsikte",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för AK4 eller PSG90 med kikarsikte enligt gällande skjutreglemente. Fokus ligger på förmågan att instruera och utveckla soldater som skyttar inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana med teori och praktik.",
      "targetAudience": "Avsedd för dig som blivande skjutinstruktör för AK4 eller PSG90 inom Hemvärnet.",
      "syllabus": "Studier av skjutreglemente, handböcker och säkerhetsbestämmelser. Praktisk skjutinstruktörsutbildning med övningar i terräng och på skjutbana. Tillämpning av säkerhets- och riskhanteringsrutiner samt användning av biträde/säkerhetskontrollant vid skjutövningar.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för AK4 eller PSG90 med kikarsikte inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning i skjutning med AK4 eller PSG90 med kikarsikte, med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för vapnet med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala regler för skjutbana/skjutterräng.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde/säkerhetskontrollant vid skjutövningar.",
        "Kunna instruera och utveckla skyttar inom Hemvärnet."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt förmåga att leda trupputbildning som skjutinstruktör. Skriftligt uppslagsprov i säkerhet och skjutreglemente. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "För AK4 med kikarsikte även instruktörskurs skjutr AK4B del 1 med godkänt resultat.",
        "Brukarutbildning och eget kompetensprov med aktuellt vapen.",
        "Registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente FM Grunder 2011",
        "Manual PSG90/AK4",
        "Skjutreglemente FM ÖFT",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan hos utbildningsgrupp eller frivilligorganisation. Förordnande och ordersättning sker av organisationsenheten med giltighet upp till 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131753"
    },
    {
      "id": "instruktörskurs-rekrytering",
      "name": "Instruktörskurs Rekrytering",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar teoretiska och praktiska moment inomhus och utomhus, inklusive yrkesinformatörsutbildningen. Fokus ligger på vägen in i Försvarsmakten, olika utbildningsinriktningar och FM värdegrund samt praktisk tillämpning av rekryteringsmateriel. Deltagaren planerar och genomför en rekryteringsaktivitet.",
      "targetAudience": "Blivande utbildare av yrkesinformatörer.",
      "syllabus": "Teoretiska moment om Försvarsmaktens värdegrund och utbildningsvägar, praktisk träning i rekryteringsaktiviteter, användning av rekryteringsmateriel.",
      "purpose": "Att ge deltagaren färdighet att planera, genomföra och utvärdera yrkesinformatörsutbildning samt leda och planera lokala rekryteringsbefrämjande verksamheter.",
      "primaryLearningObjective": "Efter genomförd utbildning ska eleven kunna planera, genomföra och utvärdera yrkesinformatörsutbildning samt rekryteringsaktiviteter.",
      "secondaryLearningObjectives": [
        "Planera och leda rekryteringsaktiviteter.",
        "Tillämpa Försvarsmaktens värdegrund i rekryteringsarbete.",
        "Använda rekryteringsmateriel på ett effektivt sätt."
      ],
      "examination": "Deltagande i all verksamhet under kursen samt genomförande av rekryteringsaktivitet. Max 1 genomförande under aktuell kurs.",
      "prerequisites": [],
      "literature": [
        "Framtaget kursmaterial från HVSS samt HRC (fastlagt underlag från HRC för blivande yrkesinformatörer)."
      ],
      "additionalInfo": "Kursen genomförs tillsammans med HRC.",
      "typicalDuration": "5 dagar om totalt 46 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131810"
    },
    {
      "id": "instruktörskurs-skjutr-ak-4bc-del-1",
      "name": "Instruktörskurs SkjutR AK 4B/C del 1",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för AK4 enligt gällande skjutreglemente med fokus på att instruera och utveckla skyttar inom Hemvärnet. Utbildningen innehåller teori och praktik i skjutteknik, säkerhet och pedagogik, samt tillämpning i trupputbildningsmoment.",
      "targetAudience": "Avsedd för dig som ska bli skjutinstruktör AK4 inom Hemvärnet.",
      "syllabus": "Studier av skjutreglementen och handböcker, skjututbildning och skjutinstruktörsspecifik utbildning, praktiska trupputbildningsmoment med övningsledare och övningstrupp.",
      "purpose": "Att ge kursdeltagaren erforderlig kompetens att utses till övningsledare vid skjututbildning bas med AK4 och därigenom kunna utbilda och träna personal i skjutteknik enligt gällande reglemente.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna planera, genomföra och utvärdera skjututbildning med AK4 som övningsledare enligt gällande säkerhets- och utbildningsbestämmelser.",
      "secondaryLearningObjectives": [
        "Förklara sjukvårdsberedskap och dess tillämpning enligt säkerhetsbestämmelser.",
        "Förklara konstruktion och tillämpning av riskområden för eldhandvapen på skjutbana.",
        "Förklara vapenverkan av finkalibrig ammunition och skjutbanans uppbyggnad.",
        "Tillämpa centrala och lokala säkerhets- och miljöbestämmelser vid skarpskjutning.",
        "Planera, genomföra och utvärdera skjututbildning för brukare med AK4.",
        "Värdera truppens förmåga och anpassa utbildningsmoment efter behov.",
        "Analysera och utveckla skyttars skjutteknik."
      ],
      "examination": "Examination sker genom skriftliga prov och individuella muntliga/skriftliga redovisningar, samt bedömning av personlig färdighet och förmåga att tillämpa gällande skjutreglemente och säkerhetsbestämmelser. Obligatorisk närvaro krävs. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Godkänt kompetensprov AK4B/C.",
        "Registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjututbildning 2021",
        "Reglemente skjutning automatkarbin 2021",
        "Handbok skjututbildning automatkarbin 2021",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 25 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131833"
    },
    {
      "id": "instruktörskurs-skjutr-ak-4bc-del-2",
      "name": "Instruktörskurs SkjutR AK 4B/C del 2",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för AK4 med fokus på att utveckla förmågan att instruera och leda skjututbildning med AK4 inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana och kombinerar teori och praktik.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör AK4 inom Hemvärnet och som genomfört Instruktörskurs SkjutR AK 4B/C del 1 med godkänt resultat.",
      "syllabus": "Fördjupad skjutteknik och vapenhantering, pedagogik för skjututbildning, säkerhetsbestämmelser, planering och genomförande av skjutövningar, användning av övningsledarens verktyg och metoder, samt tillämpning av reglemente och lokala bestämmelser.",
      "purpose": "Att utbilda kompetenta skjutinstruktörer som kan planera, genomföra och utvärdera skjututbildning med AK4 enligt gällande reglementen och säkerhetsföreskrifter inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna fungera som skjutinstruktör för AK4 och leda skjututbildning enligt Försvarsmaktens reglementen och säkerhetsbestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser och riskhantering vid skjutövningar med AK4.",
        "Planera och genomföra skjutövningar med AK4 utifrån gällande reglementen och lokala bestämmelser.",
        "Instruera och utveckla skyttar i skjutteknik och vapenhantering för AK4.",
        "Använda pedagogiska metoder och övningsplaner för effektiv skjututbildning.",
        "Genomföra utvärdering och återkoppling av skjutövningar."
      ],
      "examination": "Praktiska och teoretiska examinationer genomförs under kursen, inklusive skriftligt uppslagsprov och bedömning av personlig färdighet och pedagogisk förmåga. Max tre examinationstillfällen ges.",
      "prerequisites": [
        "Genomförd Instruktörskurs SkjutR AK 4B/C del 1 med godkänt resultat.",
        "Genomförd instruktörskurs Säkr Skjutbana.",
        "Godkänt kompetensprov AK 4B/C.",
        "God fysisk status.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjututbildning 2021",
        "Reglemente skjutning automatkarbin 2021",
        "Handbok skjututbildning automatkarbin 2021",
        "Lokala bestämmelser för skjutbana/skjutfält",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 25 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131852"
    },
    {
      "id": "instruktörskurs-stabstjänst",
      "name": "Instruktörskurs stabstjänst",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Grundläggande kurs i stabsarbetsmetodik för utbildningsofficerare vid utbildningsgrupp. Kursen omfattar organisation, indelning och uppgifter vid hemvärnsbataljonsstab samt hur staben verkar över tid med fokus på instruktörens uppföljning och stöd av stabens arbete. Utbildningen genomförs med lärarledda lektioner, seminariediskussioner, grupparbeten och en avslutande stabsövning.",
      "targetAudience": "Avsedd för dig som är eller skall placeras som utbildningsbefäl på en utbildningsgrupp. Även öppen för övriga som utbildar stabsmedlemmar och/eller är stabsinstruktör på stabsövningar.",
      "syllabus": "Organisation och uppgifter i bataljonsstab, stabsprocesser, planering under tidspress (PUT), informationsspridning och handläggning, användning av informationssystem IS HV, instruktörens roll i stabsarbetet, praktisk stabsövning.",
      "purpose": "Att ge deltagaren grundläggande färdighet att utbilda och öva en bataljonsstab samt verka som instruktör vid grundkurs stabstjänst.",
      "primaryLearningObjective": "Kunna verka som instruktör vid grundkurs stabstjänst och stödja stabens arbete.",
      "secondaryLearningObjectives": [
        "Kunna verka som stabstjänstinstruktör vid exempelvis kompanichefsövning, ledningsträningsövning eller motsvarande.",
        "Förklara och tillämpa planeringsmetodiken planering under tidspress (PUT) i stabens arbete.",
        "Förklara hur planering, genomförande och uppföljning sker i stab samt framtagandet av relevanta beslutsunderlag.",
        "Beskriva hur information sprids, klassificeras, fördelas och handläggs inom staben.",
        "Använda informationssystem IS HV vid planering, genomförande och uppföljning."
      ],
      "examination": "Praktiskt lärande examination i form av deltagande och agerande i en formell stabsövning i slutet av kursen. Godkänt kräver aktivt deltagande.",
      "prerequisites": [
        "Behörighet som brukare av informationssystem IS HV."
      ],
      "literature": [
        "Metodhandbok ledning bataljon 2007",
        "AH Ledning 2016",
        "Handbok stabstjänst 2016",
        "Handbok samband expeditionstjänst 2020",
        "Handbok utbildningsmetodik 2013",
        "Handbok hemvärnsbataljon (remissutgåva)"
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131914"
    },
    {
      "id": "instruktörskurs-säkr-avlyst-terräng",
      "name": "Instruktörskurs SäkR avlyst terräng",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning med finkaliber i avlyst terräng med riskområde. Undervisningen sker huvudsakligen i lektionssal med inslag av praktik.",
      "targetAudience": "Avsedd för dig som blivande skjutinstruktör för finkaliber inom hemvärnet i avlyst terräng.",
      "syllabus": "Studier av säkerhetsbestämmelser (SäkR), riskhantering, manual för respektive vapen, lokala bestämmelser för skjutterräng, samt pedagogiska grunder. Praktiska moment med tillämpning av säkerhetsregler i terräng.",
      "purpose": "Att ge kursdeltagaren erforderlig kompetens att planera, genomföra och utvärdera finkalibriga skjutövningar i avlyst terräng med hänsyn till säkerhet enligt SäkR, med stöd av övningsledare.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande skjututbildning med finkaliber i avlyst terräng med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa SäkR riskområde för lokal skjutterräng som deltagaren avses förordnas på.",
        "Kunna använda riskhantering före, under och efter egen övning.",
        "Kunna strukturera övningen i ett skriftligt PM (plan).",
        "Kunna använda biträde/säkerhetskontrollant vid genomförande och lösa uppgiften som säkerhetskontrollant vid skjutövningar på skjutfält (FUSA)."
      ],
      "examination": "Fortlöpande bedömning av personlig förmåga att omsätta och tillämpa SäkR bestämmelser i terräng samt skriftligt uppslagsprov i SäkR. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs säkr skjutbana.",
        "Genomförd instruktörskurs för aktuellt vapen med godkänt resultat.",
        "Eget brukarutbildning och kompetensprov för aktuellt vapen.",
        "God fysik och gott omdöme.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "SäkR",
        "Riskhantering",
        "Manual för respektive vapen",
        "Lokala bestämmelser för skjutterräng",
        "Pedagogiska grunder"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131934"
    },
    {
      "id": "instruktörskurs-säkr-skjutbana",
      "name": "Instruktörskurs SäkR skjutbana",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar fortsatt grundläggande skjutsäkerhetsutbildning för finkaliber och pedagogik på skjutbana. Utbildningen genomförs huvudsakligen på skjutbana eller fast skjutplats/skjutfält och kan anpassas för specifika vapen och lokala förhållanden. Kursen ger kompetens att verka som skjutinstruktör på skjutbana med finkalibriga vapen inom Hemvärnet.",
      "targetAudience": "Avsedd för dig som ska verka som skjutinstruktör på skjutbana med finkalibriga vapen inom Hemvärnet.",
      "syllabus": "Säkerhetsbestämmelser och miljöregler för skjutbana, pedagogik för övningsledning, riskhantering, planering och genomförande av skjutövningar, användning av biträde och säkerhetskontrollant, tillämpning av lokala bestämmelser för skjutbana/skjutfält.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för skjutning med finkalibriga vapen på skjutbana inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande skjututbildning med finkalibriga vapen på skjutbana enligt gällande säkerhetsbestämmelser och reglementen.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser för skjutbana och riskområden.",
        "Kunna använda pedagogiska metoder för övningsledning på skjutbana.",
        "Genomföra riskhantering före, under och efter skjutövningar.",
        "Använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Tillämpa lokala bestämmelser och säkerhetsrutiner på skjutbana/skjutfält."
      ],
      "examination": "Fortlöpande bedömning av personligt omdöme och föregångsmannaskap under kursen. Skriftligt uppslagsprov i säkerhet vid skjutning på skjutbana samt prov på lokala bestämmelser. Max tre examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Eget kompetensprov med aktuellt vapen.",
        "God fysisk status och gott omdöme.",
        "Registerkontroll enligt gällande riktlinjer."
      ],
      "literature": [
        "Reglemente skjututbildning finkaliber",
        "Reglemente kompetensprov AK 4 HV",
        "Reglemente skjutning automatkarbin övning och fastställt skjutreglemente för aktuellt vapen",
        "Manual för aktuellt vapen",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Organisationsenheten förordnar och ordersätter godkänd elev med giltighet upp till 5 år. Om instruktören verkar utanför egen organisationsenhet ska utbildning ske enligt lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 18 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-131954"
    },
    {
      "id": "instruktörskurs-tårgas",
      "name": "Instruktörskurs Tårgas",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande utbildning för hantering av tårgas med teoretiska lektioner och praktiska moment. Fokus ligger på säkerhet, riskhantering och tillämpning enligt gällande regelverk.",
      "targetAudience": "Avsedd för dig som ska verka som instruktör med tårgasbehörighet inom Hemvärnet.",
      "syllabus": "Teoretiska moment om säkerhetsbestämmelser, riskhantering och tårgasmateriel. Praktiska övningar i täthetskontroll och hantering av tårgas enligt gällande manual och föreskrifter.",
      "purpose": "Att ge kursdeltagaren kompetens att planera, genomföra och utvärdera täthetskontroller med tårgas enligt säkerhetsbestämmelser med stöd av övningsledare.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna planera, genomföra och utvärdera grundläggande täthetskontroller med tårgas som instruktör inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser och riskhantering vid användning av tårgas.",
        "Kunna strukturera övningar i skriftlig övningsplan (PM).",
        "Behärska hantering av tårgas och tillhörande materiel enligt gällande manual och ammunitionföreskrifter."
      ],
      "examination": "Fortlöpande bedömning av personlig förmåga att omsätta säkerhetsbestämmelser i praktiken samt skriftligt uppslagsprov. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Godkänt registerkontroll enligt respektive organisationsenhet eller frivilligorganisation.",
        "Särskilt gott omdöme och personlig lämplighet."
      ],
      "literature": [
        "Säkr",
        "Riskhantering",
        "Manual Tårgas",
        "Lokala bestämmelser",
        "Pedagogiska grunder"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS). Förordnande sker av organisationsenhet med giltighet upp till 5 år. Vid verksamhet utanför egen enhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132014"
    },
    {
      "id": "instruktörskurs-grundkurs-övningsledare-strisim-pc",
      "name": "Instruktörskurs grundkurs övningsledare Strisim PC",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar teoretiska och praktiska moment för att utbilda övningsledare i stridsimulering med StriSim PC. Deltagaren lär sig säkerhetsbestämmelser, materielkunskap, IT- och tillträdessäkerhet, samt planering, genomförande och utvärdering av stridsutbildning med stöd av StriSim PC.",
      "targetAudience": "Civil och militär personal inom Försvarsmakten som ska utbilda och öva med brukare i StriSim PC. För Hemvärnet krävs instruktörskurs 1 samt god insikt i hemvärnets stridsteknik på bevaknings- och insatskompani.",
      "syllabus": "Säkerhetsbestämmelser och materielkunskap för StriSim PC och programvaror, IT- och tillträdessäkerhet, hantering av skydd mot skadlig kod, planering, genomförande och utvärdering av stridsutbildning och andra övningar med StriSim PC, rutiner för rapportering av fel och brister i system eller programvara.",
      "purpose": "Att tillgodose Försvarsmaktens behov av övningsledare i StriSim PC.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna planera, genomföra och utvärdera enklare övningar i StriSim PC samt hantera systemets och programvarans brukarfunktioner.",
      "secondaryLearningObjectives": [
        "Starta och använda aktuella programvaror.",
        "Anpassa inställningar och skapa grundläggande scenarion i VBS.",
        "Lämna underlag till systemoperatör för större eller avancerade scenarion.",
        "Använda grundläggande funktioner i real time editor (RTE)/VBS under övning.",
        "Använda grundläggande funktioner i utvärderingsverktyget (AAR).",
        "Rapportera fel och brister i programvara och system."
      ],
      "examination": "Kursen examineras genom skriftliga och praktiska prov. Betyg ges i tvågradig skala: godkänd (G) eller icke godkänd (IG). Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Erforderlig kompetens att leda stridsutbildning eller annan utbildning och övning i den verksamhet som ska bedrivas med stöd av StriSim PC.",
        "För Hemvärnet krävs instruktörskurs 1 samt god insikt i hemvärnets stridsteknik på bevaknings- och insatskompani."
      ],
      "literature": [
        "Instruktionsbok StriSim PC",
        "Övningshäfte StriSim PC grundkurs"
      ],
      "additionalInfo": "Beroende på vilken StriSim PC-anläggning som används kan antalet elevplatser variera.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132034"
    },
    {
      "id": "instruktörskurs-fortsättningskurs-övningsledare-strisim-pc",
      "name": "Instruktörskurs fortsättningskurs övningsledare Strisim PC",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar teoretiska och praktiska moment för övningsledare i Stridsimulator PC (Strisim PC). Fokus ligger på säkerhetsbestämmelser, materielkunskap, IT- och tillträdessäkerhet, samt planering, genomförande och utvärdering av stridsutbildning och övningar med stöd av Strisim PC. Kursen behandlar även rutiner för rapportering av fel och brister i system och programvara.",
      "targetAudience": "Civil och militär personal inom Försvarsmakten som ska utbilda och öva med brukare i Strisim PC. För Hemvärnet krävs instruktörskurs 1 samt god insikt i hemvärnets stridsteknik på bevaknings- och insatskompani.",
      "syllabus": "Säkerhetsbestämmelser och materielkunskap för Strisim PC och programvaror. IT- och tillträdessäkerhet. Hantering av skydd mot skadlig kod. Planering, genomförande och utvärdering av stridsutbildning och övningar med stöd av Strisim PC. Rutiner för rapportering av fel och brister i system eller programvara.",
      "purpose": "Att tillgodose Försvarsmaktens behov av kompetenta övningsledare i Strisim PC som kan planera, genomföra och utvärdera övningar med systemet.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna planera, genomföra och utvärdera avancerade övningar i Strisim PC samt använda avancerade funktioner i programvaran.",
      "secondaryLearningObjectives": [
        "Behärska säkerhetsbestämmelser och materielkunskap avseende Strisim PC och programvaror.",
        "Tillämpa IT- och tillträdessäkerhet för Strisim PC.",
        "Hantera skydd mot skadlig kod.",
        "Anpassa inställningar och skapa avancerade scenarion i VBS.",
        "Stödja systemoperatör vid utbildning av instruktörer.",
        "Rapportera fel och brister i programvara och system."
      ],
      "examination": "Kursen examineras genom skriftliga och praktiska prov. Betyg ges enligt tvågradig skala: godkänd (G) eller icke godkänd (IG). Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd grundkurs övningsledare Strisim PC.",
        "Erforderlig kompetens att leda stridsutbildning eller annan utbildning och övning i verksamhet som bedrivs med stöd av Strisim PC.",
        "För Hemvärnet: instruktörskurs 1 samt god insikt i hemvärnets stridsteknik på bevaknings- och insatskompani."
      ],
      "literature": [
        "Instruktionsbok Strisim PC.",
        "Övningshäfte Strisim PC fortsättningskurs."
      ],
      "additionalInfo": "Antalet elevplatser kan variera beroende på vilken Strisim PC-anläggning som används.",
      "typicalDuration": "2,5 dagar om totalt 20 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132055"
    },
    {
      "id": "halvar-huvudinstruktörskurs",
      "name": "HALVAR Huvudinstruktörskurs",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar upprättande och användande av skyddsvaktsträningsanläggning HALVAR i dagsljus och mörker på skjutbana respektive i avlyst terräng vid utbildning av poster och skyddsvakter. Utbildningen fokuserar på materielkunskap, drift och praktiska övningar i skyddsvaktsträningsanläggningen. Elever ur kursen fungerar som biträdande lärare/instruktörer under parallella HALVAR-instruktörskurser.",
      "targetAudience": "Avsedd för dig som är halvar-instruktör och ska bli huvudinstruktör för skyddsvaktsträningsanläggning HALVAR.",
      "syllabus": "Upprättande och drift av skyddsvaktsträningsanläggning HALVAR, tillämpning av säkerhetsbestämmelser enligt Säkr och HVSS bestämmelser, planering, genomförande och utvärdering av riktad utbildning i post- och skyddsvaktstjänst, samt praktiska övningar i anläggningen.",
      "purpose": "Att som huvudinstruktör kunna säkerhetsmässigt upprätta och använda skyddsvaktsträningsanläggning HALVAR enligt gällande bestämmelser och därmed kunna leda utbildning av poster och skyddsvakter.",
      "primaryLearningObjective": "Efter kursen kunna tillämpa gällande bestämmelser och upprätta samt genomföra övningar i skyddsvaktsträningsanläggningen HALVAR.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa och förklara Säkr och lokala bestämmelser på skjutbana och i avlyst terräng.",
        "Kunna förklara och tillämpa HVSS bestämmelser för HALVAR.",
        "Kunna förbereda, genomföra och utvärdera riktad utbildning i post- och skyddsvaktstjänst med stöd av gällande lagar och förordningar.",
        "Kunna agera som biträdande lärare/instruktör vid HALVAR-instruktörskurser.",
        "Behärska materielkunskap inklusive upprättande och drift av skyddsvaktsträningsanläggningen."
      ],
      "examination": "Praktiska lärande examinationer avseende materielkunskap, upprättande och drift av anläggningen samt teoretiskt prov i HVSS bestämmelser för HALVAR. Eleven utvärderas fortlöpande under kursen med muntlig feedback från lärare och kurskamrater.",
      "prerequisites": [
        "Agerat som HALVAR-instruktör under minst ett år.",
        "Förordnad av utbildningsgrupp."
      ],
      "literature": "Säkr, HVSS bestämmelser för HALVAR 2013-03-23, HVSS scenarion för HALVAR 2012-03-05.",
      "additionalInfo": "Efter godkänd kurs förordnas eleven av HVSS till huvudinstruktör i fem år. Kursen omfattar cirka 45 timmar, varav huvuddelen är praktisk utbildning på övningsplats.",
      "typicalDuration": "5 dagar om totalt 45 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132117"
    },
    {
      "id": "halvar-instruktörskurs",
      "name": "HALVAR Instruktörskurs",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar upprättande och användande av skyddsvaktsträningsanläggning HALVAR i dagsljus och mörker på skjutbana och i avlyst terräng vid utbildning av poster och skyddsvakter. Utbildningen fokuserar på praktisk tillämpning med inslag av teori och säkerhetsbestämmelser.",
      "targetAudience": "Avsedd för dig som skall bli HALVAR-instruktör (skjutledare) i skyddsvaktsträningsanläggningen.",
      "syllabus": "Praktisk utbildning i upprättande och drift av skyddsvaktsträningsanläggning HALVAR, skjutledarrollen, figurantchefens uppgifter, säkerhetsbestämmelser enligt HVSS, samt genomförande av utbildning i post- och skyddsvaktstjänst.",
      "purpose": "Att kursdeltagaren efter genomförd kurs ska kunna agera som figurantchef och/eller skjutledare vid utbildning av poster och skyddsvakter i skyddsvaktsträningsanläggning HALVAR enligt gällande bestämmelser.",
      "primaryLearningObjective": "Efter kursen kunna agera som figurantchef och skjutledare vid utbildning i skyddsvaktsträningsanläggning HALVAR.",
      "secondaryLearningObjectives": [
        "Förbereda, genomföra och utvärdera utbildning i post- och skyddsvaktstjänst med stöd av gällande lagar, förordningar och manualer.",
        "Tillämpa säkerhetsbestämmelser och lokala bestämmelser på skjutbana och avlyst terräng.",
        "Kunna agera som figurantchef enligt fastställda scenarion och utbildningsmetodik.",
        "Biträda vid upprättande och brytande av skyddsvaktsträningsanläggning HALVAR."
      ],
      "examination": "Praktiska lärande examinationer i form av upprättande och drift av skyddsvaktsträningsanläggning samt agerande som figurantchef och skjutledare i olika scenarion. Teoretiskt prov i HVSS bestämmelser för HALVAR. Fortlöpande muntlig feedback under kursen. Max 2 examinationstillfällen.",
      "prerequisites": [
        "Skjutinstruktör AK4B/C.",
        "Skyddsvakt och skyddsvaktsinstruktör.",
        "Giltigt kompetensprov för vapen."
      ],
      "literature": [
        "Säkerhetsbestämmelser (SÄKR).",
        "HVSS bestämmelser för HALVAR 2013-03-23, 19170:50054.",
        "HVSS scenarion för HALVAR 2012-03-05, 19170:50028.",
        "Manual för aktuellt eldhandvapen."
      ],
      "additionalInfo": "Efter godkänd kurs förordnas eleven av HVSS som HALVAR-instruktör i fem år.",
      "typicalDuration": "5 dagar om totalt 45 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132139"
    },
    {
      "id": "anställda-vid-utbildningsgrupp",
      "name": "Anställda vid utbildningsgrupp",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2011301",
      "description": "Kursen omfattar hemvärnets utbildningsorganisation, administrativa bestämmelser, försäkringar, handbok hemvärnet (hvh) och medinflytande. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten och ett applikatoriskt exempel.",
      "targetAudience": "Avsedd för anställd personal på utbildningsgrupp eller vid hemvärnets stridsskola. Rekommenderas att ha tjänstgjort minst sex månader vid utbildningsgrupp eller vid hemvärnets stridsskola.",
      "syllabus": "Hemvärnets utbildningsorganisation, administrativa bestämmelser, försäkringar, handbok hemvärnet (hvh), medinflytande, applikatoriskt exempel.",
      "purpose": "Efter genomförd kurs kunna förklara och använda gällande bestämmelser vid arbete med hemvärns- och frivilligorganisationer.",
      "primaryLearningObjective": "Kunna använda och tillämpa gällande bestämmelser för hemvärnet och frivilligorganisationer i sitt dagliga arbete på en utbildningsgrupp eller hemvärnets stridsskola.",
      "secondaryLearningObjectives": [
        "Använda handböcker och övriga handlingar som styr verksamheten i hemvärnet och frivilligorganisationer.",
        "Beskriva hemvärnets och frivilligorganisationers verksamhet samt deras förankring i samhället."
      ],
      "examination": "Eleven prövas under det lärande applikatoriska exemplet, i form av uppslagsfrågor kopplat till handbok hemvärnet och handbok frivilligorganisation kapitel 7.",
      "prerequisites": [
        "Tjänstgjort minst sex månader vid utbildningsgrupp eller vid hemvärnets stridsskola."
      ],
      "literature": [
        "Handbok hemvärnet (hvh)",
        "Handbok frivilligorganisation kapitel 7",
        "KFS"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning. I kursanmälan ska befattning på utbildningsgrupp respektive stab samt anställningstid framgå. Denna kurs bör kompletteras med en lokalt anordnad introduktionskurs.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132153"
    },
    {
      "id": "anställda-vid-mr-grupp",
      "name": "Anställda vid MR-grupp",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2011301",
      "description": "Kursen omfattar hemvärnets utbildningsorganisation, administrativa bestämmelser, försäkringar, handbok hemvärnet (hvh) och medinflytande. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten och ett applikatoriskt exempel.",
      "targetAudience": "Anställd personal på militärregiongrupp (MR-grupp) eller vid Hemvärnets stridsskola (HvSS).",
      "syllabus": "Hemvärnets utbildningsorganisation, administrativa bestämmelser, försäkringar, handbok hemvärnet (hvh), medinflytande, applikatoriskt exempel.",
      "purpose": "Efter genomförd kurs kunna förklara och använda gällande bestämmelser vid arbete med hemvärns- och frivilligorganisationer.",
      "primaryLearningObjective": "Kunna använda och tillämpa gällande bestämmelser för hemvärnet och frivilligorganisationer i sitt dagliga arbete på en MR-grupp eller HvSS.",
      "secondaryLearningObjectives": [
        "Använda handböcker och övriga handlingar som styr verksamheten i hemvärnet och frivilligorganisationer.",
        "Beskriva hemvärnets och frivilligorganisationers verksamhet samt deras förankring i samhället."
      ],
      "examination": "Eleven prövas under det lärande applikatoriska exemplet, i form av uppslagsfrågor kopplat till handbok hemvärnet (hvh) och handbok frivilligorganisation kapitel 7.",
      "prerequisites": [
        "Bör ha tjänstgjort minst sex månader vid MR-grupp eller vid HvSS."
      ],
      "literature": [
        "Handbok hemvärnet (hvh)",
        "Handbok frivilligorganisation kapitel 7",
        "KFS"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning. I kursanmälan skall befattning på MR-grupp respektive stab samt anställningstid framgå. Denna kurs bör kompletteras med en lokalt anordnad introduktionskurs.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132206"
    },
    {
      "id": "fredsadministrativkurs",
      "name": "Fredsadministrativkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK119FU01",
      "description": "Kursen ger förståelse och kunskap om chefens administrativa ansvar i fredstid, inklusive arbetsmiljö, medinflytande, säkerhetstjänst och personalhantering.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som bataljonschef, stf bataljonschef, stabschef, chef eller stf chef hvkompani/hvundkompani/båtkompani och kvartermästare.",
      "syllabus": "Administrativa delar av chefsrollen i fredstid, Försvarsmaktens värdegrund, arbetsmiljöansvar, medinflytande och stämmor, säkerhetstjänst i fred, verksamhetssäkerhet vid övningar och skarpa uppgifter, avtalstider, personalutvecklingsplan, uppsägning och avveckling, förmåner och försäkringar, utbildning, kurser och befordran.",
      "purpose": "Att deltagaren ska förstå och kunna hantera de administrativa delar som en chef ansvarar för i fredstid.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha förståelse för chefens administrativa ansvar och tillgängliga stöd i fredstid.",
      "secondaryLearningObjectives": [
        "Förstå Försvarsmaktens värdegrund och dess innebörd.",
        "Förstå chefens ansvar, bland annat avseende arbetsmiljö.",
        "Förstå medinflytande och hur en stämma genomförs.",
        "Förstå säkerhetstjänst i fred och verksamhetssäkerhet vid övningar och skarpa uppgifter.",
        "Ha kunskap om avtalstider, personalutvecklingsplan, uppsägning av avtal och avveckling av personal.",
        "Ha orientering om förmåner och försäkringar inom hemvärnet.",
        "Ha orientering och förståelse för utbildning, kurser, befordran och krav inom hemvärnet."
      ],
      "examination": "Genom diskussioner samt muntliga och skriftliga redovisningar.",
      "prerequisites": [
        "Placering eller planerad placering i relevant befattning inom ett år."
      ],
      "literature": [
        "Handbok hemvärn (hvh)"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 33 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132213"
    },
    {
      "id": "fordon-förare-pb8",
      "name": "Fordon Förare PB8",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK5111102",
      "description": "Kursen är en kombination av teori och praktik och omfattar säkerhetsbestämmelser, civila och militära trafikbestämmelser, militär riskhantering, fordonets uppbyggnad samt körteknik på barmark, i mörker och dager. Utbildningen inkluderar även materielvård enligt FM bestämmelser, bogsering samt transport av farligt gods (1000 poäng).",
      "targetAudience": "Hemvärnssoldater som skall placeras som förare PB8/PB5.",
      "syllabus": "Säkerhetsbestämmelser, trafikregler, militär riskhantering, fordonets konstruktion, körteknik i olika förhållanden, materielvård, bogsering, transport av farligt gods.",
      "purpose": "Att kursdeltagaren efter genomförd utbildning ska kunna bruka och vårda PB8 samt tillämpa civila lagar och militära regler som påverkar fordonstjänsten.",
      "primaryLearningObjective": "Efter kursen kunna framföra FM-standardfordon (personbil, minibuss) samt inneha förarbevis för PB8.",
      "secondaryLearningObjectives": [
        "Använda civila lagar och militära föreskrifter som påverkar fordonstjänsten.",
        "Tillämpa undantag och särbestämmelser för FM-förare.",
        "Beskriva fordonets system och utrustning.",
        "Köra fordonet trafiksäkert på väg och genomföra halkkörning.",
        "Framföra fordonet i dager och mörker samt med släpkärra.",
        "Utföra åtgärder före, under och efter körning samt vårda fordon och utrustning."
      ],
      "examination": "Teoretiska prov på lärandemålen samt praktisk körning bedömd genom uppkörning. Praktiskt slutprov på materielkunskap och vård enligt bestämmelser.",
      "prerequisites": [
        "Genomförd grundutbildning (GU).",
        "Körkort klass B."
      ],
      "literature": [
        "Instruktionsbok PB8 (Sprinter 5t)",
        "FM Trafikteori",
        "Säkr Trafik",
        "Soldr Motor Körning och Vård",
        "Handbok Fordonstjänst 2017"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets Stridsskola (HVSS).",
      "typicalDuration": "10 dagar om totalt 100 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132220"
    },
    {
      "id": "halvar-figurantkurs",
      "name": "HALVAR Figurantkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ2011560",
      "description": "Kursen omfattar figurantutbildning i flera fastställda scenarion för träning av soldater i post- och/eller skyddsvaktstjänst i skyddsvaktsträningsanläggning HALVAR. Utbildningen är huvudsakligen praktisk och bedrivs på övningsplats under cirka 20 timmar.",
      "targetAudience": "Avsedd för dig som skall tjänstgöra som figurant vid övning i skyddsvaktsträningsanläggning HALVAR.",
      "syllabus": "Praktisk träning i olika scenarion enligt fastställd plan med fokus på inlevelse, förståelse och anpassningsförmåga. Scenarion genomförs med stöd av materiel i skyddsvaktsträningsanläggningen.",
      "purpose": "Att deltagaren skall kunna agera enligt fastställda scenarion för att ge poster och skyddsvakter realistisk träning.",
      "primaryLearningObjective": "Efter kursen kunna självständigt agera i olika roller och situationer för att skapa en realistisk miljö för den övade posten/skyddsvakten.",
      "secondaryLearningObjectives": [
        "Kunna relatera och förutse en skyddsvakts befogenheter och agerande utifrån figurantens agerande.",
        "Förstå och förklara utbildningsmetodiken samt rutiner för debriefing vid träning/övning i skyddsvaktsträningsanläggning HALVAR.",
        "Kunna biträda vid upprättande och brytande av skyddsvaktsträningsanläggning HALVAR."
      ],
      "examination": "Praktisk examination genomförs i flera scenarion enligt fastställd plan där elevens inlevelse, förståelse och anpassningsförmåga bedöms.",
      "prerequisites": [
        "Skyddsvaktsutbildad."
      ],
      "literature": [
        "HVSS scenarion för HALVAR 2012-03-05, 19170:50028",
        "HVSS bestämmelser för HALVAR 2013-03-23, 19170:50054"
      ],
      "additionalInfo": "Efter godkänd kurs förordnas eleven som figurant i skyddsvaktsträningsanläggning HALVAR i fem år. Kursen genomförs inte vid HVSS.",
      "typicalDuration": "3 dagar om totalt 25 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132239"
    },
    {
      "id": "hemvärns-personnel-recovery-officerskurs-(hv-pr-o)",
      "name": "Hemvärns Personnel Recovery Officerskurs (Hv PR-O)",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAÖGK043P007",
      "description": "Kursen syftar till att utbilda personal för tjänstgöring som stabsmedlem i personnel recovery (PR) befattning vid hemvärnsstab, med förmåga att stödja undsättning och återförande av isolerad personal (ISOP) på bataljonsnivå eller vid skvadron/kompani.",
      "targetAudience": "Avsedd för personal med grad OR-6 eller högre, som ska tjänstgöra som PR-officer i hemvärnet.",
      "syllabus": "Planering och integrering av PR i operationsplanering, förståelse för operation order (OPORD), PR standard operating procedure (SOP) och special instructions (SPINS). Genomförande av PR-operationer inklusive rapportering, lokalisering, understöd, undsättning och reintegration. Praktiska moment med spel och applikatoriska övningar samt orienterande utbildning i PR debriefing.",
      "purpose": "Att deltagaren efter kursen ska kunna verka som PR-officer i PR-systemets genomförande- och uppföljningsfas för att stödja chef vid undsättning och återförande av isolerad personal.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna tjänstgöra som PR-officer på taktisk nivå och i bataljonsstab inom hemvärnet.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa operation order och PR SOP/SPINS i planering och genomförande av PR-operationer.",
        "Kunna rapportera, lokalisera och understödja PR-operationer med kommunikation och underrättelsetjänst.",
        "Kunna stödja chef i lösandet av PR-operationer och genomföra reintegration och debriefing av isolerad personal.",
        "Behärska PR-funktioner och ansvar på bataljonsnivå och i PR coordination cell (PRCC)."
      ],
      "examination": "Fortlöpande examination genom skriftliga prov och grupparbeten under kursens gång. Betyg ges enligt tvågradig skala (Godkänd/G eller Icke godkänd/IG).",
      "prerequisites": [
        "Grad OR-6 eller högre.",
        "Godkänd FM fysisk grund- och tilläggskrav.",
        "Genomförd grundläggande överlevnadsutbildning (SERE A eller motsvarande).",
        "Genomförd digital förberedande kurs SERE Personnel Recovery Controller/Planner."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "5 dagar, totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132259"
    },
    {
      "id": "informatörwebredaktör-bataljon",
      "name": "Informatör/webredaktör bataljon",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2019501",
      "description": "Kursen riktar sig till blivande eller nuvarande webredaktörer och informationsbefäl i bataljonsstab. Utbildningen ger kunskap och verktyg för att självständigt kunna arbeta och publicera på sociala plattformar, med fokus på försvarsmaktens informationstjänst.",
      "targetAudience": "Blivande eller nuvarande webredaktörer och informationsbefäl i bataljonsstab.",
      "syllabus": "Grundläggande principer för försvarsmaktens informationstjänst, sociala medier, bildteknik och fotografering, skrivregler, nyhetsvärdering, lagar och pressetik, samt praktisk publicering på hemvarnet.se.",
      "purpose": "Att deltagaren skall kunna verka som informatör/webredaktör och självständigt publicera information på hemvarnet.se.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna arbeta och publicera självständigt på sociala plattformar inom hemvärnet.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa grunder i fotografering och bildteknik.",
        "Definiera skrivregler och kommunikativa plattformar.",
        "Förstå lagar, press- och informationsetik samt försvarsmaktens interna bestämmelser.",
        "Beskriva hur försvarsmakten arbetar med intern och extern information.",
        "Kunna producera och publicera artiklar och personporträtt på hemvarnet.se."
      ],
      "examination": "Vid kursstart redovisas utskickad hemuppgift. Under kursen genomförs självständigt arbete med artikel eller personporträtt samt gruppuppgift med fotouppgift. Eleven prövas i att självständigt kunna publicera på hemvarnet.se. Max 1 genomförande under kursen.",
      "prerequisites": [],
      "literature": [
        "Försvarsmaktens handbok i sociala medier",
        "Försvarsmaktens riktlinjer för sociala medier",
        "Försvarsmaktens riktlinjer för intern och extern kommunikation",
        "Språkliga riktlinjer för försvarsmakten",
        "Skrivregler för försvarsmakten"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132321"
    },
    {
      "id": "is-hv-super-user",
      "name": "IS Hv Super User",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen är en fördjupad utbildning med fokus på driftsättning och systemdrift av informationssystemet IS Hv. Utbildningen genomförs med praktiska övningar och teoretiska föreläsningar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som driftstödstekniker eller driftansvarig tekniker inom IS Hv.",
      "syllabus": "Driftsättning, systemdrift, felsökning och reparation av IS Hv-systemet. Utbildning i användning av instruktions- och reparationshandböcker samt metodhandbok IS Hv.",
      "purpose": "Att deltagaren ska kunna driftsätta, drifta och vid behov reparera IS Hv-systemet samt utbilda instruktörer och tekniker för att säkerställa redundans i bataljonen.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna säkerställa att IS Hv-systemet är uppdaterat och fungerande under övningar och insatser samt kunna utbilda IS Hv-instruktörer och tekniker.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa förändringar i driftinställningar med stöd av instruktionsböcker.",
        "Övervaka driftstatus och återställa system vid fel.",
        "Organisera programvara och hantering av IT-säkerhet.",
        "Utbilda IS Hv-instruktörer och tekniker utan handledning."
      ],
      "examination": "Kursen avslutas med ett teoretiskt prov. Max 1 examinationstillfälle under kursen.",
      "prerequisites": [
        "Teknikerutbildning IS Hv.",
        "Väl förtrogen med IS Hv."
      ],
      "literature": [
        "Metodhandbok IS Hv 2",
        "Instruktionsbok IS Hv",
        "Reparationshandbok IS Hv"
      ],
      "additionalInfo": "Kursen genomförs av Frivilliga Radioorganisationen.",
      "typicalDuration": "1 dag, totalt 8 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132347"
    },
    {
      "id": "is-hv-teknikerkurs",
      "name": "IS Hv Teknikerkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen fördjupar deltagarnas tekniska kunskaper genom praktiska övningar och teoretiska föreläsningar. Den riktar sig till personal placerade på ledningspluton såsom sb/data tekniker, sign/driftledbiträdare.",
      "targetAudience": "Personal placerade på ledningspluton såsom sb/data tekniker, sign/driftledbiträdare.",
      "syllabus": "Teknisk fördjupning med praktiska övningar och exempel, teoretiska föreläsningar, drift av IS Hv system inklusive start, stopp, övervakning, återställning och hantering av arkivdisk och skrivare. Stöd till användare och utbildning av instruktörer och tekniker.",
      "purpose": "Möjliggöra drift av IS Hv enligt säkerhetskrav med god tillgänglighet över tiden i aktuell miljö, samt att deltagarna ska kunna agera som driftstödstekniker eller driftansvarig tekniker.",
      "primaryLearningObjective": "Efter kursen ska deltagarna kunna agera i rollen som driftstödstekniker eller driftansvarig tekniker för IS Hv.",
      "secondaryLearningObjectives": [
        "Förstå IS Hv med tyngdpunkt på Sitaware.",
        "Identifiera behov av och genomföra förändringar i driftinställningar.",
        "Övervaka driftstatus och reagera på felindikationer.",
        "Starta och stoppa enheter samt hantera arkivdisk och skrivare inklusive uppdatering.",
        "Återställa klientdatorer och stödja användare i tekniska frågor.",
        "Ominstallera server och konfigurera switchar (för driftansvarig tekniker).",
        "Leda och stödja verksamheten för driftstödstekniker."
      ],
      "examination": "Krav för godkänt är aktivt deltagande under utbildningen samt godkänt resultat på avslutande prov.",
      "prerequisites": [
        "FM AP H/R",
        "TSS Signalskydd Teori 1 (tidigare Sysop T)"
      ],
      "literature": [
        "Instruktionsbok IS Hv",
        "Reparationshandbok IS Hv"
      ],
      "additionalInfo": "Frivilliga radioorganisationen har uppdraget som frivilligorganisation.",
      "typicalDuration": "3 dagar om totalt 20 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132425"
    },
    {
      "id": "krigsförbandsplaneringskurs",
      "name": "Krigsförbandsplaneringskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ2011515",
      "description": "Kursen omfattar taktik och stridsteknik, krigsförbandsvärdering (KFV), mobiliserings-, förbandsutvecklings- (FUP), personalutvecklings- (PUP) och krigsförbandsplanering (KFÖ) samt motståndarutbildning och ledarskapsutbildning. Undervisningen sker genom lärarledda lektioner, grupparbeten, enskilda redovisningar och spel på stridsplaner i terrängen.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som hemvärnsbataljonchef/stf, stabschef, sektionschef i bataljonsstab, kompanichef/stf (hvund, båt och bevakning). Öppen i mån av plats för kvartermästare på kompani samt plutonchef/stf.",
      "syllabus": "Taktik och stridsteknik, krigsförbandsvärdering, mobiliseringsplanering, förbandsutveckling, personalutveckling, krigsförbandsplanering, motståndarutbildning och ledarskap.",
      "purpose": "Att ge deltagaren grundläggande förmåga att agera och leda som chef vid eget förband (pluton, kompani, sektion, bataljon) samt förståelse för hemvärnets KFÖ-system och mobilisering.",
      "primaryLearningObjective": "Efter kursen ska deltagaren ha förståelse för hur hemvärnets KFÖ-system och mobilisering påverkar och utvecklar eget förband.",
      "secondaryLearningObjectives": [
        "Ge exempel på planering och genomförande av befattnings-KFÖ, förbands-KFÖ och kompletteringsutbildning inom hemvärnet.",
        "Förklara och exemplifiera hur bataljon och kompani förbereder och genomför mobilisering inom hemvärnet.",
        "Utveckla förmågan att använda eget kompani/pluton vid tagande av objekt.",
        "Förstå betydelsen av förbandsutvecklingsplanering och personalutvecklingsplanering.",
        "Förklara hur KFS, beredskapsgrader och typinsatser hänger ihop längs konfliktskalan."
      ],
      "examination": "Praktiskt lärande examinationer där elevens förmåga att lösa tilldelade uppgifter värderas och examineras fortlöpande under kursen med tyngdpunkt på applikatoriska exempel inom KFÖ och mobiliseringsplanering.",
      "prerequisites": [
        "Lägst genomförd plutonchefskurs 1."
      ],
      "literature": [
        "KFS",
        "Handbok HV-kompani/pluton del 1-3",
        "Reglemente Mobilisering 2018"
      ],
      "additionalInfo": "Kursen genomförs i Tylebäck i Försvarsutbildarnas regi.",
      "typicalDuration": "6 dagar om totalt 48 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132439"
    },
    {
      "id": "kvartermästarkurs-1",
      "name": "Kvartermästarkurs 1",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2019222",
      "description": "Grundläggande kvartermästarutbildning med fokus på logistik på kompani- och bataljonsnivå. Kursen inkluderar framtagande av punkten 4 i stridsplan samt genomförande av ett komplett bedömande fram till färdig stridsplan för ökad förståelse av logistiska processer. Undervisningen sker genom lärarledda lektioner, grupparbeten, redovisningar och studiebesök hos civila och militära logistiska aktörer.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som bataljonskvartermästare, teknisk chef, underhållsbefäl bataljon/kompani, sjukvårdsbefäl, bataljonsläkare, kompanikvartermästare eller chef stab/tross. Öppen i mån av plats för hundbefäl och stabsbefäl kompani.",
      "syllabus": "Logistik på kompani- och bataljonsnivå, framtagande av punkten 4 uthållighet i stridsplan, taktiska nötter med fokus på logistik, studiebesök hos civila och militära logistiska aktörer.",
      "purpose": "Att ge deltagaren grundläggande kunskaper och förmåga att verka som kvartermästare på kompani- och bataljonsnivå med särskilt fokus på logistiken och uthållighet i stridsplanering.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla och leda logistiken på kompani- och bataljonsnivå samt utarbeta punkten 4 i en stridsplan.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara hur logistiken kan ledas och samordnas inom en hemvärnsbataljon och kompani.",
        "Använda bedömandemallen (PUT) för att ta fram en stridsplan utifrån högre chefs order.",
        "Förklara behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva hur hemvärnet aktiveras och vilka praktiska åtgärder som ska genomföras vid beredskapshöjningar.",
        "Förstå ledarskapets betydelse i rollen som kvartermästare."
      ],
      "examination": "Praktiskt lärande examinationer där deltagarens redovisning av punkten 4 i bataljons- eller kompaniorder, användande av fem-punktsorder enligt handbok samt agerande i rollen som kvartermästare utvärderas fortlöpande. Examination sker även genom taktiska nötter och spel på stridsplaner med fokus på logistiken. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "För kompanikvartermästare: genomförd plutonchefskurs 1.",
        "För övriga befattningar kan särskilda förkunskapskrav gälla enligt utbildningsgruppens bedömning."
      ],
      "literature": [
        "KFS",
        "Logistik vid insats",
        "Reglemente mobilisering 2018",
        "Sjuktransportledning",
        "MSR",
        "Handbok bataljon/kompani"
      ],
      "additionalInfo": null,
      "typicalDuration": "10 dagar om totalt 92 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132500"
    },
    {
      "id": "kvartermästarkurs-2",
      "name": "Kvartermästarkurs 2",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFK4109223",
      "description": "Fortsatt utbildning för kvartermästare med fokus på logistik på kompani- och bataljonsnivå. Kursen omfattar praktiska övningar, grupparbeten och taktiska nötter med inriktning mot logistik samt genomförande av bedömning fram till färdig stridsplan med särskild tonvikt på punkten 4 uthållighet.",
      "targetAudience": "Avsedd för kompanikvartermästare, c s4, teknisk chef, underhållsbefäl bataljon/kompani, sjukvårdsbefäl, bataljonsläkare, chef stab/tross och motsvarande befattningar.",
      "syllabus": "Logistikledning och samordning inom hemvärnsbataljon och kompani, tillämpning av bedömandemallen (PUT) för framtagande av stridsplan, samverkan mellan militära och civila aktörer, praktiska åtgärder vid hemvärnsberedskap och hemvärnslarm, ledarskapets betydelse i kvartermästarrollen.",
      "purpose": "Att öka kvartermästarens förmåga att leda och samordna logistiken på kompani- och bataljonsnivå samt utveckla förståelsen för logistiska processer i samband med stridsplanering och uthållighet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla och delge punkten 4 i en stridsplan samt leda och samordna logistiken på kompani- och bataljonsnivå.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara logistiska lednings- och samordningsprinciper inom hemvärnsbataljon och kompani.",
        "Använda bedömandemallen (PUT) för att ta fram en stridsplan utifrån högre chefs order.",
        "Förklara behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva praktiska åtgärder vid hemvärnsberedskap och hemvärnslarm.",
        "Förklara ledarskapets betydelse i rollen som kvartermästare."
      ],
      "examination": "Praktiska examinationer och taktiska nötter där deltagarens förmåga att redovisa och tillämpa punkten 4 i bataljons- och kompaniorder samt agera i rollen som kvartermästare utvärderas fortlöpande under kursen.",
      "prerequisites": [
        "Genomförd kvartermästarkurs 1 (gäller ej för c s4)."
      ],
      "literature": [
        "KFS",
        "Logistik vid insats",
        "Reglemente mobilisering 2018",
        "Sjuktransportledning",
        "MSR",
        "Handbok bataljon/kompani"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132520"
    },
    {
      "id": "marin-hemvärnstaktik",
      "name": "Marin hemvärnstaktik",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2061519",
      "description": "Utbildning som syftar till att öka förmågan att verka i befattning i förband med marina uppgifter. Kursen omfattar ledning, planering och genomförande av marina och kustnära uppgifter såsom båtburen skyddsvakt, ytövervakning, eskort till sjöss, sjötransportledning, ombasering samt flygföretag med hemvärnets flyggrupp.",
      "targetAudience": "Personal som är eller skall placeras i befattning i bataljonsledning, kompaniledning, plutonsledning (båtkompani/båtpluton) och stabsbefattningar i marina och kustnära hemvärnsförband. Urval sker enligt militärregionens prioritering.",
      "syllabus": "Ledar- och planeringsmetodik för marina uppgifter, sjösäkerhetsutbildning, crew resource management (CRM), praktiska övningar i stridsledningssignalering, rekognosering och applikatoriska exempel med spel på stridsplaner.",
      "purpose": "Att deltagaren skall kunna verka i sin befattning på respektive nivå och leda, planera samt genomföra marinspecifika uppgifter inom ramen för hemvärnets insatsförmåga.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna leda och planera marina och kustnära bataljons- och kompaniförband i hemvärnet.",
      "secondaryLearningObjectives": [
        "Leda, planera och genomföra båtburen skyddsvakt.",
        "Leda, planera och genomföra ytövervakning.",
        "Stödja och genomföra eskort till sjöss.",
        "Leda, planera och genomföra sjötransportledning och ombasering.",
        "Leda och planera för flygföretag med hemvärnets flyggrupp.",
        "Praktiskt kunna genomföra stridsledningssignalering med handledning.",
        "Förstå juridiska förutsättningar för marina uppgifter.",
        "Samverka och stödja andra marina förband och civila myndigheter."
      ],
      "examination": "Kursen examineras genom praktiska och teoretiska moment, inklusive grupparbeten, redovisningar och spel på stridsplaner. Max ett examinationstillfälle under kursen.",
      "prerequisites": [
        "Genomförd utbildning i crew resource management (CRM).",
        "Genomförd sjösäkerhetsutbildning.",
        "Behörighet i Rakel och RA180."
      ],
      "literature": "Kurslitteratur erhålls vid kursstart.",
      "additionalInfo": "Kursen genomförs på AMF 1 i Södertörnsgruppens regi.",
      "typicalDuration": "7 dagar om totalt 64 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132540"
    },
    {
      "id": "nordisk-chefskurs",
      "name": "Nordisk chefskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ2019812",
      "description": "Kursen är ett samarbete mellan Sverige, Norge och Danmark inom ramen för Samskandia-avtalet. Den genomförs årligen i ett av länderna med tolv deltagare från respektive land. Utbildningen är ledarskapsinriktad och behandlar olika ledarskapssituationer samt inkluderar ett applikatoriskt exempel på kompaninivå. Undervisningen sker genom lärarledda lektioner, grupparbeten, framtagande av stridsplaner, ordergivningar och spel på stridsplaner. Deltagarna delas in i grupper med två elever från varje land.",
      "targetAudience": "Avsedd för chefer från bataljonchef till plutonchef/stf med god kunskap om nationell hemvärnsorganisation.",
      "syllabus": "Ledarskapssituationer, applikatoriskt exempel på kompaninivå, grupparbeten, framtagande av stridsplaner och ordergivning, spel på stridsplaner.",
      "purpose": "Att öka kunskap och förståelse för eget och övriga länders taktik och stridsteknik inom skydd och bevakning av hamn/flygplats samt att skapa nätverk mellan nationerna.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna hantera olika ledarskapssituationer i bataljon, kompani, sektion eller pluton i fred, kris och krigssituationer.",
      "secondaryLearningObjectives": [
        "Genomföra bedömning och framtagande av stridsplan enligt respektive lands bedömandemodell.",
        "Beskriva och förklara olika ledarstilar, förändringsarbete och konflikthantering.",
        "Beskriva respektive lands hemvärn och hur olika stridsuppgifter löses i en nordisk miljö."
      ],
      "examination": "Uppföljning av redovisade gruppuppgifter samt utbildande examination och spel på stridsplaner. Ett examinationstillfälle under kursen.",
      "prerequisites": [
        "God kunskap om nationell hemvärnsorganisation."
      ],
      "literature": [
        "Tilldelas av respektive land."
      ],
      "additionalInfo": "Kursen genomförs vart tredje år i respektive land med nytt upplägg vart femte år, senast 2019 i Sverige.",
      "typicalDuration": "5 dagar om totalt 50 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132600"
    },
    {
      "id": "scanbal",
      "name": "Scanbal",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ7120001",
      "description": "Scanbal är en internationell kurs i samarbete mellan Sverige, Norge, Danmark, Estland, Lettland och Litauen. Kursen riktar sig till kompani- och plutonchefer och fokuserar på taktik och stridsteknik inom skydd och bevakning av hamn och objekt i urban miljö. Utbildningen omfattar lärarledda lektioner, grupparbeten, rekognosering i terräng, framtagande av stridsplaner, ordergivning samt spel på stridsplaner i terrängen.",
      "targetAudience": "Rutinerade kompani- och plutonchefer från deltagande länder.",
      "syllabus": "Taktik och stridsteknik för skydd och bevakning av hamn och objekt i urban miljö, samverkan och nätverksbyggande över nationsgränser, framtagande av stridsplaner, ordergivning, rekognosering och spel på stridsplaner.",
      "purpose": "Att öka kunskap och förståelse för eget och övriga länders taktik och stridsteknik inom skydd och bevakning samt att skapa nätverk mellan deltagande nationer.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna utveckla och leda stridsplanering och ledning av kompani/pluton vid skydd och bevakning av hamn/objekt i urban miljö.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen enligt eget lands modell för att ta fram stridsplaner utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva hur plutoner leds och samordnas inom kompaniets strid.",
        "Förstå organisation och verksamhet hos sabotageförband.",
        "Ha insyn i respektive lands hemvärn och stridstekniska lösningar."
      ],
      "examination": "Bedömning sker genom aktivt deltagande, redovisning av gruppuppgifter och utbildande examination under kursen. Max ett examinationstillfälle.",
      "prerequisites": [
        "Rutinerad kompani- eller plutonchef.",
        "Engelska enligt STANAG 6001 nivå 2-2-2-2."
      ],
      "literature": "Tilldelas av respektive lands utbildningsorganisation.",
      "additionalInfo": "Kursen genomförs årligen i ett av deltagande länder. En kompanichef och tre plutonchefer från varje land deltar.",
      "typicalDuration": "5 dagar, totalt 50 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132622"
    },
    {
      "id": "stabschefskurs",
      "name": "Stabschefskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK119FU03",
      "description": "Kursen är en kurs i stabsarbetsmetodik för stabschefer, med fokus på organisation, indelning och uppgifter samt hur en stab verkar över tid med särskilt fokus på stabschefens roll. Utbildningen genomförs med lärarledda lektioner, grupparbeten och en avslutande stabsövning.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som stabschef i bataljonsstab. Kursen är även öppen för c s3/5 (tillika stf stabschef).",
      "syllabus": "Organisation, indelning och uppgifter i bataljonsstab. Stabschefens roll och ansvar. Stabsprocesser och ledningsmetod (PUT) inklusive planering, genomförande och uppföljning. Informationssystem IS HV och sambandstjänst. Utveckling av indirekt ledarskap.",
      "purpose": "Att ge deltagaren grundläggande förmåga att leda bataljonsstab och stödja bataljonchefen med information, konsekvensanalyser och beslutsunderlag.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som stabschef och leda bataljonsstabens arbete över tid.",
      "secondaryLearningObjectives": [
        "Förklara och tillämpa stabsprocesser och ledningsmetod (PUT).",
        "Beskriva organisation och funktioner inom bataljonsstab.",
        "Använda informationssystem IS HV vid planering, genomförande och uppföljning.",
        "Utveckla det indirekta ledarskapet.",
        "Identifiera stabschefens ansvar och konsekvenser av beslut ur ett etiskt och moraliskt perspektiv."
      ],
      "examination": "Praktiskt lärande examinationer där elevens agerande i rollen som stabschef utvärderas fortlöpande under kursen genom metodik- och ledarskapsmoment. Aktivt deltagande krävs för godkänt betyg.",
      "prerequisites": [
        "Genomförd bataljonsstridskurs (BS).",
        "Genomförd grundkurs stabstjänst (GKS).",
        "Färdighet i att hantera och verka i programmet Sitaware HQ (IS HV)."
      ],
      "literature": [
        "Metodhandbok ledning bataljon 2007",
        "AH Ledning 2016",
        "Handbok stabstjänst grunder 2016",
        "Handbok hemvärns-bataljon, kompani",
        "Handbok motståndaren 2016",
        "Arméreglemente taktik 2013",
        "Handbok IKFN"
      ],
      "additionalInfo": "Indirekt ledarskap (IL) och Utvecklande ledarskap (UL) är meriterande förkunskaper. Kursen kan till del genomföras som distansutbildning.",
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132642"
    },
    {
      "id": "grundkurs-stabstjänst",
      "name": "Grundkurs Stabstjänst",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Grundläggande kurs i stabsarbetsmetodik för stabsmedlemmar med fokus på organisation, indelning och uppgifter i bataljonsstab samt stabsmedlemmens roll. Kursen omfattar lektioner, grupparbeten och en avslutande stabsövning.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som kompanichef, bataljonchef, stabsmedlem eller chef/stf ledningspluton.",
      "syllabus": "Organisation och uppgifter i bataljonsstab, stabsmedlemmens roll, stabsprocesser, planering under tidspress (PUT), informationshantering och användning av informationssystem IS HV (Sitaware HQ).",
      "purpose": "Att ge deltagaren grundläggande förståelse för hur bataljonsstab verkar över tid och för stabsmedlemmens roll i staben.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som stabsmedlem i bataljonsstab och förstå stabsprocesser samt informationshantering.",
      "secondaryLearningObjectives": [
        "Beskriva organisation, indelning och uppgifter inom bataljonsstab.",
        "Förklara stabsmedlemmens roll och ansvar i stabsarbetet.",
        "Tillämpa planeringsmetod (PUT) i stabsarbete.",
        "Använda informationssystem IS HV (Sitaware HQ) vid planering, genomförande och uppföljning.",
        "Förstå hur information sprids, klassificeras, fördelas och handläggs inom staben."
      ],
      "examination": "Praktiskt lärande där deltagaren verkar i sin befattning under en formell stabsövning i slutet av kursen. Godkänt deltagande krävs.",
      "prerequisites": [
        "Färdighet i att hantera programmet Sitaware HQ (IS HV)."
      ],
      "literature": [
        "Arméhandbok del 2",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärns-bataljon, kompani",
        "Handbok markstrid – kompani 2016",
        "Handbok motståndaren 2016",
        "Arméreglemente taktik 2013",
        "Handbok IKFN 2016"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132701"
    },
    {
      "id": "grundkurs-störa",
      "name": "Grundkurs Störa",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Utbildande prestationsövning i fält med fokus på delar av stridsuppgiften störa. Kursen innehåller fysiska och psykiska prövningar samt moment som eldöverfall, överfall, minor och upplagstjänst. Avslutas med en slutövning där deltagarna prövas i sina kunskaper och färdigheter.",
      "targetAudience": "Avsedd för grupp- och plutonchefer inom Hemvärnet. Även chefer på andra nivåer som vill öka sin förståelse eller testa sitt ledarskap kan söka.",
      "syllabus": "Stridsuppgiften störa med fokus på eldöverfall, överfall, spaning, alternativa sambands- och ledningssätt, upplagstjänst och link up-metoder. Praktiska och teoretiska moment i fält med successiv stegring av svårighetsgrad.",
      "purpose": "Öka Hemvärnets förmåga att lösa stridsuppgiften störa samt öka individens personliga färdighet och uthållighet i fält.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha kunskap om stridsuppgiften störa och kunna tillämpa denna i grupp och pluton samt känna till sitt eget ledarskap i påfrestande situationer.",
      "secondaryLearningObjectives": [
        "Planera, leda och genomföra eldöverfall och överfall i grupps ram i både dager och mörker.",
        "Planera, leda och genomföra spaning mot objekt och område.",
        "Känna till alternativa sambands- och ledningssätt.",
        "Utföra upplagstjänst och tillämpa link up-metoder."
      ],
      "examination": "Kontinuerlig bedömning av fysisk förmåga och prestationer vid varje delmål. Slutövning med godkänt resultat krävs för godkänd kurs. Max två omexaminationstillfällen. Kurschef kan avskilja deltagare som ej bedöms lämpliga.",
      "prerequisites": [
        "Värnplikt (VPL) och grundläggande militär utbildning (GMU).",
        "Genomförd grupp- eller plutonchefsutbildning.",
        "Genomförd brukarutbildning AK4.",
        "God fysisk status med hög uthållighet."
      ],
      "literature": [],
      "additionalInfo": "Deltagaren kan när som helst avbryta kursen på egen begäran.",
      "typicalDuration": "10 dagar om totalt 130 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132725"
    },
    {
      "id": "grundkurs-underrättelsetjänst-hv",
      "name": "Grundkurs Underrättelsetjänst Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Grundläggande teoretisk och praktisk utbildning i underrättelseprocessen. Kursen är uppdelad i självstudier och lärarledda moment med grupparbeten och applikatoriska övningar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i underrättelsebefattning inom underrättelsekompanistab, bataljonsstab, samt personal vid s3 och hundbefäl vid kompani. Kursen är även sökbar för bataljonschef, stf bataljonschef, stabschef och kompanichefer.",
      "syllabus": "Underrättelseprocessens teori och praktik, analys av terräng och motståndare, planering och ledning av inhämtning, produktion av underrättelseorder och rapporter, kategorisering och bearbetning av information, underrättelseföredragning.",
      "purpose": "Att öka förmågan att verka i nuvarande eller kommande stabsbefattning inom underrättelsetjänst.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna verka som stabsmedlem i underrättelsebefattning och producera underrättelseprodukter för beslutsfattande.",
      "secondaryLearningObjectives": [
        "Beskriva hur analys av terräng och motståndares organisation påverkar underrättelseprocessen.",
        "Utveckla underrättelsebehov och planera egen inhämtning.",
        "Utforma underrättelseorder och producera underrättelserapporter.",
        "Kategorisera information och genomföra underrättelseföredragning."
      ],
      "examination": "Underrättelseprodukter värderas fortlöpande under kursen genom skriftliga och praktiska moment.",
      "prerequisites": [
        "Minst GU-F."
      ],
      "literature": [
        "FM Undr 2010",
        "FM Undh Rapp 2015",
        "Nomen Und 2021",
        "Handbok Undsäktjänst vid hemvärnsförband 2017",
        "Markstridshandbok Motståndaren 2021",
        "Distribuerat lärande: Introduktion underrättelsetjänst (A110714-1, 1.0)"
      ],
      "additionalInfo": "Efter kursen rekommenderas praktisk tillämpning som stabsmedlem i S2-sektionen under stabstjänstövning, Kfö eller motsvarande.",
      "typicalDuration": "15 dagar, varav 4 dagar självstudier och 11 dagar lärarledd utbildning (144 timmar).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132743"
    },
    {
      "id": "vaktb-kurs",
      "name": "VaktB kurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK0440001",
      "description": "Kursen omfattar 8 timmar och består av teoretiska grunder samt praktiska tillämpningsövningar. Undervisningen varvar teori med praktik och sker både inomhus och utomhus.",
      "targetAudience": "Avsedd för dig som är placerad i x-befattning, eller inte uppfyller kraven för skyddsvakt enligt bestämmelser i FM 2020-8736:1.",
      "syllabus": "Vapnets användning, nödvärn med skjutprov, utbildning avseende lagstöd i envarsrätt, nödvärnsrätt och rätten att bistå vid tjänsteåtgärd ”hjälpares rätt”.",
      "purpose": "Att efter godkänd kurs kunna tjänstgöra som vaktpost.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna tillämpa gällande lagar och bestämmelser inom ramen för posttjänsten.",
      "secondaryLearningObjectives": [
        "Behärska vapnets användning och säker hantering.",
        "Förstå och tillämpa lagstöd för nödvärn och envarsrätt.",
        "Kunna genomföra praktiska moment med eget eldhandvapen."
      ],
      "examination": "Examination genomförs med teoretiskt prov och praktiskt prov med eget eldhandvapen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GMU, GU eller GU-F.",
        "Genomfört godkänt kompetensprov på eget eldhandvapen."
      ],
      "literature": [
        "Utbildningspaket skyddsvakt i tillämpliga delar",
        "Skrivelse 2020-8736:1",
        "Handbok bevakning 2017",
        "FM Undsäk skyddsvaktsutb",
        "HVSS utbildningsunderlag och prov VaktB (skrivelse 2020-8736:1)",
        "FFS 2010:06 VaktB",
        "FFS 2010:07 Skjutvapen vid vakttjänst inom FM",
        "MSS 19100:80202 Närkamp",
        "HVSS skrivelse 2020-8736:1"
      ],
      "additionalInfo": "Utbildad VaktB-soldat ska omförordnas minst vart femte år från och med 2022-01-01. Tidigare genomförd skyddsvaktsutbildning ger behörighet som vaktpost först efter omförordnande enligt VaktB.",
      "typicalDuration": "1 dag om 8 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132803"
    },
    {
      "id": "stridsledning-sensor-hund-hv",
      "name": "Stridsledning Sensor Hund Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Utbildning i planering och stridsledning av grupper med hundekipage samt samtliga tillgängliga sensorer med fokus på metodik, uppföljning och beslutsprocess ur perspektivet sensorbefäl och plutonchef.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som sensorbefäl, stridsbefäl, plutonchef eller kompanichef.",
      "syllabus": "Planering och stridsledning av hundekipage och tekniska sensorer, metodik för uppföljning, beslutsprocess, stöd till plutonsstab, upprättande av sensoroleat.",
      "purpose": "Att deltagaren skall ha förmåga att leda enheter med hund och tekniska sensorer under tidspress.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna stridsleda enheter med hund och tekniska sensorer samt förstå beslutsprocessen.",
      "secondaryLearningObjectives": [
        "Kunna planera och stödja chef med beslutsunderlag för enheter med hund och tekniska sensorer.",
        "Kunna betjäna plutonsstab vid uppgifter med sensorer.",
        "Kunna med handledning stridsleda pluton med hund under förföljning.",
        "Kunna upprätta sensoroleat."
      ],
      "examination": "Praktiskt lärande examinationer där elevens arbete vid stridsledning av enheter med sensorer utvärderas fortlöpande med tyngdpunkt på uppföljning och framförhållning. Bedömning sker mot godkänd/icke godkänd.",
      "prerequisites": [],
      "literature": [
        "Direktiv patrullhund hemvärn 2021",
        "Utbildningsanvisning stridsteknik sensorer"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 46 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132814"
    },
    {
      "id": "säkerhetstjänstkurs-hv",
      "name": "Säkerhetstjänstkurs Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande teoretisk och praktisk utbildning i säkerhetstjänst med fokus på ledning, lydnadsförhållanden, hotbild samt tillämpning av styrande regler, handböcker och reglementen. Praktiska moment inkluderar utarbetande och delgivning av säkerhetsanalys och säkerhetsplan.",
      "targetAudience": "Avsedd för dig som är placerad eller skall placeras i befattning som c s2, undbefäl samt i mån av plats för bataljonchef/stf, stabschef, kompanichef och plutonchefer specialplutoner inom Hemvärnet.",
      "syllabus": "Grundläggande faktakunskaper om ledning och lydnadsförhållanden, hotbild, styrande och stödjande regelverk, handböcker och reglementen. Praktisk tillämpning av säkerhetsanalys och säkerhetsplan. Föreläsningar, diskussioner, grupparbeten samt teoretiska och praktiska exempel.",
      "purpose": "Att deltagaren skall kunna stödja eget förbands verksamhet avseende säkerhetstjänst och planera samt genomföra enklare säkerhetsprodukter för beslutsfattning och säkerhetsmedvetenhet inom hemvärnsförband.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utarbeta säkerhetsanalyser och föreslå relevanta förebyggande åtgärder för säkerhetstjänst inom hemvärnet.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara säkerhetshot och krav på hemvärnsstab avseende dokumentation, analys, bearbetning och delgivning av säkerhetsprodukter.",
        "Ge exempel på styrande regelverk inom Försvarsmakten för säkerhetstjänst.",
        "Beskriva säkerhetstjänstarbetet inom eget förband och samverkan med högre chef, egen stab och underställda förband.",
        "Ge exempel på underrättelse- och säkerhetsbehov samt rapportering.",
        "Beskriva stående bataljonsorder avseende säkerhetstjänst."
      ],
      "examination": "Praktiskt lärande prov där eleven skall utarbeta en säkerhetsanalys och föreslå relevanta förebyggande åtgärder. Prov betygssätts med godkänd/icke godkänd. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Lägst GU-F.",
        "Genomförd kunskapskontroll omfattande handbok undsäktjänst vid hemvärnsförband 2017.",
        "Genomförd FM lärportal eller IT´s learning utbildning ”grunder säkerhetstjänst”."
      ],
      "literature": [
        "H Säk Grunder 2013 kap 2-4",
        "H Sekretess Bedömning Del A 2011",
        "H HV Säkprövning 2016 sid 52",
        "Samsäk 2017",
        "Säkbest IS HV 2017"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 26 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132827"
    },
    {
      "id": "hv-intro-automatkarbin-4",
      "name": "Hv-Intro Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA00",
      "description": "Kursen genomförs för att säkerställa att soldaten kan hantera sitt vapen på ett säkert sätt för att vidare kunna utvecklas mot basförmåga automatkarbin 4.",
      "targetAudience": "Personal som genomför utbildning hv-intro.",
      "syllabus": "Säkerhet, vapendelar och funktion, laddning och avfyrning i olika skjutställningar, vapenkontroll, åtgärder före, under och efter skjutning samt inskjutning.",
      "purpose": "Skapa förutsättningar för att påbörja brukarutbildning basförmåga automatkarbin 4.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna hantera systemet AK4 på ett säkert sätt för att påbörja basförmåga.",
      "secondaryLearningObjectives": [
        "Förklara och tillämpa säkerhetsbestämmelser vid vapenhantering.",
        "Identifiera och namnge vapendelar samt deras funktion.",
        "Utföra laddning och avfyrning i liggande, knästående och stående skjutställning.",
        "Genomföra vapenkontroll och åtgärder vid eldavbrott.",
        "Utföra inskjutning enligt fastställda moment."
      ],
      "examination": "Godkänt resultat på samtliga övningar och delmoment enligt kursplan. Obligatorisk närvaro krävs.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV."
      ],
      "literature": [
        "Manual automatkarbin 4b, senaste utgåva.",
        "Handbok skjututbildning automatkarbin, senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "12 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132841"
    },
    {
      "id": "basförmåga-8,4-cm-granatgevär",
      "name": "Basförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA01",
      "description": "Kursen genomförs för att ge soldaten basförmåga på 8,4 cm granatgevär så att soldaten efter avslutad kurs kan påbörja strids- och förbandsutbildning i befattning med tilldelat granatgevär.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Materielkunskap, säkerhetsbestämmelser, skjutställningar, servistjänst, skjutregler, fordonsigenkänning, mål-, fart- och avståndsbedömning, vapenkontroll och träffbildsskjutning.",
      "purpose": "Att soldaten ska kunna hantera 8,4 cm granatgevär på ett säkert sätt och avge eld mot mål på kända avstånd.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna påbörja förbands- och stridsutbildning i befattning som granatgevärsskytt.",
      "secondaryLearningObjectives": [
        "Kunna hantera vapnet säkert.",
        "Avge eld mot mål på kända avstånd.",
        "Utföra materielhantering och vapenvård enligt gällande bestämmelser."
      ],
      "examination": "Godkänd på prov ur skjutreglementet för granatgevär samt genomförda grund- och skjutövningar med godkänt resultat.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Basförmåga automatkarbin 4."
      ],
      "literature": [
        "Manual 8,4 cm granatgevär, 2016 års utgåva (m7739-353117).",
        "Skjutr grg, 2002 års utgåva (m7742-111062).",
        "Skjutr grg TLG, 2002 års utgåva (m7742-110071)."
      ],
      "additionalInfo": null,
      "typicalDuration": "41 timmar fördelat på 5 dagar (11 timmar teori, 30 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132853"
    },
    {
      "id": "basförmåga-automatkarbin-4",
      "name": "Basförmåga Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA02",
      "description": "Kursen genomförs för att ge soldaten basförmåga på automatkarbin 4 så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning med tilldelad automatkarbin 4.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Kursen omfattar teori och praktik med fokus på vapenhantering, skjutteknik och säkerhetsbestämmelser enligt gällande reglementen. Övningar inkluderar vapenvård, skjutställningar, träffbildsskjutning samt åtgärder vid eldavbrott och omladdning.",
      "purpose": "Att ge soldaten basförmåga på automatkarbin 4 för att kunna verka i befattning med vapnet och påbörja förbands- och stridsutbildning.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna hantera och använda automatkarbin 4 på ett säkert och effektivt sätt i stridssituationer.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa vapenhantering och säkerhetsbestämmelser enligt handbok och reglemente.",
        "Kunna utföra grundläggande skjutövningar och träffbildsskjutning i olika skjutställningar.",
        "Kunna genomföra vapenvård och åtgärda eldavbrott samt omladdningar.",
        "Kunna skjuta i varierande situationer, i dager och mörker, med stridsfältsbelysning.",
        "Utveckla färdighet att träffa mål på avstånd mellan 10 och 100 meter."
      ],
      "examination": "Godkänt resultat på skriftliga och praktiska prov enligt handbok skjututbildning automatkarbin och reglemente. Examination omfattar vapenhantering, säkerhetsbestämmelser, skjutövningar och praktisk skjutning. Max tre examinationstillfällen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV."
      ],
      "literature": [
        "Manual automatkarbin 4b, senaste utgåva.",
        "Handbok skjututbildning automatkarbin, senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "50 timmar fördelat på 5 dagar (10 timmar teori och 40 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132907"
    },
    {
      "id": "basförmåga-granattillsats-40mm",
      "name": "Basförmåga Granattillsats 40mm",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten basförmåga på granattillsats 40mm så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning med tilldelad granattillsats 40mm.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Grundövningar 1-8, skjutövningar 1, 3-4, stridsövningar 4 och 7.",
      "purpose": "Att ge soldaten basförmåga på granattillsats 40mm för att kunna verka i befattning med tilldelad granattillsats 40mm.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna hantera granattillsats 40mm på ett säkert sätt och kunna avge eld mot mål på kända avstånd.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för granattillsats med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för skjutbana.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar."
      ],
      "examination": "Godkänt resultat på grundövningar, skjutövningar och stridsövningar enligt kursplan. Examination sker fortlöpande under kursen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Genomförd och godkänd basförmåga automatkarbin 4 eller motsvarande."
      ],
      "literature": [
        "Skjutr grtillsats ak år 2000 (m7742-110401).",
        "Skjutr grtillsats ak tlg år 2000 (m7742-110411)."
      ],
      "additionalInfo": null,
      "typicalDuration": "28 timmar fördelat på 3 dagar",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132918"
    },
    {
      "id": "basförmåga-kulspruta-58",
      "name": "Basförmåga Kulspruta 58",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA04",
      "description": "Kursen genomförs för att ge soldaten basförmåga på kulspruta 58 så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning med tilldelad kulspruta 58.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Grundövningar i vapenhantering och säkerhetsbestämmelser, skjutställningar, riktregler och eldens utsträckning, skottställning, samt skjutövningar mot mål.",
      "purpose": "Att ge soldaten basförmåga att hantera kulspruta 58 säkert och effektivt i stridande befattning.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna påbörja förbands- och stridsutbildning i befattning med kulspruta m/58.",
      "secondaryLearningObjectives": [
        "Skapa förståelse för vapenhantering och skjutteknik.",
        "Öva upp färdighet att hantera vapnet på ett säkert och effektivt sätt.",
        "Kunna träffa mål med flera skott i olika situationer och skjutställningar.",
        "Kunna åtgärda eldavbrott och genomföra omladdning."
      ],
      "examination": "Godkänd på prov i materielkunskap, säkerhetsbestämmelser, skjutställningar, riktregler, skottställning och skjutövningar. Eleven genomgår praktiska och teoretiska prov enligt gällande skjutreglemente.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Genomförd och godkänd utbildning basförmåga automatkarbin 4 eller motsvarande utbildning enligt utbildningsgruppens bedömning."
      ],
      "literature": [
        "Manual kulspruta m/58 (m7739-370104), senaste utgåva.",
        "Skjutr A Pek 1, 1994 års utgåva (m7742-111002), senaste utgåva.",
        "Skjutr A Pek 2, 1994 års utgåva (m7742-111012), senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "30 timmar fördelat på 4 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132932"
    },
    {
      "id": "basförmåga-pansarskott-m86",
      "name": "Basförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten basförmåga på pansarskott m/86 så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning nyttjandes pansarskott m/86.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Materielkunskap och data, funktion rsv. Säkerhetsbestämmelser del a och b. Skjutregler. Grundövningar och skjutövningar enligt skjutr pskott 86.",
      "purpose": "Att ge soldaten basförmåga på pansarskott m/86 för att kunna verka i stridande befattning med vapnet.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna hantera pansarskott m/86 på ett säkert sätt och avge eld mot mål på kända avstånd.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa gällande skjutreglementen och säkerhetsbestämmelser.",
        "Genomföra grundläggande skjutövningar och stridsövningar med pansarskott m/86.",
        "Utveckla färdigheter för att verka i befattning med pansarskott m/86."
      ],
      "examination": "Godkänd på prov i materielkunskap, säkerhetsbestämmelser och skjutregler samt godkänt genomförande av grundövningar och skjutövningar enligt skjutr pskott m/86. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV eller GMU, GMU HV."
      ],
      "literature": [
        "Manual pansarskott m/86 (m7739-370101)",
        "Skjutbok skjutr pskott m/86 utg 1 2004-03-12",
        "Skjutr pek 1, 1994 års utgåva (m7742-111002)",
        "Skjutr pek 2, 1994 års utgåva (m7742-111012)"
      ],
      "additionalInfo": null,
      "typicalDuration": "26 timmar fördelat på 3 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-132943"
    },
    {
      "id": "pistolkurs-fortsättning",
      "name": "Pistolkurs fortsättning",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA10",
      "description": "Kursen omfattar repetition av handhavande, teori, grundläggande skjutövningar samt kompetensprov och en fältskjutning.",
      "targetAudience": "Avsedd för dig som är utrustad med pistol som tjänstevapen.",
      "syllabus": "Repetition av pistolens handhavande, säkerhet, skjutställningar, skjutövningar och kompetensprov.",
      "purpose": "Att deltagaren skall få ökat förtroende för sitt vapen och förbättra sin skjutförmåga.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha förbättrad förmåga att hantera och skjuta med pistol samt bli godkänd på kompetensprovet.",
      "secondaryLearningObjectives": [
        "Förstå uppbyggnad av skjutreglemente för pistol.",
        "Hantera vapnet på ett säkert sätt i mer avancerade övningar.",
        "Genomföra en fältskjutning enligt gällande bestämmelser."
      ],
      "examination": "Praktiska övningar och skjutövningar med avslutande kompetensprov. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GMU eller GU-F.",
        "Genomförd grundläggande pistolutbildning.",
        "Genomförd hemvärnsintroduktion."
      ],
      "literature": [
        "Manual pistol 88",
        "Skjutr pistol 2015",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "Utbildningen är avsedd för de med tjänstevapen pistol som känner sig osäkra i sitt handhavande.",
      "typicalDuration": "35 timmar fördelat på 4 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133003"
    },
    {
      "id": "spetsförmåga-8,4-cm-granatgevär",
      "name": "Spetsförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA21",
      "description": "Kursen genomförs för att ge soldaten spetsförmåga på 8,4 cm granatgevär så att soldaten efter avslutad kurs, med hög duglighet, kan verka stridande i befattning med tilldelat granatgevär.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Stridsövningar i dagsljus och med stridsfältsbelysning enligt gällande manual och skjutreglemente för granatgevär.",
      "purpose": "Att soldaten ska kunna verka i befattning som granatgevärsskytt och avge eld mot mål på kända och okända avstånd i olika ljusförhållanden.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna verka i befattning som granatgevärsskytt med hög duglighet.",
      "secondaryLearningObjectives": [
        "Kunna avge eld från stridsställning mot mål på kända och okända avstånd med 8,4 cm granatgevär i dager och mörker med stridsfältsbelysning.",
        "Behärska säker vapenhantering och tillämpa gällande skjutreglementen."
      ],
      "examination": "Godkänt resultat på stridsövningar enligt kursplan och skjutreglemente.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Godkänd kurs basförmåga 8,4 cm granatgevär eller motsvarande utbildning.",
        "Godkänd kurs tilläggsförmåga 8,4 cm granatgevär eller motsvarande utbildning."
      ],
      "literature": [
        "Manual 8,4 cm granatgevär, 2016 års utgåva (m7739-353117).",
        "Skjutreglemente granatgevär, 2002 års utgåva (m7742-111062).",
        "Skjutreglemente granatgevär tillägg, 2002 års utgåva (m7742-110071)."
      ],
      "additionalInfo": null,
      "typicalDuration": "22 timmar fördelat på 2 dagar (11h teori + 11h praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133028"
    },
    {
      "id": "spetsförmåga-pansarskott-m86",
      "name": "Spetsförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten spetsförmåga på pansarskott m/86 så att soldaten efter avslutad kurs kan verka i stridande befattning nyttjandes pansarskott m/86.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Stridsövning kapitel 4.4 samt kapitel 5 enligt gällande manualer och skjutreglementen för pansarskott m/86.",
      "purpose": "Att soldaten skall kunna nyttja pansarskott m/86 i stridande befattning.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka i stridande befattning med pansarskott m/86.",
      "secondaryLearningObjectives": [
        "Kunna avge eld mot mål på kända och okända avstånd från stridsställning i dagsljus och mörker med stridsfältsbelysning.",
        "Förstå och tillämpa säkerhetsbestämmelser och skjutregler för pansarskott m/86."
      ],
      "examination": "Godkänt resultat på stridsövningar enligt kursplan och skjutreglementen. Max 2-3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd och godkänd grundutbildning (gu, gu hv, gmu eller motsvarande).",
        "Godkänd kurs basförmåga pansarskott m/86.",
        "God fysisk status."
      ],
      "literature": [
        "Manual pansarskott m/86 (m7739-370101)",
        "Skjutbok skjutr pskott m/86 utgåva 1, 2004-03-12",
        "Skjutr pek 1, 1994 års utgåva (m7742-111002)",
        "Skjutr pek 2, 1994 års utgåva (m7742-111012)"
      ],
      "additionalInfo": null,
      "typicalDuration": "12 timmar under 1 dag.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133051"
    },
    {
      "id": "tilläggsförmåga-8,4-cm-granatgevär",
      "name": "Tilläggsförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA11",
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på 8,4 cm granatgevär så att soldaten efter avslutad kurs kan verka stridande i befattning med tilldelat granatgevär.",
      "targetAudience": "Hemvärnets personal placerad i bevakning/insatskompani.",
      "syllabus": "Skjutövningar 3, 5, 9-12 (13-14 om möjligt) samt stridsövningar 1 och 3.",
      "purpose": "Att soldaten ska kunna verka i befattning som granatgevärsskytt och från stridsställning under enklare förhållanden kunna avge eld mot upptäckta mål på kända och okända avstånd med 8,4 cm granatgevär.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna verka i befattning som granatgevärsskytt med tilldelat granatgevär.",
      "secondaryLearningObjectives": [
        "Kunna avge eld mot mål på kända och okända avstånd i dager och mörker med stridsfältsbelysning.",
        "Hantera vapnet på ett säkert sätt enligt gällande manualer och skjutreglementen."
      ],
      "examination": "Godkänt resultat på skjutövningar och stridsövningar enligt kursplan. Examination sker genom praktiska prov.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV eller GMU, GMU HV.",
        "Godkänd kurs: basförmåga 8,4 cm granatgevär eller motsvarande utbildning."
      ],
      "literature": [
        "Manual 8,4 cm granatgevär, 2016 års utgåva (m7739-353117).",
        "Skjutr GRG, 2002 års utgåva (m7742-111062).",
        "Skjutr GRG TLG, 2002 års utgåva (m7742-110071)."
      ],
      "additionalInfo": null,
      "typicalDuration": "24 timmar fördelat på 3 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133108"
    },
    {
      "id": "tilläggsförmåga-automatkarbin-4",
      "name": "Tilläggsförmåga Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på automatkarbin 4 så att soldaten efter avslutad kurs kan verka i stridande befattning med tilldelad automatkarbin 4.",
      "targetAudience": "Hemvärnets personal placerad i insats-, bevaknings- eller underrättelsekompani.",
      "syllabus": "Teoretiska och praktiska moment med fokus på avancerad skjutteknik, skjutställningar i dager och mörker, skjutning under förflyttning samt träff mot rörliga mål på avstånd upp till 300 meter.",
      "purpose": "Att ge soldaten förmåga att verka i stridande befattning med automatkarbin 4 och kunna träffa mål i varierande situationer och ljusförhållanden.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna verka i stridande befattning med automatkarbin 4 och träffa mål på avstånd upp till 300 meter i olika skjutställningar och under varierande förhållanden.",
      "secondaryLearningObjectives": [
        "Behärska skjutställningar i dager och mörker med burna sensorer.",
        "Utföra skjutning under förflyttning och träffa rörliga mål.",
        "Genomföra omladdningar och åtgärda eldavbrott effektivt.",
        "Tillämpa säker vapenhantering enligt gällande reglementen."
      ],
      "examination": "Med godkänt resultat genomfört samtliga delmoment och övningar enligt kursplan. Examination sker genom praktiska skjutprov och bedömning av skjutteknik och säkerhet.",
      "prerequisites": [
        "Genomförd och godkänd grundutbildning GU, GMU eller motsvarande.",
        "God fysisk status.",
        "Tidigare godkänd basförmåga automatkarbin 4 eller motsvarande."
      ],
      "literature": [
        "Manual automatkarbin 4b, senaste utgåva.",
        "Handbok skjututbildning automatkarbin, senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "40 timmar fördelat på 4 dagar (4 timmar teori och 36 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133132"
    },
    {
      "id": "tilläggsförmåga-granattillsats-40mm",
      "name": "Tilläggsförmåga Granattillsats 40mm",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på granattillsats 40mm så att soldaten efter avslutad kurs kan verka stridande i befattning med tilldelad granattillsats 40mm.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Skjutövning 2 samt stridsövningar 1-3 och 5-6.",
      "purpose": "Att soldaten skall kunna verka med granattillsats 40mm i stridande befattning.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna avge eld mot mål på kända och okända avstånd med granattillsats 40mm från stridsställning under enklare förhållanden.",
      "secondaryLearningObjectives": [],
      "examination": "Godkänt resultat på skjutövning och stridsövningar enligt kursplan.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Genomförd och godkänd basförmåga granattillsats 40mm."
      ],
      "literature": [
        "Skjutr grtillsats ak år 2000 (m7742-110401).",
        "Skjutr grtillsats ak tlg år 2000 (m7742-110411)."
      ],
      "additionalInfo": null,
      "typicalDuration": "24 timmar fördelat på 3 dagar",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133150"
    },
    {
      "id": "tilläggsförmåga-kulspruta-m58",
      "name": "Tilläggsförmåga Kulspruta m/58",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på kulspruta m/58 så att soldaten efter avslutad kurs kan verka i stridande befattning med tilldelad kulspruta m/58.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Kursen omfattar skjutövningar mot rörligt mål i förbiflygning och mot bogserat mål enligt gällande skjutreglemente och manual för kulspruta m/58.",
      "purpose": "Att ge soldaten förmåga att verka i stridande befattning med kulspruta m/58.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna verka i stridande befattning och hantera kulspruta m/58 mot rörliga mål.",
      "secondaryLearningObjectives": [
        "Kunna genomföra skjutövningar mot rörligt mål i förbiflygning.",
        "Kunna genomföra skjutövningar mot bogserat mål.",
        "Tillämpa säker vapenhantering enligt gällande säkerhetsbestämmelser och lokala föreskrifter."
      ],
      "examination": "Examination sker genom praktiska skjutövningar och ett skriftligt uppslagsprov. Max tre examinationstillfällen ges under kursen.",
      "prerequisites": [
        "Genomförd och godkänd grundutbildning (gu, gu hv, gmu, gmu hv).",
        "Genomförd och godkänd basförmåga kulspruta m/58."
      ],
      "literature": [
        "Manual kulspruta m/58 (senaste utgåva).",
        "Skjutreglemente A pek 1 och 2 (senaste utgåvor)."
      ],
      "additionalInfo": null,
      "typicalDuration": "10 timmar fördelat på 1–2 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133219"
    },
    {
      "id": "tilläggsförmåga-pansarskott-m86",
      "name": "Tilläggsförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på pansarskott m/86 så att soldaten efter avslutad kurs kan verka stridande i befattning nyttjandes pansarskott m/86.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Med godkänt resultat genomfört skjutövningar 6pa, 8, 9, 18, 19p samt stridsövning kap 4.2 stn 2+3 och del av kap 4.3.",
      "purpose": "Att ge soldaten förmåga att verka i befattning med pansarskott m/86 och kunna avge eld mot mål på kända och okända avstånd.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna nyttja pansarskott m/86 i stridande befattning.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för pansarskott m/86 med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala regler för skjutbana/skjutfält.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde/säkerhetskontrollant vid skjutövningar."
      ],
      "examination": "Fortlöpande praktiska examinationer under kursen med max 3 examinationstillfällen. Godkänt resultat krävs på samtliga moment.",
      "prerequisites": [
        "Genomförd instruktörskurs ak4 del 1.",
        "Instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning på pansarskott m/86.",
        "Godkänt kompetensprov på aktuellt vapen.",
        "Registerkontroll genomförd enligt organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Manual pansarskott m/86 (m7739-370101).",
        "Skjutbok skjutr pskott m/86 utg 1 2004-03-12.",
        "Skjutr pek 1, 1994 års utgåva (m7742-111002).",
        "Skjutr pek 2, 1994 års utgåva (m7742-111012)."
      ],
      "additionalInfo": "Kursen genomförs inte vid hemvärnets stridsskola (hvss).",
      "typicalDuration": "1 dag om 10 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133238"
    },
    {
      "id": "skarpskytt-psg90-hv",
      "name": "Skarpskytt PSG90 Hv",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen innehåller säkerhetsbestämmelser, materielkunskap, vård, ballistiklära, skarpskytts uppträdande och strid samt skjutning på olika avstånd i dager och under mörker. Kursen är en kombination av teori och praktik.",
      "targetAudience": "Hemvärnets personal som ska placeras som skarpskytt PSG90 i hemvärnet.",
      "syllabus": "Säkerhetsbestämmelser, materielkunskap, vapenvård, ballistiklära, skarpskytts uppträdande och strid, skjutning på olika avstånd i dagsljus och mörker.",
      "purpose": "Att eleven efter genomförd kurs ska kunna tjänstgöra som skarpskytt i hemvärnsförband och fortsätta utbildningen inom eget förband.",
      "primaryLearningObjective": "Efter kursen ska eleven ha förståelse för vapnets funktion, effekt, verkan och säkerhetsbestämmelser samt ha färdighet i handhavande och vård av vapnet enligt gällande bestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå vädrets inverkan på träffresultatet.",
        "Uppnå färdighet i skjutning och agerande som skarpskytt i hemvärnsförband."
      ],
      "examination": "Teoretiska och praktiska prov samt ett fysiskt test. Max 1 genomförande under aktuell kurs.",
      "prerequisites": [
        "Genomfört grundutbildning (GU).",
        "Genomfört kompetensprov AK."
      ],
      "literature": [
        "Soldr mtrl vapen PSG 90",
        "Handbok prickskytt",
        "Skjutr PSG 90"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HVSS).",
      "typicalDuration": "10 dagar om totalt 100 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133258"
    },
    {
      "id": "indirekt-ledarskap",
      "name": "Indirekt ledarskap",
      "shortName": "IL",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK705LE11",
      "description": "Kursen riktar sig till chefer och ledare på högre organisatoriska nivåer inom Försvarsmakten och frivillig försvarsorganisation. Den ger förståelse för det indirekta ledarskapets betydelse och verktyg för att utveckla medarbetare och organisation.",
      "targetAudience": "Chefer och ledare på högre organisatoriska nivåer inom Försvarsmakten och frivillig försvarsorganisation, med minst två organisatoriska nivåer under sig.",
      "syllabus": "Föreläsningar, gruppdiskussioner och eget arbete med fokus på handlingsinriktad och imageinriktad påverkan. Analys och reflektion kring det egna indirekta ledarskapet och dess påverkan på medarbetare och organisation.",
      "purpose": "Att ge deltagaren förståelse för det indirekta ledarskapets betydelse för verksamheten samt verktyg för att utveckla det egna indirekta ledarskapet.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna utveckla sitt indirekta ledarskap och därigenom påverka medarbetare och organisation positivt.",
      "secondaryLearningObjectives": [
        "Förstå hur påverkan sker från ledningen till medarbetarna genom chefer på lägre organisatorisk nivå.",
        "Analysera och reflektera över den egna rollen som indirekt ledare och förebild.",
        "Utveckla en personlig plan för det egna indirekta ledarskapet."
      ],
      "examination": "Deltagande och aktivt engagemang under kursens alla moment.",
      "prerequisites": [
        "Eventuella förkunskapskrav enligt respektive kursarrangör inom Försvarsmakten eller frivillig försvarsorganisation."
      ],
      "literature": [
        "Handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": "Kursen genomförs med minst 6 och max 12 deltagare och leds av två behöriga handledare enligt Försvarshögskolans anvisningar. Handledare ska finnas upptagna i Försvarshögskolans handledarregister.",
      "typicalDuration": "3 dagar (2 dagar sammanhängande plus 1 fördjupningsdag efter 2-3 månader).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133317"
    },
    {
      "id": "ledarskap-och-självkännedom",
      "name": "Ledarskap och självkännedom",
      "shortName": "LoS",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK705LE12",
      "description": "Kursen Ledarskap och självkännedom (LoS) syftar till att deltagaren efter genomgången kurs ska vara bättre rustad att fungera som ledare och gruppmedlem genom fördjupad insikt om sig själv som person och ledare. Kursen genomförs normalt under fältmässiga förhållanden med en kombination av enskilda uppgifter, grupparbeten och teoretiska moment, inklusive framtagande av en personlig utvecklingsplan och en uppföljningsdag.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som chef/ställföreträdare på tropp- eller plutonsnivå inom Hemvärnet. I mån av plats kan även övriga chefer inom Försvarsmakten eller civila chefer som tillträtt ny chefsbefattning delta. Prioritet ges till chefer/stf vid pluton eller tropp.",
      "syllabus": "Kursen omfattar självreflektion och analys av personligt ledarskap, grupparbete med fokus på ledarskapsmodellen, teoretiska föreläsningar, framtagande av personlig utvecklingsplan samt uppföljning. Under kursen behandlas även kopplingar till ledarskapsmodellen och försvarsmaktens värdegrund.",
      "purpose": "Att deltagaren ska utveckla sin självkännedom och ledarskapsförmåga för att bättre kunna verka som ledare inom Hemvärnet eller motsvarande organisationer.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha fördjupad insikt om sig själv som person och ledare samt ha utarbetat en personlig plan för utveckling av sitt ledarskap.",
      "secondaryLearningObjectives": [
        "Reflektera över och analysera det egna ledarskapet utifrån kursens teoretiska grund.",
        "Förstå och tillämpa ledarskapsmodellen i praktiska ledarskapssituationer.",
        "Utveckla förmågan att fungera som både ledare och gruppmedlem.",
        "Skapa en personlig utvecklingsplan baserad på feedback och självreflektion."
      ],
      "examination": "Deltagande under hela kursen samt aktivt deltagande i samtliga moment. Kursen avslutas med en uppföljningsdag där personlig utvecklingsplan revideras. Ingen skriftlig examination förekommer.",
      "prerequisites": [],
      "literature": [
        "Gällande handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": "Kursen leds av behöriga handledare med avtal från Försvarshögskolan och ska genomföras med minst 6 och högst 12 deltagare. Kursen får inte genomföras på kortare tid än angivna tre plus en dagar utan skriftligt medgivande från Försvarshögskolan.",
      "typicalDuration": "3+1 dagar, totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133338"
    },
    {
      "id": "utveckling-grupp-ledare",
      "name": "Utveckling grupp ledare",
      "shortName": "UGL",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK705LE13",
      "description": "Kursen syftar till att deltagarna skall få erfarenhet av gruppdynamiska situationer och förståelsen för sin roll i dessa. Målet är att kursdeltagarna ska få verktyg att reflektera över hur de kan utveckla sina egna grupper till att bli mer produktiva genom bättre samarbete, konflikthantering och kommunikation.",
      "targetAudience": "Avsedd för chefer och ledare inom Försvarsmakten och frivilligförsvar som vill utveckla sin förmåga att leda och utveckla grupper.",
      "syllabus": "Upplevelsebaserat lärande med praktiska gruppuppgifter och reflektioner. Fokus på grupprocesser, konflikthantering, kommunikation, feedback, ledarstilar och grupputvecklingsstadier.",
      "purpose": "Att deltagarna ska utveckla sin självkännedom och förmåga att bidra till utveckling av sin egen grupp genom reflektion och lärande.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha ökad förmåga att arbeta med gruppdynamik och ledarskap för att utveckla effektiva och välfungerande grupper.",
      "secondaryLearningObjectives": [
        "Arbeta med reflektion och lärande enskilt och i grupp.",
        "Hantera och förstå konflikter samt använda konflikthanteringsverktyg.",
        "Kommunicera direkt och klart.",
        "Förstå känslors inverkan på individ- och gruppnivå.",
        "Kunna ta och ge utvecklande feedback.",
        "Förstå hur värderingar påverkar relationer och ledarskap.",
        "Uppskatta roller och normers påverkan på gruppens arbete.",
        "Urskilja olika stadier i en grupps utveckling och anpassa sitt ledarskap därefter.",
        "Förstå behovet av olika ledarstilar."
      ],
      "examination": "Deltagande under kursen samt aktivt deltagande i praktiska och reflektiva moment. Kursen examineras genom kontinuerlig observation och deltagande utan formell skriftlig examination.",
      "prerequisites": [
        "Eventuella förkunskapskrav enligt respektive kursarrangör inom Försvarsmakten eller frivilligförsvar."
      ],
      "literature": [
        "Handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": "Kursen genomförs i grupper om 8-12 deltagare och leds av två behöriga handledare med avtal från Försvarshögskolan. Kursen kan genomföras som metod för att nå utbildningsmål inom programbunden grundläggande eller fortsatt officersutbildning.",
      "typicalDuration": "5 dagar om totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "additionalInfo": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133407"
    },
    {
      "id": "utvecklande-ledarskap",
      "name": "Utvecklande ledarskap",
      "shortName": "UL",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK816LE10",
      "description": "Kursen syftar till att deltagarna ska kunna analysera, reflektera över och medvetet utveckla sina dagliga ledarhandlingar med hjälp av modellen Utvecklande Ledarskap (UL) samt den självinsikt som kommer ur tolkningen av UL360. Målet är att utveckla deltagarnas ledarskap för att bättre utveckla medarbetarna och därigenom nå högre effektivitet i organisationen.",
      "targetAudience": "Avsedd för HV-personal placerad som chef eller ställföreträdare vid bataljon, kompani, pluton eller tropp. Även lämplig för bataljonsstabschef, sektionschef i bataljonsstab samt övriga chefer inom Försvarsmakten. Prioritering ges till chefer/stf på pluton-, kompani- och bataljonsnivå.",
      "syllabus": "Teoretisk bakgrund till ledarstilsmodellen och ledarskapsmodellen UL. Praktiska moment och gruppdiskussioner. Genomgång och tolkning av personlig profil från 360-graders bedömning. Utarbetande av personlig utvecklingsplan för det egna ledarskapet. Fördjupningsdag med revidering av utvecklingsplanen och fördjupande teorier.",
      "purpose": "Att deltagarna ska kunna analysera och utveckla sitt ledarskap med fokus på att utveckla medarbetare och organisation för att uppnå högre effektivitet.",
      "primaryLearningObjective": "Efter kursen ska deltagaren ha utvecklat sitt ledarskap och utarbetat en personlig utvecklingsplan baserad på 360-graders feedback och ledarskapsmodellen UL.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa den övergripande ledarskapsmodellen och ledarstilsmodellen UL.",
        "Analysera och reflektera över det egna ledarskapet utifrån feedback från närmaste chef och medarbetare.",
        "Utveckla en personlig plan för fortsatt utveckling av det egna ledarskapet.",
        "Använda feedback och personliga mål för att förbättra ledarskapet i praktiken."
      ],
      "examination": "Deltagande och aktivt engagemang under kursens alla moment. Ingen separat skriftlig eller praktisk examination.",
      "prerequisites": [
        "Eventuella förkunskapskrav enligt respektive kursarrangör inom Försvarsmakten eller frivillig försvarsorganisation."
      ],
      "literature": [
        "Gällande handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 32 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "courseCode": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133422"
    },
    {
      "id": "chef-musikkar",
      "name": "Chef musikkår",
      "shortName": "CMK",
      "category": "Musikutbildningar",
      "courseCode": null,
      "description": "Grundkurs för att kunna placeras som musikkårchef eller ställföreträdande vid hemvärnsmusikkår. Kursen bör genomföras innan befattningen tillträds.",
      "targetAudience": "Nuvarande eller blivande musikkårchefer eller ställföreträdande med god kännedom om egen hemvärnsmusikkår.",
      "syllabus": "Organisation, planering och ledning av hemvärnsmusikkår, FM värdegrund, verksamhetsplanering, utvärdering, pedagogiska grunder, militär kontext inklusive formellt uppträdande och uniformsbestämmelser, verksamhetssäkerhet, personalansvar, rekrytering, materieltjänsthantering och fysiskt stridsvärde.",
      "purpose": "Att deltagaren ska kunna verka som chef eller ställföreträdande för en hemvärnsmusikkår.",
      "primaryLearningObjective": "Efter kursen ska deltagaren med handledning ha färdighet att organisera, planera och leda verksamheten vid hemvärnsmusikkår.",
      "secondaryLearningObjectives": [
        "Förståelse för rollen som musikkårchef.",
        "Förståelse för Försvarsmaktens värdegrund – ÖRA.",
        "Fakta om Försvarsmaktens organisation och uppgifter.",
        "Förståelse för verksamhetsplaneringsprocessen vid hemvärnsmusikkår.",
        "Förståelse för utvärdering som metod för verksamhetsutveckling.",
        "Fakta om Försvarsmaktens pedagogiska grundsyn.",
        "Förståelse för militär kontext avseende formellt uppträdande i sluten ordning och uniformsbestämmelser.",
        "Förståelse för Försvarsmaktens verksamhetssäkerhet (riskmedvetenhet och riskanalys).",
        "Fakta om eget personalansvar avseende ersättningar, försäkringar, avtal, lagar och förordningar.",
        "Förståelse för rekryteringsprocessen vid hemvärnsmusikkår.",
        "Fakta om materieltjänsthanteringen inom hemvärnsmusikkår.",
        "Förståelse för det fysiska stridsvärdet vid hemvärnsmusikkår."
      ],
      "examination": "Deltagande i all verksamhet under kursen bedöms. Ingen separat examination anges.",
      "prerequisites": [
        "God kännedom om egen hemvärnsmusikkår."
      ],
      "literature": [
        "Pedagogiska grunder 2006",
        "Säkerhetstjänst i grundläggande nivå (SäKi grunder)",
        "Handbok Hemvärnet (HVH) 2018",
        "Försvarsmaktens föreskrifter (FFS)",
        "Försvarsmaktens informationsbroschyrer (FIB)",
        "FM Uniformsbestämmelser",
        "CERI FM 2010"
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "literature": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133444"
    },
    {
      "id": "gu-f",
      "name": "Grundläggande soldatutbildning för frivillig personal, GU-F",
      "shortName": "GU-F",
      "category": "Grundläggande militärutbildning",
      "courseCode": null,
      "description": "Grundläggande utbildning som genomförs som GSSU av frivilliga försvarsorganisationer för personal utan militär grundutbildning. Kursen syftar till att ge deltagaren förmåga att försvara sig själv och tillsammans med andra kunna försvara plats eller anläggning.",
      "targetAudience": "Personal som inte har militär grundutbildning och är rekryterad mot en konkret befattning i insatsorganisationen.",
      "syllabus": "Grundläggande soldatutbildning inklusive försvar av plats eller anläggning, tillämpning av lagar, regler och bestämmelser samt värdegrund.",
      "purpose": "Att ge deltagaren grundläggande militär kompetens för tjänstgöring i hemvärnets krigsförband och möjliggöra tilldelning av vapen vid övning, beredskap eller tjänstgöring.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna försvara sig själv och tillsammans med andra kunna försvara plats eller anläggning samt handla i enlighet med gällande lagar och regler.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa grundläggande soldatkunskaper.",
        "Följa Försvarsmaktens värdegrund och regelverk.",
        "Kunna agera i samverkan med andra i försvarsuppgifter."
      ],
      "examination": "Godkänt deltagande i samtliga utbildningsmoment krävs. Eventuell komplettering ska ske inom sex månader från kurstillfället.",
      "prerequisites": [
        "Rekrytering mot konkret befattning i insatsorganisationen.",
        "Upprättad utbildningsplan och tecknat utbildningsavtal med Försvarsmakten inklusive säkerhetsprövning.",
        "Minst 18 år, svensk medborgare och medlem i frivillig försvarsorganisation.",
        "God fysisk status."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "14 dagar",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133452"
    },
    {
      "id": "tccc-cls",
      "name": "TCCC-CLS (Combat Life Saver)",
      "shortName": "TCCC-CLS",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen är en komplettering för hemvärnssjukvårdare, gruppsjukvårdare och stridssjukvårdare som tidigare inte genomgått TCCC-konceptet. Den syftar till att ge kunskap om TCCC-principer och kritiska livräddande färdigheter i stridsmiljö.",
      "targetAudience": "Hemvärnssjukvårdare, gruppsjukvårdare och stridssjukvårdare som gått äldre utbildningar utan TCCC eller tidigare stridssjukvårdsutbildning utan TCCC-koncept.",
      "syllabus": "TCCC-principer, koncept, livräddande färdigheter, värdegrund, och tillämpning av livräddande åtgärder i stridsmiljö.",
      "purpose": "Att säkerställa att deltagaren förstår och kan tillämpa livräddande åtgärder enligt TCCC-konceptet för att eliminera förebyggbara dödsfall vid trauma i stridsmiljö.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna utföra grundläggande livräddande åtgärder enligt TCCC i stridsmiljö.",
      "secondaryLearningObjectives": [
        "Förstå TCCC-principer och deras betydelse i stridsmiljö.",
        "Utföra kritiska livräddande åtgärder på en grundläggande nivå.",
        "Värdesätta vikten av livräddande färdigheter för att minska dödsfall på slagfältet."
      ],
      "examination": "Godkänt deltagande i samtliga utbildningsmoment krävs. Eventuell komplettering ska ske inom sex månader efter kursen.",
      "prerequisites": [
        "Befattning som gruppsjukvårdare, stridssjukvårdare eller hemvärnssjukvårdare."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "Fem dagar",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133500"
    },
    {
      "id": "pb8",
      "name": "PB8 (Personbil 8)",
      "shortName": "PB8",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att kursdeltagaren efter genomförd utbildning ska kunna bruka och vårda PB8 samt tillämpa civila lagar och militära regler som påverkar fordonstjänsten.",
      "targetAudience": "Avsedd för dig som är placerad eller skall placeras i befattning som fordonsförare PB8.",
      "syllabus": "Tillämpning av civila lagar och militära föreskrifter, användning av undantag och särbestämmelser för Försvarsmaktens fordonsförare, beskrivning av fordonets system och utrustning, trafiksäker körning på väg och halt underlag, körning i dags- och mörkerförhållanden, körning med lätt släpkärra, åtgärder före, under och efter körning samt vård av fordon och utrustning.",
      "purpose": "Att kursdeltagaren efter utbildningen ska kunna framföra och vårda PB8 på ett säkert och regelrätt sätt enligt gällande lagar och regler.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna framföra PB8 trafiksäkert och vårda fordonet enligt gällande regelverk.",
      "secondaryLearningObjectives": [
        "Tillämpa civila lagar och militära regler som påverkar fordonstjänsten.",
        "Använda undantag och särbestämmelser för Försvarsmaktens fordonsförare.",
        "Beskriva funktioner och system på fordonstypen med tillhörande utrustning.",
        "Köra fordonet på väg och halt underlag i dags- och mörkerförhållanden.",
        "Köra fordonet med lätt släpkärra.",
        "Utföra åtgärder före, under och efter körning samt vårda fordon och utrustning."
      ],
      "examination": "Godkänd körning på väg och halt underlag samt praktisk och teoretisk prövning av fordonshantering och regelkännedom. Obligatorisk närvaro krävs för godkänt betyg.",
      "prerequisites": [
        "God vana att köra bil.",
        "Ansökan om körkortstillstånd för lägst C1 om civil körkortsbehörighet saknas."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "7 dagar",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133510"
    },
    {
      "id": "gk-tung-slapkarra",
      "name": "Gk Tung släpkärra",
      "shortName": "GKTSK",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att ge deltagaren kunskap och färdighet att bruka och vårda tung släpkärra med påskjutsbroms samt tillämpa civila lagar och militära regler som påverkar fordonstjänsten. Under utbildningen används personbil 8 som dragfordon.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning i kokgrupp. Ansökan är öppen för övriga i mån av plats.",
      "syllabus": "Civila lagar och militära regler för fordonstjänst, funktioner och system på fordonstypen, körning av ekipaget i dags- och mörkerförhållanden, rangering (backning), åtgärder före, under och efter körning samt vård av fordon och utrustning.",
      "purpose": "Att deltagaren efter genomförd utbildning ska kunna bruka och vårda tung släpkärra med påskjutsbroms samt tillämpa gällande regelverk för fordonstjänsten.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna framföra tung släpkärra med påskjutsbroms på ett trafiksäkert sätt och vårda ekipaget enligt gällande föreskrifter.",
      "secondaryLearningObjectives": [
        "Tillämpa civila lagar och militära regler som påverkar fordonstjänsten.",
        "Använda undantag och särbestämmelser för Försvarsmaktens fordonsförare.",
        "Beskriva funktioner och system på fordonstypen med tillhörande utrustning.",
        "Köra ekipaget i dags- och mörkerförhållanden.",
        "Rangera ekipaget med god förmåga.",
        "Utföra åtgärder före, under och efter körning samt vård av fordon och utrustning."
      ],
      "examination": "Praktisk examination av körförmåga och hantering av ekipaget samt teoretisk kontroll av regelverk och säkerhetsrutiner. Godkänt resultat krävs för kursgodkännande.",
      "prerequisites": [
        "Giltigt förarbevis för personbil 8 (pb8)."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "Fem dagar.",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "enrichmentConfidence": "high",
      "enrichmentProvenance": {
        "id": "pdf",
        "name": "pdf",
        "shortName": "pdf",
        "category": "pdf",
        "description": "pdf",
        "targetAudience": "pdf",
        "syllabus": "pdf",
        "purpose": "pdf",
        "primaryLearningObjective": "pdf",
        "secondaryLearningObjectives": "pdf",
        "examination": "pdf",
        "prerequisites": "pdf",
        "typicalDuration": "pdf",
        "courseResponsible": "pdf",
        "sourceFiles": "pdf",
        "enrichmentConfidence": "pdf"
      },
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260104-133520"
    },
    {
      "id": "instruktörskurs-12",
      "name": "Instruktörskurs 1 + 2",
      "shortName": "IK12",
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "primaryLearningObjective": "",
      "secondaryLearningObjectives": [],
      "examination": "",
      "prerequisites": [],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "",
      "courseResponsible": "MRM",
      "baseTemplateIds": [
        "instruktörskurs-1",
        "instruktörskurs-2"
      ],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    }
  ]
}