{
  "templates": [
    {
      "id": "kombu",
      "name": "Kombattantutbildning för krigsplacerad, obeväpnad personal (KombU)",
      "shortName": "KombU",
      "category": "Grundläggande militärutbildning",
      "courseCode": "UTPGK450KU02",
      "description": "Grundläggande utbildning som ger personal förståelse för sin roll, status och uppgifter i Försvarsmaktens krigsorganisation. Kursen omfattar fysisk träning, exercis, CBRN, hälso- och sjukvårdsutbildning, försvarsupplysning, FM värdegrund, folkrätt, förmanskap, uniformssystem 90, förevisningsskjutning och brandutbildning.",
      "targetAudience": "Krigsplacerad, obeväpnad personal, såväl kombattanter som icke kombattanter (dessa icke kombattanter kan efter särskild utbildning tilldelas lättare beväpning).",
      "syllabus": "Fysisk träning, exercis, CBRN, hälso- och sjukvårdsutbildning, försvarsupplysning, FM värdegrund, folkrätt, förmanskap, uniformssystem 90, förevisningsskjutning, brandutbildning.",
      "purpose": "Att ge deltagarna kunskap om totalförsvaret, Försvarsmaktens värdegrund, folkrätt och det egna krigsförbandets uppgift och funktion i krigsorganisationen samt förmåga att krigsplaceras på avsedd befattning.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna försvara sig själv och tillsammans med andra försvara plats eller anläggning samt handla enligt gällande lagar, regler och bestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå sin roll och status som kombattant eller icke kombattant i krigsorganisationen.",
        "Tillämpa Försvarsmaktens värdegrund och folkrätt.",
        "Kunna agera enligt soldatregler och förmanskap.",
        "Behärska grundläggande fysisk träning och sjukvård.",
        "Känna till uniformssystem 90 och brandutbildning."
      ],
      "examination": "För godkänt krävs att kursdeltagaren deltagit i samtliga utbildningsmoment. Eventuell komplettering ska ske inom 6 månader från kurstillfället.",
      "prerequisites": [
        "Befattning i hemvärnet eller anställd i Försvarsmakten.",
        "Rekryterad mot konkret befattning i insatsorganisationen.",
        "Upprättad utbildningsplan och tecknat utbildningsavtal med Försvarsmakten inklusive säkerhetsprövning."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "5 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204410"
    },
    {
      "id": "gruppchef-1",
      "name": "Gruppchefskurs 1",
      "shortName": "GC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK2011230",
      "description": "Kursen omfattar grundläggande gruppchefsutbildning där fokus ligger på orderträning, stridsteknik, beslutsfattning där teori varvas med praktiska övningar utomhus.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som gruppchef/stf inom Hemvärnet.",
      "syllabus": "Grundläggande ledarskap, ordergivning, gruppens stridsteknik, soldatregler och tillämpade övningar.",
      "purpose": "Att deltagaren skall kunna verka som gruppchef/stf inom Hemvärnet eller frivilligorganisation.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som gruppchef inom Hemvärnet eller frivilligorganisation.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla gruppchefens roll, ansvar och utförande av befälsföring av grupp vid uppgifts lösande samt tillämpandet av soldatreglerna, FM Värdegrund och fysiskt stridsvärde.",
        "Förklara och använda högre chefs order i form av att ge order till egen grupp.",
        "Exemplifiera och använda stridsteknik enligt handbok hemvärnspluton-grupp vid framryckande och tagande av skyddsobjekt inom hemvärnsplutons ram.",
        "Beskriva upprättandet av förläggning, observationsplats och postställe.",
        "Definiera och beskriva hemvärnsplutonernas organisation och uppgifter."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av plutonchefs order, användande av OBO alternativt 5 punkts order enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen med tyngdpunkt på fältdygnen. Max 2 examinationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, eller GU.",
        "Genomfört kompetensprov Ak 4B/C.",
        "Fysisk status för att klara minst två fältdygn."
      ],
      "literature": "Handbok Hvplut/Hvgrp del 1-2, (Grunder och Objektet), MSR, FM Handböcker och reglementen",
      "additionalInfo": "Utbildning till gruppchef/stf omfattar två kurser; Gruppchefskurs1 och Gruppchefskurs 2. Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": "10 dagar om totalt 106 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204420"
    },
    {
      "id": "gruppchef-2",
      "name": "Gruppchefskurs 2",
      "shortName": "GC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011181",
      "description": "Kursen omfattar fortsatt gruppchefsutbildning genom teori och praktik med praktiska övningar utomhus där fokus ligger på orderträning, stridsteknik och beslutsfattning i tillämpad och simulerad miljö.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som gruppchef/stf inom Hemvärnet.",
      "syllabus": "Orderträning, stridsteknik vid tagande av objekt och sammanstöt i urban och betäckt terräng, uppdragsutvärdering, tillämpning av fysiskt stridsvärde, eskortuppgifter med hemvärnsgrupp, användning av hundekipage vid bevakning och skydd, samt sammanfattning av hemvärnsplutonernas uppgifter.",
      "purpose": "Att deltagaren skall kunna verka som gruppchef/stf inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som gruppchef inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Behärska gruppens stridsteknik vid tagande av objekt och sammanstöt i urban och betäckt terräng inom plutons ram.",
        "Förklara och använda uppdragsutvärdering samt förstå stress och konfliktnivåers påverkan på uppgiftslösning och fysiskt stridsvärde.",
        "Förklara och använda hemvärnsgrupp vid eskortuppgift inom plutons ram.",
        "Förklara och använda hundekipage vid bevakning och skydd av objekt.",
        "Sammanfatta och förklara hemvärnsplutonernas uppgifter, inklusive insats- och bevakningspluton."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av plutonchefs order, användande av OBO alternativt 5-punktsorder enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomfört gruppchefskurs 1 eller motsvarande gruppchefsutbildning under värnplikten/grundutbildning.",
        "Godkänt kompetensprov AK 4B/C.",
        "Bör ha innehaft befattningen under minst en söf eller kfö.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-2 (Grunder och Objektet)",
        "Markstridshandböcker",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": "Utbildning till gruppchef/stf omfattar två kurser; Gruppchefskurs 1 och Gruppchefskurs 2. Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204437"
    },
    {
      "id": "gruppchef-3",
      "name": "Gruppchefskurs 3",
      "shortName": "GC3",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011231",
      "description": "Kursen omfattar praktik mot gruppchef understödsgrupp och inkluderar repetitionsutbildning i granatgevärsteori och praktik, skjutning med olika ammunitionstyper samt förevisning av vapenverkan.",
      "targetAudience": "Avsedd för dig som är eller skall placeras som chef eller ställföreträdare för en understödsgrupp inom Hemvärnet.",
      "syllabus": "Praktisk ledning av understödsgrupp, granatgevärsteori och praktik, skjutövningar med olika ammunitionstyper, vapenverkan, stridsteknik och ledning vid tagande av objekt och sammanstöt inom insatsplutons ram.",
      "purpose": "Att deltagaren skall kunna verka som understödsgruppchef eller ställföreträdare inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som understödsgruppchef/stf inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara understödsgruppens stridsteknik och ledning vid tagande av objekt samt sammanstöt inom insatsplutons ram.",
        "Kunna beskriva, förklara och tillämpa granatgevärets funktion, prestanda och handhavande.",
        "Beskriva, förklara och tillämpa vikten av fysiskt stridsvärde vid ledning av understödsgrupp."
      ],
      "examination": "Praktiskt lärande examinationer där elevens handhavande av granatgevär samt ordergivning vid nedbrytande av plutonchefs order och agerande som understödsgruppchef/stf utvärderas fortlöpande under kursen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd Gruppchefskurs 1.",
        "Utbildad på granatgevär m/48 i lägst nivå brukare dokumenterat i prio.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-2 (Grunder och Objektet)",
        "Manual 8,4 cm granatgevär",
        "MSR",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": "Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204446"
    },
    {
      "id": "gruppchef-12",
      "name": "Gruppchefskurs 1 + 2",
      "shortName": "GC12",
      "category": "Chefsutbildningar",
      "courseCode": "GC12",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "primaryLearningObjective": "",
      "secondaryLearningObjectives": [],
      "examination": "",
      "prerequisites": [],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [
        "gruppchef-1",
        "gruppchef-2"
      ],
      "sourceFiles": [
        "hvss-kurskatalog-2025.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "gruppchef-x",
      "name": "Gruppchefskurs X",
      "shortName": "GCX",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119GP00",
      "description": "Kursen omfattar grundläggande gruppchefsutbildning där fokus ligger på orderträning, stridsteknik och beslutsfattning. Teori varvas med praktiska övningar utomhus, inklusive tre dygn i fält.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som x-gruppchef/stf inom Hemvärnet eller frivilligorganisationer.",
      "syllabus": "Grundläggande ledarskap, ordergivning, gruppens stridsteknik, maskering och gruppering av typfordon, upprättande av förläggning och postställe, samt tillämpade övningar i fält.",
      "purpose": "Att deltagaren skall kunna verka som x-gruppchef/stf inom Hemvärnet eller frivilligorganisation.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som x-gruppchef inom Hemvärnet eller frivilligorganisation.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla gruppchefens roll, ansvar och utförande av befälsföring av grupp vid uppgiftslösande samt tillämpandet av FM värdegrund och fysiskt stridsvärde.",
        "Förklara och använda högre chefs order genom att bryta ned den och ge order till egen grupp.",
        "Beskriva grunderna och genomföra maskering och gruppering av egna gruppens typfordon.",
        "Förstå framryckning och ingående i stridsställning.",
        "Beskriva upprättandet av förläggning och postställe.",
        "Definiera och beskriva hemvärnsplutonernas organisation och uppgifter."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning efter nedbrytande av plutonchefs order, användande av OBO enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen med tyngdpunkt på fältdygnen. Max två omexaminationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GMU, GU, GUF eller motsvarande.",
        "Genomfört kompetensprov AK 4B, C eller pistol m/88.",
        "Fysisk status för att klara minst tre fältdygn."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-2 (grunder), senaste utgåvor.",
        "Markstridshandböcker, senaste utgåvor.",
        "FM handböcker och reglementen, senaste utgåvor."
      ],
      "additionalInfo": "Utbildning till x-gruppchef/stf. För att erhålla gruppchefsgraden furir skall individen genomföra en gruppchefskurs inom sitt specialistområde samt instruktörskurs 1.",
      "typicalDuration": "10 dagar om totalt 106 timmar, varav 3 dygn i fält.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204458"
    },
    {
      "id": "troppchef-stab-tross",
      "name": "Troppchef Stab och Tross",
      "shortName": "CSOT",
      "category": "Chefsutbildningar",
      "courseCode": "HVT422CGP01",
      "description": "Kursen omfattar grundläggande troppchefsutbildning med fokus på ansvarsförhållande, orderträning och grupperingsteknik där teori varvas med praktiska övningar utomhus.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som stab/tross troppchef inom Hemvärnet. Öppen för gruppchefer inom stab/tross troppen för vidareutbildning.",
      "syllabus": "Ansvarsförhållanden, orderträning, grupperingsteknik, försvar av grupperingsplats, marschorder, praktiska övningar.",
      "purpose": "Att deltagaren skall kunna verka som troppchef för stab och tross inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som troppchef för stab och tross inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla troppchefens roll, ansvar och utförande av befälsföring av tropp vid uppgiftslösande.",
        "Förklara och använda högre chefs order i form av att ge order till egen tropp.",
        "Beskriva grunderna och använda rätt order vid marschorder.",
        "Beskriva gruppering för stab och tross samt förstå åtgärder vid försvar av grupperingsplats."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av kompanichefs order, fortsatt utbildning av 5-punktsorder enligt handbok och agerande i rollen som troppchef utvärderas fortlöpande under kursen med tyngdpunkt på ansvaret i troppchefens olika uppgifter. Eleven bedöms mot godkänd/icke godkänd skalan vid ämnesexaminationer. Max 1 omexaminationstillfälle under kursen.",
      "prerequisites": [
        "Genomförd plutonchefskurs 1 för troppchefer.",
        "Genomförd gruppchefskurs x alternativt gruppchefskurs 1 för gruppchefer."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 3",
        "Handbok Hvkomp del 1-3",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "Denna kurs räknas som plutonchefskurs 2 för troppchefer på stab och tross.",
      "typicalDuration": "5 dagar om totalt 46 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204508"
    },
    {
      "id": "plutonchef-1",
      "name": "Plutonchefskurs 1",
      "shortName": "PC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK2011222",
      "description": "Kursen omfattar grundläggande plutonchefskunskaper och färdigheter med tyngdpunkt på orderträning och stridsteknik. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar och spel på stridsplaner i terrängen.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som plutonchef/stf eller kompanikvartermästare, chef hvflygtropp. Öppen för chef ledningstropp, gruppchef/stf i stridande befattning.",
      "syllabus": "Grundläggande plutonchefsbefattning, orderträning, stridsteknik, befälsföring, tillämpning av soldatregler, FM värdegrund och fysiskt stridsvärde.",
      "purpose": "Att deltagaren skall verka som plutonchef/stf inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som plutonchef/stf inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Förklara och utveckla plutonchefens roll, ansvar och utförande av befälsföring av pluton vid uppgiftslösande samt tillämpandet av soldatreglerna, FM värdegrund och fysiskt stridsvärde.",
        "Exemplifiera och använda stridsteknik enligt handbok hemvärnspluton-grupp vid framryckande och tagande av skyddsobjekt samt skydda/bevaka inom hemvärnskompaniets ram.",
        "Förklara och använda högre chefs order i form av att ge order till egen pluton i form av 5-punktsorder och uppdragstaktik.",
        "Definiera och beskriva hemvärnskompaniets organisation, uppgifter och stridsteknik."
      ],
      "examination": "Praktiskt lärande examinationer där elevens nedbrytande av kompanichefs order och användande av 5-punktsorder vid ordergivning enligt handbok samt agerandet i rollen som plutonchef utvärderas fortlöpande under kursen med tyngdpunkt på kader- och lektionspassen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GU, GMU.",
        "Gruppchefskurs 2.",
        "Genomfört skyddsvaktsutbildning.",
        "Godkänt kompetensprov AK 4B/C.",
        "God fysisk status för att klara minst ett dygn i fält."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-3 (Grunder, Objektet, Anvisningar)",
        "MSR",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": "Kursen är öppen för gruppchefer i Hemvärnet med orienterande syfte. Utbildning till plutonchef/stf omfattar två kurser; Plutonchefskurs 1 och Plutonchefskurs 2. Plutonchefskurs 3 är företrädesvis avsedd för de som skall bli chef/stf för insatspluton.",
      "typicalDuration": "10 dagar om totalt 96 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204523"
    },
    {
      "id": "plutonchef-2",
      "name": "Plutonchefskurs 2",
      "shortName": "PC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011223",
      "description": "Kursen omfattar fortsatt plutonchefsutbildning med teori och praktik, där fokus ligger på orderträning, stridsteknik och beslutsfattning i tillämpad och simulerad miljö (strisim pc). Praktiska övningar sker utomhus.",
      "targetAudience": "Avsedd för dig som skall placeras eller tjänstgör som plutonchef/stf. Öppen för ledningsplutonchef/stf.",
      "syllabus": "Orderträning, stridsteknik, beslutsfattning, tillämpad och simulerad miljö, stridsplanering, ledarskap och taktik.",
      "purpose": "Att deltagaren skall kunna verka som plutonchef/stf inom Hemvärnet och utveckla sin förmåga i befattningen.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som plutonchef inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa 5-punktsorder vid framtagande av stridsplan och ge order (obo) vid plutonens tagande av objekt och sammanstöt i urban och betäckt terräng inom kompaniets ram.",
        "Kunna tillämpa stridsteknik enligt handbok hemvärnspluton-grupp vid framryckning, tagande av skyddsobjekt samt skydda, bevaka och ytövervaka inom hemvärnskompaniets ram.",
        "Kunna tillämpa uppdragsutvärdering och förstå hur stress och konfliktnivå kan påverka uppgiftslösningen samt tillämpa fysiskt stridsvärde.",
        "Planera och leda skydd och bevakning med hundekipage."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av kompanichefs order, användande av 5-punktsorder enligt handbok och agerande i rollen som plutonchef utvärderas fortlöpande under kursen med tyngdpunkt på kader- och lektionspassen. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomfört plutonchefskurs 1.",
        "Godkänd skyddsvaktsutbildning.",
        "God fysisk status."
      ],
      "literature": [
        "Handbok Hvplut/Hvgrp del 1-3 (Grunder och Objektet, Anvisningar)",
        "MSR",
        "FM Handböcker och reglementen"
      ],
      "additionalInfo": "Bör ha genomfört en kfö eller söf på plutonchefsnivå. Utbildning till plutonchef/stf omfattar två kurser; plutonchefskurs 1 och plutonchefskurs 2. Plutonchefskurs 3 är avsedd för de som skall bli chef/stf för en insatspluton.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204626"
    },
    {
      "id": "plutonchef-3",
      "name": "Plutonchefskurs 3",
      "shortName": "PC3",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011520",
      "description": "Kursen omfattar fortsatt plutonchefsutbildning med fokus på orderträning och beslutsfattning under tidspress. Utbildningen genomförs med lärarledda lektioner, grupparbeten, redovisningar och spel på stridsplaner i terrängen.",
      "targetAudience": "Avsedd för dig som är placerad som plutonchef/stf i en insatspluton. Öppen i mån av plats för bevakningsplutonchef/stf, hvundplutonchef/stf och grkplutonchef. Sökande ska vara krigsplacerad som plutonchef/stf med minst en genomförd kfö.",
      "syllabus": "Orderträning, beslutsfattning under tidspress, stridsteknik enligt handbok hemvärnspluton-grupp, praktiska övningar i terräng, planering och genomförande av stridsuppgifter inom insatsplutons ram.",
      "purpose": "Att deltagaren skall kunna verka som plutonchef/stf vid en insatspluton i Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som plutonchef/stf vid en insatspluton i Hemvärnet.",
      "secondaryLearningObjectives": [
        "Producera och genomföra bedömmande utifrån högre chefs order, ta fram stridsplan och ge plutonchefens order med kort förberedelsetid.",
        "Tillämpa stridsteknik vid framryckande och tagande av skyddsobjekt samt skydda och bevaka inom insatskompaniets ram.",
        "Använda rätt teknik vid ytövervakning och tagande av objekt i urban terräng.",
        "Förstå och tillämpa grunder för försvar samt stridsuppgiften eldöverfall i typfall 5-6.",
        "Utveckla och använda insatsplutonens organisation vid uppgiften skydda transport."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av kompanichefs order och användande av OBO och 5-punktsorder enligt handbok samt agerande i rollen som plutonchef utvärderas fortlöpande under kursen med tyngdpunkt på kader- och lektionspass. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomfört plutonchefskurs 2.",
        "Godkänt kompetensprov AK 4B/C Hemvärnet.",
        "Godkänd skyddsvaktsutbildning.",
        "God fysisk status."
      ],
      "literature": "Handbok Hvplut/Hvgrp del 1-3 (grunder, objektet, anvisningar), MSR, FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204639"
    },
    {
      "id": "plutonchef-12",
      "name": "Plutonchefskurs 1 + 2",
      "shortName": "PC12",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK8100030",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "primaryLearningObjective": "",
      "secondaryLearningObjectives": [],
      "examination": "",
      "prerequisites": [],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [
        "plutonchef-1",
        "plutonchef-2"
      ],
      "sourceFiles": [
        "hvss-kurskatalog-2025.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "ledningsplutonchef",
      "name": "Ledningsplutonchefskurs",
      "shortName": "LPC",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK2011502",
      "description": "Kursen omfattar ledningsplutonens organisation och uppgifter samt upprättande av bataljonsstab. Utbildningen genomförs i form av lärarledda lektioner och grupparbeten, där ledningsplutonchefens roll belyses och tränas.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som chef/stf i en ledningspluton/ledningstropp inom hemvärnsbataljon/militärregionstab. Öppen i mån av plats för ledningstroppchef vid hemvärnsundkompani.",
      "syllabus": "Ledningsplutonens organisation och materiel, sambandstjänstens uppbyggnad vid hemvärnsbataljon, upprättande, försvar och betjäning av bataljonsstab/militärregionstab, orderproduktion till egen pluton utifrån högre chefs order.",
      "purpose": "Att få en grundlagd förmåga att agera och leda som plutonchef vid ledningspluton/militärregionstab.",
      "primaryLearningObjective": "Efter kursen ska deltagaren ha färdighet att leda och samordna verksamheten inom plutonen.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara hur man organiserar, upprättar, försvarar samt betjänar en bataljonsstab/militärregionstab.",
        "Kunna producera en order till egen pluton utifrån högre chefs order med gott om tid.",
        "Beskriva och förklara ledningsplutonens organisation och materiel.",
        "Beskriva och förklara sambandstjänstens uppbyggnad vid hemvärnsbataljon."
      ],
      "examination": "Praktiskt lärande gruppexamination inom plutons ram inklusive ordergivning. Obligatoriska moment är genomgångar som belyser plutonens verksamhet, organisation och uppgifter samt övning i att bygga ledningsplats för bataljonsstab i kvarter/tält. Max 1 examinationstillfälle under kursen.",
      "prerequisites": [
        "Genomförd plutonchefskurs 1."
      ],
      "literature": [
        "KFS",
        "FM Handbok Stabstjänst",
        "FM Handbok Sambandstjänst"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning.",
      "typicalDuration": "10 dagar om totalt 96 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204646"
    },
    {
      "id": "kompanichef-1",
      "name": "Kompanichefskurs 1",
      "shortName": "KC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB11",
      "description": "Kursen omfattar grundläggande kompanichefsutbildning med fokus på stridsteknik och taktik på kompani, funktioner inom kompaniet samt bedömande fram till en färdig stridsplan, samt beslutsfattning och orderträning med gott om till begränsad tid för planering. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen samt spel på framtagna stridsplaner vid objekt i betäckt terräng. Kursen kan delvis genomföras tillsammans med plutonchefskurs.",
      "targetAudience": "Avsedd för kompanichefer och stf kompanichef.",
      "syllabus": "Stridsteknik och taktik på kompaninivå, funktioner inom kompaniet, framtagande av stridsplan, beslutsfattning, orderträning, rekognosering, spel på stridsplaner.",
      "purpose": "Att ge deltagaren grundläggande förmåga att agera och leda som chef vid eget kompani.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla en stridsplan och leda sitt kompani vid skydd och bevakning av objekt i terräng och urban miljö.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen och planera under tidspress för att ta fram en stridsplan för kompani utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva hur plutonerna leds och samordnas inom kompaniets strid vid framryckning och tagande av oförsvarad terräng.",
        "Utveckla ledarskapet kopplat till rollen som kompanichef.",
        "Beskriva motståndarens organisation och verksamhet samt relevanta lagar och mandat för kompanichefen.",
        "Förklara hur hemvärnet aktiveras och vilka praktiska åtgärder som ska genomföras vid beredskapshöjningar.",
        "Identifiera kompanichefens ansvar och konsekvenser av beslut ur ett moraliskt och etiskt perspektiv."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av bataljonchefs order, användande av fempunktsorder enligt handbok och agerande i rollen som kompanichef utvärderas fortlöpande genom taktik- och ledarskapsmoment samt spel på stridsplaner i terrängen. Aktivt deltagande krävs för godkännande.",
      "prerequisites": [
        "Grundkurs stabstjänst (GKS).",
        "Plutonchefskurs 2 och erfarenhet från befattning."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok Ledning Bataljon 2007",
        "Handbok Hemvärnsbataljon/kompani/pluton",
        "Handbok Markstrid – Kompani 2016",
        "Handbok Motståndaren 2016",
        "Arméreglemente Taktik 2013"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Utbildning till kompanichef omfattar två kurser; kompanichefskurs 1 och 2 (formell). Kompanichefskurs 3 är en fördjupningskurs.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204655"
    },
    {
      "id": "kompanichef-2",
      "name": "Kompanichefskurs 2",
      "shortName": "KC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011220",
      "description": "Kursen omfattar fortsatt kompanichefsutbildning med fokus på stridsteknik på pluton/kompani, funktioner inom kompaniet samt bedömande fram till färdig stridsplan och beslutsfattning/orderträning med gott/ont om tid inklusive förmågan att utvecklas i ledarskapet som kompanichef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på egna framtagna stridsplaner vid objekt i urban miljö samt broar/förbindelser. Kursen genomförs till del tillsammans med plutonchefskurs 2.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som kompanichef/stf. Kursen är öppen i mån av plats för c s3/5, c ledningslag/stribef.",
      "syllabus": "Stridsteknik på pluton/kompani, kompanifunktioner, bedömning och framtagande av stridsplan, beslutsfattning och orderträning, ledarskapsutveckling, rekognosering, stridsplanering i urban miljö och vid broar/förbindelser.",
      "purpose": "Att ge deltagaren fördjupad förmåga att agera och leda som kompanichef med begränsad tid till förfogande samt utveckla ledarskapet inom befattningen.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utarbeta en stridsplan och leda sitt kompani vid skydd och bevakning av objekt i urban miljö, broar och förbindelser samt principer för ytövervakning och försvar på kompaninivå.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen (PUT) vid genomförande av bedömning för att ta fram en stridsplan för kompaniet utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva och förklara hur plutonerna leds och samordnas inom ramen för kompaniets strid vid framryckning och tagande av objekt i urban miljö samt broar och förbindelser.",
        "Beskriva principer för ytövervakning i täckt terräng och modeller för försvar enligt handbok hemvärnskompani.",
        "Beskriva hur sabotageförband och luftlandsatt motståndare är organiserade och verkar.",
        "Identifiera och förklara kompanichefens ansvar samt konsekvenser av beslut på kort och lång sikt, även ur ett moraliskt och etiskt perspektiv i kris (typinsats 5)."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av bataljonchefens order, användande av fem-punktsorder enligt handbok samt agerande i rollen som kompanichef utvärderas fortlöpande under kursen genom taktiska nötter, ledarskapsnötter samt spel på stridsplaner i terrängen med tyngdpunkt på applikatoriska exempel. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Kompanichefskurs 1."
      ],
      "literature": [
        "KFS",
        "Arméhandbok del 2",
        "Metodhandbok ledning bataljon 2007",
        "Handbok bataljon/kompani",
        "Övriga FM handböcker och reglementen"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning. Utbildning till kompanichef omfattar två formella kurser; kompanichefskurs 1 och 2. Kompanichefskurs 3 är avsedd för chef HV-insatskompani och kan genomföras som repetitionskurs för alla kompanichefer vid behov.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204718"
    },
    {
      "id": "kompanichef-3",
      "name": "Kompanichefskurs 3",
      "shortName": "KC3",
      "category": "Chefsutbildningar",
      "courseCode": "HVT422FKB03",
      "description": "Kursen omfattar fortsatt kompanichefsutbildning för kompanichefer samt repetitionskurs med fokus på stridsteknik på pluton/kompani, funktioner inom kompaniet samt bedömande fram till färdig stridsplan och beslutsfattning/orderträning med gott/ont om tid inklusive förmågan att utvecklas i ledarskapet som kompanichef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på egna framtagna stridsplaner vid broar/förbindelser, eskort, försvar och störastrid. Kursen kan till del genomföras tillsammans med plutonchefskurs 3.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som kompanichef/stf vid hemvärnskompani. Öppen i mån av plats för c s3, kompanichef/stf (hvund och båtkompani). Kan även genomföras som repetitionskurs för alla kompanichefer/stf vid behov.",
      "syllabus": "Stridsteknik på pluton/kompani, kompanifunktioner, framtagande av stridsplan, beslutsfattning och orderträning, ledarskapsutveckling, rekognosering, spel på stridsplaner vid broar/förbindelser, eskort, försvar och störastrid.",
      "purpose": "Att deltagaren skall få en fördjupad färdighet att vara chef vid eget kompani och kunna producera en stridsplan samt leda kompaniet vid skydd och bevakning av objekt i urban miljö, broar/förbindelser samt vid eskort, försvar och störastrid.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna producera en stridsplan och leda sitt kompani vid skydd och bevakning av objekt i urban miljö, broar/förbindelser samt vid eskort, försvar och störastrid.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa kompaniets ledning och samordning inom ramen för lösandet av stridsuppgifterna bevaka, skydda, försvara samt störa.",
        "Beskriva och förklara hur en motståndare (sabotageförband samt ll-förband) är organiserade och verkar.",
        "Beskriva och förklara hur kompaniet stör en mekaniserad motståndare.",
        "Beskriva och förklara hur eskort genomförs på plutonsnivå inom insatskompaniets ram.",
        "Ha utvecklat insikt och förståelse för vikten av att skapa en god förbandsanda vid kompaniet."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av bataljonchefens order, användande av 5-punktsorder enligt handbok samt agerande i rollen som kompanichef utvärderas fortlöpande under kursen. Examination sker under ordergivningar, spel på stridsplaner i terrängen, diskussioner i seminarieform samt praktiska ledarskapsövningar. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Kompanichefskurs 2."
      ],
      "literature": [
        "Handbok hemvärnsbataljon (remissutgåva)",
        "Handbok hemvärnskompani del 1-3 2017",
        "Handbok markstrid – kompani 2016",
        "Handbok markstrid- motståndaren 2016",
        "Handbok ikfn 2016",
        "Handbok stabstjänst grunder 2016"
      ],
      "additionalInfo": "Utbildningen kan delvis genomföras parallellt på två tätorter, beroende på bakgrundskunskaper hos elever som genomför kursen som repetitionskurs. Kursen kan bedrivas till del på distans.",
      "typicalDuration": "7 dagar om totalt 60 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204729"
    },
    {
      "id": "kompanistridskurs",
      "name": "Kompanistridskurs",
      "shortName": "KSTR",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB10",
      "description": "Kursen omfattar grundläggande utbildning på kompaninivå med fokus på taktik, funktioner inom bataljon och kompani, organisation och uppgifter samt framtagande av stridsplan. Utbildningen genomförs med lärarledda lektioner, grupparbeten, redovisningar, rekognoscering och spel på stridsplaner.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som stridsledare på kompani och bataljon. Kursen kan även genomföras som repetitionskurs för kompanichefer och stf kompanichefer samt som fördjupningskurs för kvartermästare, plutonchefer och stabsmedlemmar.",
      "syllabus": "Taktik på kompaninivå, funktioner inom bataljon och kompani, organisation och uppgifter i bataljon och kompani, framtagande av stridsplan, ledarskapsmoment.",
      "purpose": "Att ge deltagaren grundläggande förståelse för stridsteknik och taktik på kompaninivå för att effektivt kunna verka i befattning som stridsledare kompani och bataljon.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka i egen befattning med ökad förståelse för kompaniets taktik och ledning.",
      "secondaryLearningObjectives": [
        "Kunna ta fram en stridsplan för kompani utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva hur kompaniet leds och samordnas vid skydd och bevakning av objekt som hamn, broar, förbindelser och flygbas.",
        "Förstå motståndarens organisation och verksamhet mot egna förband.",
        "Beskriva praktiska åtgärder vid beredskapshöjningar inom hemvärnet."
      ],
      "examination": "Genom diskussioner, muntliga och skriftliga redovisningar samt spel på stridsplaner. Aktivt deltagande krävs för godkänt betyg.",
      "prerequisites": [
        "Grundkurs stabstjänst (gks)."
      ],
      "literature": [
        "Handbok hemvärns-bataljon/kompani",
        "AH Ledning 2016",
        "Handbok markstrid kompani 2016"
      ],
      "additionalInfo": "Kursen kan genomföras som repetitionskurs för kompanichefer vid behov.",
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204752"
    },
    {
      "id": "bataljonchef-1",
      "name": "Bataljonchefskurs 1",
      "shortName": "BC1",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB01",
      "description": "Kursen omfattar grundläggande bataljonchefsutbildning med fokus på stridsteknik och taktik på bataljon, funktioner inom bataljon samt bedömande fram till färdig stridsplan. Beslutsfattning och orderträning med gott om tid, samt förmåga att utveckla sitt ledarskap som bataljonchef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på framtagna stridsplaner.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som bataljonchef, stf bataljonchef. Även öppen för stabschef, chef s3 samt bekämpningschef s3. Övriga befattningar hänvisas till bataljonsstridskurs.",
      "syllabus": "Stridsteknik och taktik på bataljon, funktioner inom bataljon, bedömande fram till färdig stridsplan, beslutsfattning, orderträning, ledarskapsutveckling.",
      "purpose": "Att deltagaren skall erhålla grundläggande färdighet i bataljonchefsbefattningen och kunna utveckla en stridsplan samt leda bataljon vid skydd och bevakning av objekt, marinbas, hamnar, broar och förbindelser.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som bataljonchef/stf och leda bataljon vid skydd och bevakning av objekt.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen och planering under tidspress (PUT) för att skapa en stridsplan för bataljon utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva hur kompanierna leds och samordnas över tid vid skydd och bevakning av hamnar, broar och förbindelser.",
        "Beskriva och förklara hur bataljonen kan störa en mekaniserad motståndare.",
        "Beskriva hur S2-funktionen bör utnyttjas effektivt inom ramen för bataljonens uppgift.",
        "Beskriva motståndarens organisation och verksamhet.",
        "Förstå insatsreglernas påverkan på bataljonchefens agerande.",
        "Förklara praktiska åtgärder vid olika beredskapshöjningar.",
        "Utveckla det indirekta ledarskapet.",
        "Identifiera och beskriva bataljonchefens ansvar och konsekvenser av beslut ur ett moraliskt och etiskt perspektiv i krig."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av MR-order, användande av 5-punktsorder enligt handbok samt agerande i rollen som bataljonchef utvärderas fortlöpande under kursen genom taktiska och ledarskapsmoment. Spel på stridsplaner i terrängen med tyngdpunkt på applikatoriska exempel. Aktivt deltagande krävs för godkännande.",
      "prerequisites": [
        "Kompanichefskurs 2 alternativt kompanistridskurs.",
        "Brukare av IS HV."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok Ledning Bataljon 2007",
        "Handbok Hemvärnsbataljon (remissutgåva)",
        "Handbok Hemvärnskompani del 1-3 2017",
        "Handbok Markstrid – Kompani 2016",
        "Handbok Markstrid – Motståndaren 2016",
        "Reglemente Armé Taktik 2013",
        "Handbok IKFN 2016",
        "Handbok Stabstjänst Grunder 2016",
        "Handbok Undsäk Tjänst för Hemvärnet 2017"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Utbildning till bataljonchef omfattar två kurser: bataljonchefskurs 1 och bataljonchefskurs 2. Som fördjupning genomförs bataljonchefskurs 3.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204811"
    },
    {
      "id": "bataljonchef-2",
      "name": "Bataljonchefskurs 2",
      "shortName": "BC2",
      "category": "Chefsutbildningar",
      "courseCode": "MAHFK2011218",
      "description": "Kursen omfattar fortsatt bataljonchefsutbildning med fokus på stridsteknik och taktik på bataljon, funktioner inom bataljon samt bedömande fram till färdig stridsplan. Beslutsfattning och orderträning med gott/ont om tid, samt förmåga att utveckla sitt ledarskap som bataljonchef. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar, rekognosering i terrängen och spel på framtagna stridsplaner.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som bataljonchef, stf bataljonchef. Även öppen för stabschef.",
      "syllabus": "Fördjupning i stridsteknik och taktik på bataljonsnivå, funktioner inom bataljon, bedömning och framtagande av stridsplan, beslutsfattning och orderträning, ledarskapsutveckling.",
      "purpose": "Att utveckla färdigheter i bataljonchefsbefattningen för att med begränsad tid kunna utveckla en stridsplan och leda bataljon vid skydd och bevakning av objekt, flygbas, broar och förbindelser.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som bataljonchef/stf med förmåga att leda bataljon vid skydd och bevakning av objekt under tidspress.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa bedömandemallen och planering under tidspress (PUT) för att skapa stridsplan utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och genomföra samordning och samverkan mellan militära och civila aktörer.",
        "Förklara och värdera hur kompanierna leds och samordnas över tid vid skydd och bevakning av flygbas, broar och förbindelser.",
        "Beskriva och förklara hur bataljonen kan försvara knutpunkt mot luftlandsatt motståndare.",
        "Förklara hur insatsregler påverkar bataljonchefens agerande.",
        "Utveckla det indirekta ledarskapet.",
        "Identifiera och beskriva bataljonchefens ansvar samt konsekvenser av beslut på kort och lång sikt, även ur ett moraliskt och etiskt ledarskapsperspektiv i fred och kris."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av mr order, användande av 5-punktsorder enligt handbok samt agerande i rollen som bataljonchef utvärderas fortlöpande under kursen genom taktiska och ledarskapsmoment. Spel på stridsplaner i terrängen med tyngdpunkt på applikatoriska exempel. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Bataljonchefskurs 1.",
        "Brukare av informationssystem hemvärnet (ishv)."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärnsbataljon (remissutgåva)",
        "Handbok hemvärnskompani del 1-3 2017",
        "Handbok markstrid – kompani 2016",
        "Handbok markstrid – motståndaren 2016",
        "Reglemente armé taktik 2013",
        "Handbok IKFN 2016",
        "Handbok stabstjänst grunder 2016"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Utbildning till bataljonchef omfattar två kurser: bataljonchefskurs 1 och bataljonchefskurs 2. Som fördjupning genomförs bataljonchefskurs 3.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204831"
    },
    {
      "id": "bataljonchef-3",
      "name": "Bataljonchefskurs 3",
      "shortName": "BC3",
      "category": "Chefsutbildningar",
      "courseCode": "HVT422FKB04",
      "description": "Kursen omfattar fördjupad bataljonchefsutbildning med fokus på föreläsningar, seminarier och grupparbeten. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, redovisningar och spel på framtagna planer.",
      "targetAudience": "Avsedd för dig som är i befattning som bataljonchef eller ställföreträdande bataljonchef.",
      "syllabus": "Fördjupning i bataljonchefsbefattningen med fokus på samordning, ledarskap, taktik och stridsteknik på bataljonsnivå. Seminarier och grupparbeten med tillämpning av ledningsmetoder och samverkan mellan militära och civila aktörer.",
      "purpose": "Att ge deltagaren en fördjupad färdighet i bataljonchefsbefattningen och ökad kompetens för ledning av bataljon i komplexa situationer.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha fördjupade kunskaper och färdigheter för att verka som bataljonchef/stf och kunna leda bataljon vid skydd och bevakning av objekt samt samordna insatser enligt gällande regelverk.",
      "secondaryLearningObjectives": [
        "Kunna använda kunskaper från lektioner och seminarier i praktisk ledning och samordning.",
        "Öka förmågan att genomföra samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva och förklara hur bataljonen kan försvara knutpunkt mot luftlandsatt motståndare.",
        "Förstå och tillämpa insatsregler som påverkar bataljonchefens agerande.",
        "Utveckla och fördjupa det indirekta ledarskapet.",
        "Erhålla ökade kunskaper i försvarsmaktens kommunikationstjänst.",
        "Identifiera och beskriva bataljonchefens ansvar samt konsekvenser av beslut på kort och lång sikt, även ur ett moraliskt och etiskt ledarskapsperspektiv i fred och kris."
      ],
      "examination": "Relevanta och tillämpbara slutsatser ska kunna redovisas efter genomförda seminarier och föreläsningar. Kunskapskontroll av hemstudier genomförs. För godkänt krävs aktivt deltagande och minst 90% närvaro. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Bataljonchefskurs 2 genomförd.",
        "Minst tre års tjänstgöring i befattning som bataljonchef eller ställföreträdande bataljonchef."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärnsbataljon (remissutgåva)",
        "Handbok markstrid – motståndaren 2016",
        "Reglemente armé taktik 2013",
        "Handbok IKFN 2016"
      ],
      "additionalInfo": "Kursen kan till del ske som distansutbildning. Bataljonchefskurs 3 kan även nyttjas som repetitionskurs för erfarna bataljonchefer som inte genomfört kursen på HVSS under en längre tid (5-10 år). Utbildning till bataljonchef omfattar bataljonchefskurs 1 och 2 som grund samt denna fördjupningskurs.",
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204847"
    },
    {
      "id": "bataljonstridskurs",
      "name": "Bataljonstridskurs",
      "shortName": "BSTR",
      "category": "Chefsutbildningar",
      "courseCode": "MAHGK119KB00",
      "description": "Kursen omfattar grundläggande utbildning på bataljonsnivå med fokus på taktik för kompani och bataljon, funktioner inom bataljon, organisation och uppgifter i bataljonsstab samt framtagande och utmynnande i en stridsplan. Ledarskapsmoment ingår som en naturlig del i utbildningen.",
      "targetAudience": "Avsedd för dig som är placerad eller skall placeras i befattning som sektionschef och befäl i bataljonstab. Kursen är även öppen för funktionsplutonchefer och kompanichef/stf. Kan också genomföras som repetitionskurs för bataljonschefer/stf som inte genomfört kurs på många år.",
      "syllabus": "Taktik på kompani och bataljon, funktioner inom bataljon, organisation och uppgifter i bataljonsstab, framtagande av stridsplan, ledarskapsmoment.",
      "purpose": "Att ge deltagaren grundläggande kunskaper och färdigheter för att verka i befattning på bataljonsnivå med fokus på stridsteknik och ledarskap.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka i befattning på bataljonsnivå med förståelse för taktik, organisation och ledarskap.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa taktik på kompani och bataljon.",
        "Beskriva funktioner och organisation inom bataljon och bataljonsstab.",
        "Kunna utarbeta och genomföra en stridsplan.",
        "Utveckla ledarskapsförmåga inom bataljonsnivå."
      ],
      "examination": "Genom diskussioner, muntliga och skriftliga redovisningar samt spel på elevernas redovisningar. Aktivt deltagande krävs för godkännande.",
      "prerequisites": [
        "Grundkurs stabstjänst (gks)."
      ],
      "literature": [
        "AH Ledning 2016",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärns-bataljon/kompani",
        "Handbok markstrid – kompani 2016",
        "Handbok motståndaren 2016",
        "Arméreglemente taktik 2013",
        "Handbok IKFN"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204907"
    },
    {
      "id": "grundkurs-övningsledare-automatkarbin-bas",
      "name": "Grundkurs Övningsledare Automatkarbin BAS",
      "shortName": "GKÖLAK",
      "category": "Instruktörsutbildningar",
      "courseCode": "HVT423F10001",
      "description": "Kursen ger brukarkompetens till och med basnivå på automatkarbin enligt gällande reglementen och handböcker. Den omfattar teori och praktik med studier av reglementen, skjututbildning och skjutinstruktörsspecifik utbildning. Deltagaren tillämpar kunskaperna under kortare trupputbildningsmoment där övriga kursdeltagare utgör övningstrupp.",
      "targetAudience": "Avsedd för dig som ska utses till övningsledare för skjututbildning bas med automatkarbin inom Hemvärnet och frivillig försvarsorganisation.",
      "syllabus": "Studier av reglementen och handböcker, skjututbildning och skjutinstruktörsspecifik utbildning, praktiska trupputbildningsmoment med övningstrupp.",
      "purpose": "Att ge kursdeltagaren erforderlig kompetens att utses till övningsledare vid skjututbildning bas med automatkarbin enligt gällande reglemente och därigenom kunna utbilda och träna personal i skjutteknik samt tillämpa säkerhets- och lokala bestämmelser.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna planera, genomföra och utvärdera skjututbildning för brukare med automatkarbin enligt gällande reglemente samt fungera som stöd för förbandschef i vapenutbildningsfrågor.",
      "secondaryLearningObjectives": [
        "Förklara innebörden av sjukvårdsberedskap och dess tillämpning enligt säkerhetsbestämmelser.",
        "Förklara konstruktion och tillämpning av riskområden för eldhandvapen på skjutbana.",
        "Förklara vapenverkan av finkalibrig ammunition och skjutbanans uppbyggnad.",
        "Tillämpa centrala och lokala säkerhets- och miljöbestämmelser vid skarpskjutning.",
        "Planera, genomföra och utvärdera skjututbildning för brukare med automatkarbin.",
        "Värdera den egna och truppens aktuella förmåga samt analysera och utveckla skyttars skjutteknik."
      ],
      "examination": "Examination sker genom skriftliga prov och individuella muntliga/skriftliga redovisningar, samt bedömning av personlig färdighet och förmåga att tillämpa gällande reglementen och handböcker. Obligatorisk närvaro krävs. Max två omexaminationstillfällen per provmoment.",
      "prerequisites": [
        "Genomförd brukarutbildning automatkarbin lägst basnivå med godkänt resultat.",
        "Genomförd instruktörskurs 1 (IK1) eller motsvarande.",
        "Genomförd digital skjututbildning grunder samt pedagogik för instruktörer på FM läroportal/Its Learning."
      ],
      "literature": [
        "Reglemente skjututbildning 2021",
        "Reglemente skjutning automatkarbin 2021",
        "Handbok skjututbildning automatkarbin 2021",
        "Reglemente verksamhetssäkerhet (SÄKR)"
      ],
      "additionalInfo": "Kursutvärdering genomförs efter avslutad kurs och ligger till grund för fortsatt utveckling. Kursen kräver obligatorisk närvaro för godkännande.",
      "typicalDuration": "8 dagar, totalt 80 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204930"
    },
    {
      "id": "instruktörskurs-1",
      "name": "Instruktörskurs 1",
      "shortName": "IK1",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHGK9090001",
      "description": "Kursen omfattar 80 timmar och består av teoretiska grunder samt praktiska trupputbildningsövningar. Undervisningen varvar teori med praktik. Elevledda övningar sker både inomhus och utomhus.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som gruppchef/stf alternativt ska bli instruktör inom hemvärnet.",
      "syllabus": "Teoretiska grunder i utbildningsmetodik, planering och genomförande av övningar, praktiska trupputbildningsövningar, handledning och utvärdering.",
      "purpose": "Att efter genomförd och godkänd kurs tjänstgöra som biträdande generell instruktör inom hemvärnet och frivilligorganisation.",
      "primaryLearningObjective": "Att med handledning planera, genomföra och utvärdera motsvarande hemvärns introduktionsövningar (ej vapen) upp till grupps nivå.",
      "secondaryLearningObjectives": [
        "Bryta ner (analysera och förstå) tilldelad övning.",
        "Med handledning skriva övningsplan enligt HVSS fastställd mall samt genomföra övning och återkoppla till måluppfyllnad.",
        "Under övningsmoment och planskrivning kunna genomföra säkerhetsanalys och med handledning inarbeta riskhantering i övningsplanen.",
        "Använda förmedlad utbildningsmetod enligt handbok utbildningsmetodik.",
        "Använda utvärderingsmetoder enligt handbok utbildningsmetodik."
      ],
      "examination": "Praktiskt lärande examinationer där eleven ska använda sig av kurslitteratur för att planera och genomföra fyra övningar med stöd av HVSS övningsplansmall. Max 1 omexaminationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, GU, eller GU-F."
      ],
      "literature": [
        "Handbok utbildningsmetodik",
        "MSR",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "För att erhålla gruppchefsgrad furir skall gruppchefskurs 1 och 2 också vara genomförda.",
      "typicalDuration": "10 dagar om 80 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-204950"
    },
    {
      "id": "instruktörskurs-2",
      "name": "Instruktörskurs 2",
      "shortName": "IK2",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFK2011553",
      "description": "Utbildningen genomförs i form av lärarledda lektioner, grupparbeten, enskilda redovisningar av övningsplaner samt elevledda övningar både inomhus och utomhus.",
      "targetAudience": "Kursen är avsedd för dig som är placerad i befattning som plutonchef/stf. Öppen i mån av plats för troppchef och gruppchef/stf i stridande befattning.",
      "syllabus": "Planering och genomförande av tre övningar med stöd av HVSS övningsplansmall. Övning 1 omfattar 30 minuter vapenutbildning baserat på AK4B manual. Övning 2 omfattar stridsutbildning med lös ammunition om 45 minuter där teori och praktik varvas. Övning 3 omfattar planering för introduktionsutbildning Hemvärn.",
      "purpose": "Att med handledning planera, genomföra och utvärdera motsvarande hemvärns introduktionsövningar upp till plutonsnivån.",
      "primaryLearningObjective": "Efter genomförd och godkänd kurs ska deltagaren tjänstgöra som allmän instruktör inom Hemvärnet och frivilligorganisation.",
      "secondaryLearningObjectives": [
        "Bryta ner (analysera och förstå) tilldelad övning.",
        "Med handledning skriva övningsplan enligt HVSS fastställd mall samt genomföra övning och återkoppla till måluppfyllnad.",
        "Använda biträden och instruktörer vid planering och genomförande.",
        "Under övningsmoment och planskrivning kunna genomföra säkerhetsanalys och med handledning inarbeta riskhantering i övningsplanen.",
        "Använda förmedlad och gruppinriktad utbildningsmetod enligt handbok utbildningsmetodik.",
        "Använda utvärderingsmetoder enligt handbok utbildningsmetodik."
      ],
      "examination": "Praktiskt lärande examinationer där eleven ska använda sig av kurslitteratur för att planera och genomföra tre övningar med stöd av HVSS övningsplansmall. Stor vikt läggs på planeringsskrivning och tydlighet omfattande mål – krav – syfte. Max 1 examinationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, GU eller GU-F.",
        "Genomfört Instruktörskurs 1.",
        "Godkänt kompetensprov AK4 B/C."
      ],
      "literature": [
        "Handbok utbildningsmetodik",
        "MSR",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": null,
      "typicalDuration": "10 dagar om totalt 88 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205010"
    },
    {
      "id": "instruktörskurs-fusa-grupp",
      "name": "Instruktörskurs FUSA grupp",
      "shortName": "IKFUSA",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHAK2111559",
      "description": "Kursen omfattar skjutinstruktörsutbildning för förbandsutbildning av hemvärnets skyttegrupp med skarp ammunition i både dager och mörker enligt gällande skjutreglemente. Fokus ligger på förmågan att instruera och utveckla soldater inom gruppens stridsteknik i olika stridsuppgifter och terräng. Utbildningen genomförs huvudsakligen i skjutterräng och på skjutbana.",
      "targetAudience": "Avsedd för blivande skjutinstruktörer för FUSA hemvärnskyttegrupp inom Hemvärnet.",
      "syllabus": "Instruera och utveckla soldater i gruppens stridsteknik, tillämpa skjutreglemente och säkerhetsbestämmelser, planera och genomföra skjutövningar med skarp ammunition, riskhantering, användning av biträde och säkerhetskontrollant, utvärdera skjutresultat och genomförande.",
      "purpose": "Att ge deltagaren kompetens att verka som skjutinstruktör för FUSA hemvärnskyttegrupp och kunna bedriva förbandsutbildning med skarp ammunition.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande stridsutbildning för hemvärnskyttegrupp med skarp ammunition i både dager och mörker.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manualer med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för skjutterräng.",
        "Använda riskhantering före, under och efter övning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Instruera och utveckla soldater i eld och rörelse inom skyttegrupp.",
        "Utvärdera skjutresultat och genomförande."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och förmåga som skjutledare genom kortare genomförandemoment under kursen samt uppslagsprov i säkerhetsbestämmelser. Max tre examinationstillfällen under kursen krävs för godkänt betyg.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 och 2.",
        "Genomförd instruktörskurs säkr skjutbana och säkr avlyst terräng.",
        "Godkänd skjutinstruktör för respektive vapen.",
        "Väl förtrogen med handbok hemvärnsgrupp-pluton.",
        "Godkänt omdöme och personlig färdighet.",
        "Genomförd registerkontroll enligt organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente för respektive vapen",
        "Manual för respektive vapen",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205031"
    },
    {
      "id": "instruktörskurs-gevär-22-ungdomsvapen",
      "name": "Instruktörskurs Gevär 22 Ungdomsvapen",
      "shortName": "IKG22U",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ6121005",
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för gevär .22 ungdom med fokus på att instruera och utveckla ungdomar till säkra och medvetna skyttar inom respektive ungdomsorganisation. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för blivande skjutinstruktörer för gevär 22 ungdom.",
      "syllabus": "Grundläggande skjutr, säkerhetsbestämmelser, vapenhantering, riskhantering, skjutövningar och pedagogik för ungdomsutbildning.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för gevär 22 inom ungdomsverksamhet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning med gevär 22 på godkända skjutbanor med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente för gevär 22.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala regler för skjutbana.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt praktisk förmåga att leda trupputbildning som skjutinstruktör. Skriftligt uppslagsprov i säkerhet. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning i gevär 22.",
        "Godkänd registerkontroll enligt organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutr gevär 22 2004",
        "Manual gevär 22",
        "Lokala bestämmelser"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS). Organisationsenheten förordnar och ordersätter godkänd elev med giltighet upp till 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205058"
    },
    {
      "id": "instruktörskurs-granattillsats-ak4b",
      "name": "Instruktörskurs Granattillsats Ak4B",
      "shortName": "IKGTAK",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111660",
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för granattillsats automatkarbin enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som skyttar inom hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana med teori och praktik.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör för granattillsats automatkarbin inom hemvärnet.",
      "syllabus": "Instruktion och utveckling av skyttar, säkerhetsbestämmelser, skjutteknik, vapenhantering, riskhantering, användning av biträde och säkerhetskontrollant vid skjutövningar.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på granattillsats automatkarbin för hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarskjutning med granattillsats ak4b med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för granattillsats med fokus på säker vapenhantering.",
        "Tillämpa säkerhetsbestämmelser och lokala regler för skjutbana/skjutfält.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Genomföra instruktörsuppgifter i skjutinstruktörsrollen enligt gällande bestämmelser."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt förmåga att instruera under kursens praktiska moment. Skriftligt uppslagsprov i säkerhet genomförs. Max tre examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs automatkarbin del 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkerhet på skjutbana.",
        "Egen brukarutbildning i automatkarbin.",
        "Godkänt kompetensprov på granattillsats ak4b.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjutning granattillsats",
        "Manual granattillsats ak4b",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan vid utbildningsgrupp eller frivilligorganisation. Organisationsenheten förordnar och ordersätter godkänd elev med giltighet i högst 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205116"
    },
    {
      "id": "instruktörskurs-grg-m48",
      "name": "Instruktörskurs Grg m/48",
      "shortName": "IKGRG",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111556",
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för granatgevär m/48 enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som grg-skyttar inom hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som blivande skjutinstruktör granatgevär m/48 inom hemvärnet.",
      "syllabus": "Teoretiska föreläsningar och praktiska moment i skjutterräng/skjutbana med övningar i skjutförmåga och instruktörsfärdigheter.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på granatgevär m/48 för hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska eleven kunna planera, genomföra och utvärdera grundläggande brukarutbildning avseende skjutningar med granatgevär m/48 på godkända skjutbanor eller fast skjutplats med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för granatgevär med tyngdpunkt på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för aktuell skjutbana.",
        "Kunna använda riskhantering före, under och efter egen övning.",
        "Kunna använda biträde/säkerhetskontrollant vid skjutövningar och lösa uppgiften som säkerhetskontrollant."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt förmåga att instruera under kursens praktiska moment. Skriftligt uppslagsprov i säkerhet genomförs. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs AK del 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning på granatgevär m/48.",
        "Godkänt registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente granatgevär",
        "Manual 8,4 cm granatgevär",
        "Lokala bestämmelser"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan i utbildningsgrupp eller frivilligorganisation. Organisationsenheten förordnar och ordersätter godkänd elev med en giltighet om högst 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205135"
    },
    {
      "id": "instruktörskurs-is-hv",
      "name": "Instruktörskurs IS Hv",
      "shortName": "IKISHV",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHGK7110001",
      "description": "Kursen omfattar teknik- och metodutbildning för instruktörer i informationssystem hemvärnet (IS Hv). Utbildningen genomförs som teoretiska föreläsningar och praktiska moment.",
      "targetAudience": "Avsedd för dig som skall verka som IS Hv-instruktör vid egen bataljonsstab och är krigsplacerad i bataljonsstaben.",
      "syllabus": "Teknisk systemkunskap, montage och uppsättning, installation och laddning av grunddata, klienthantering, antivirus, kontoadministration, meddelandehantering, verksamhetsjournal, tablåer och mallar, fillagring samt metodutbildning.",
      "purpose": "Att deltagaren skall kunna utbilda egen bataljonsstab i informationssystem hemvärnet och utveckla sin förmåga över tid.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna beskriva och tillämpa programvaror och systemfunktioner i IS Hv samt utbilda bataljonsstab i systemets användning.",
      "secondaryLearningObjectives": [
        "Beskriva och tillämpa karttjänst och lägeskarta, lagerhantering, holdings och plans and orders i Sitaware.",
        "Beskriva och tillämpa systemkunskap inklusive stand-alone, installation, tvätt/impex, tilda, klienthantering och arkivering.",
        "Hantera allmän programvara och antivirus.",
        "Genomföra metodutbildning avseende kontoadministration och meddelandehantering.",
        "Använda verksamhetsjournal, tablåer, mallar och fillagring."
      ],
      "examination": "Kursen avslutas med ett enskilt teoretiskt prov samt en gruppexamination i form av en stabsorientering. Max 2 examinationstillfällen under kurstiden.",
      "prerequisites": [
        "Genomförd kurs FM AP/HR.",
        "Krigsplacerad i bataljonsstab."
      ],
      "literature": [
        "Metodhandbok IS Hv 1 & 2"
      ],
      "additionalInfo": "Frivilliga radioorganisationen har uppdraget som frivilligorganisation för kursen.",
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205151"
    },
    {
      "id": "instruktörskurs-ksp-58b",
      "name": "Instruktörskurs Ksp 58B",
      "shortName": "IKKSP",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111555",
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för kulspruta m/58 enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som skyttar inom hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör för kulspruta m/58 inom hemvärnet.",
      "syllabus": "Instruktion och utveckling av skyttar, säkerhetsbestämmelser, skjutteknik, praktiska övningar i skjutterräng/skjutbana.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på kulspruta m/58 för hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska eleven kunna planera, genomföra och utvärdera grundläggande brukarutbildning avseende skjutningar med kulspruta m/58 på godkända skjutbanor eller fast skjutplats med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för kulspruta m/58 med tyngdpunkt på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för aktuell skjutbana.",
        "Använda riskhantering före, under och efter egen övning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar samt lösa säkerhetskontrollantens uppgifter."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och skjutförmåga samt förmåga att instruera under kursen. Skriftligt uppslagsprov i säkerhet. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs AK4 del 1.",
        "Instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning på kulspruta m/58.",
        "Godkänt kompetensprov på eget vapen.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente ksp m/58",
        "Manual ksp m/58",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS). Organisationsenheten förordnar och ordersätter godkänd elev med giltighet om högst 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205212"
    },
    {
      "id": "instruktörskurs-oden",
      "name": "Instruktörskurs ODEN",
      "shortName": "IKODEN",
      "category": "Instruktörsutbildningar",
      "courseCode": "HVT422FIK00",
      "description": "Kursen omfattar grundläggande teoretisk och praktisk utbildning i förmågan att möta fientliga förband i olika konfliktnivåer samt att lösa stridsuppgiften störa och/eller bedriva fortsatt motstånd. Utbildningen genomförs som lärarledda lektioner och praktiska moment i terrängen.",
      "targetAudience": "Avsedd för yrkesofficer placerad på militärregionens utbildningsgrupp som instruktör eller utbildningsansvarig.",
      "syllabus": "Teoretiska lektioner om motståndares beteende vid olika konfliktnivåer, planering och ledning av stridsinsats för att störa motståndare, stridsmetoder såsom överfall och eldöverfall, infiltration, passage och exfiltration, möte med annan enhet, spaning, upplagstjänst samt hantering av kontakt med civila.",
      "purpose": "Att öka utbildningsbefälets förmåga att lägga upp övningar för hemvärnsförband mot realistisk motståndare och stödja hemvärnsförband vid tilldelning av utländska resurser.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera och leda stridsinsatser i syfte att störa motståndarens förband eller verksamhet inom eget ansvarsområde.",
      "secondaryLearningObjectives": [
        "Förstå motståndarens beteende vid olika konfliktnivåer.",
        "Kunskap om stridsmetoder såsom överfall och eldöverfall.",
        "Kunskap i infiltration, passage av egna linjer och exfiltration.",
        "Kunskap i möte med annan enhet och spaning för egen strid.",
        "Kunskap i upplagstjänst och risker vid kontakt med civila."
      ],
      "examination": "Praktiskt lärande examination där elevens förmåga att omsätta teori i praktik och planera motsvarande utbildning vid egen utbildningsgrupp värderas fortlöpande under kursen.",
      "prerequisites": [
        "Genomförd officersprogrammet (OP), SOU eller motsvarande."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "11 dagar, totalt 120 timmar varav 4 fältdygn.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205232"
    },
    {
      "id": "instruktörskurs-pansarskott-m86",
      "name": "Instruktörskurs Pansarskott m86",
      "shortName": "IKPSM86",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111557",
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för pansarskott m/86 enligt gällande skjutreglemente med fokus på förmågan att instruera och utveckla soldater som skyttar inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör för pansarskott m/86 inom Hemvärnet.",
      "syllabus": "Instruktion och utveckling av skyttar, säker vapenhantering, tillämpning av skjutreglemente och manual för pansarskott m/86, riskhantering, användning av biträde/säkerhetskontrollant vid skjutövningar.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer på pansarskott m/86 för Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning avseende skjutningar med pansarskott m/86 på godkända skjutbanor eller fast skjutplats med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för pansarskott m/86 med tyngdpunkt på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för aktuell skjutbana.",
        "Kunna använda riskhantering före, under och efter egen övning.",
        "Kunna använda biträde/säkerhetskontrollant vid skjutövningar på skjutfält (FUSA)."
      ],
      "examination": "Fortlöpande praktiska examinationer av personlig färdighet och skjutförmåga samt förmåga att instruera under kursen. Max tre examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs AK4 del 1.",
        "Instruktörskurs säkerhet skjutbana.",
        "Egen brukarutbildning på pansarskott m/86.",
        "Godkänt registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutreglemente pansarskott m/86",
        "Manual pansarskott m/86",
        "Lokala bestämmelser"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola utan vid utbildningsgrupp eller frivilligorganisation.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205258"
    },
    {
      "id": "instruktörskurs-pistol-88",
      "name": "Instruktörskurs Pistol 88",
      "shortName": "IKP88",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111558",
      "description": "Grundläggande skjutinstruktörsutbildning för pistol 88 med fokus på att instruera och utveckla skyttar inom Hemvärnet. Kursen omfattar teori och praktik i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för blivande skjutinstruktörer pistol 88 inom Hemvärnet.",
      "syllabus": "Säkerhetsbestämmelser, vapenhantering, skjutteknik, pedagogik för instruktörer, praktiska övningar och skjutförmåga.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för pistol 88 inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande skjututbildning med pistol 88 enligt gällande reglementen.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för pistol 88 med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala regler för skjutbana.",
        "Använda riskhantering före, under och efter skjutövningar.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Planera och genomföra skjutövningar med stöd av övningsledare."
      ],
      "examination": "Löpande bedömning av personlig färdighet och skjutförmåga genom praktiska moment och uppslagsprov enligt säkerhetsbestämmelser. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Brukarutbildning och eget kompetensprov med pistol 88.",
        "Godkänt registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutr FM grunder 2011",
        "Manual Pistol 88",
        "Skjutr FM öft pistol",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HVSS). Organisationsenheten förordnar och ordersätter godkänd elev med giltighet upp till 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 18 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205315"
    },
    {
      "id": "instruktörskurs-psg90-alt-ak4b-med-kikarsikte",
      "name": "Instruktörskurs Psg90 alt. AK4B med kikarsikte",
      "shortName": "IKPSG",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111560",
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för AK4 eller PSG90 med kikarsikte enligt gällande skjutreglemente. Fokus ligger på förmågan att instruera och utveckla soldater som skyttar inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng eller på skjutbana.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör för AK4 eller PSG90 inom Hemvärnet.",
      "syllabus": "Teoretiska föreläsningar och praktiska moment i skjutteknik, vapenhantering, säkerhetsbestämmelser och pedagogik. Kursen innehåller även övningar i trupputbildning där kursdeltagaren tillämpar sina kunskaper som instruktör.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för AK4 eller PSG90 med kikarsikte inom Hemvärnet.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande brukarutbildning i skjutning med AK4 eller PSG90 med kikarsikte på av Försvarsmakten godkända skjutbanor, med stöd av övningsledare.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för AK4/PSG90 med tyngdpunkt på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och lokala bestämmelser för aktuell skjutbana.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Utveckla förmåga att instruera och handleda skyttar inom Hemvärnet."
      ],
      "examination": "Fortlöpande bedömning av personlig färdighet och förmåga att instruera under kursens praktiska moment. Skriftligt uppslagsprov i säkerhet och skjutreglemente. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd Instruktörskurs 1.",
        "Genomförd Instruktörskurs Säkr Skjutbana.",
        "För AK4 med kikarsikte även genomförd Instruktörskurs Skjutr AK4B del 1 med godkänt resultat.",
        "Eget kompetensprov och brukarutbildning på AK4 eller PSG90.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutr FM Grunder 2011",
        "Manual PSG90/AK4",
        "Skjutr FM ÖFT",
        "Lokala bestämmelser för skjutbana/skjutterräng"
      ],
      "additionalInfo": "Kursen ger inte behörighet att utbilda skarpa och/eller prickskyttar. Instruktörsutbildning för skarp/prickskyttetjänst genomförs av Militär Skytte Skola (MSS). Kursen genomförs inte vid Hemvärnets Stridsskola (HVSS).",
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205340"
    },
    {
      "id": "instruktörskurs-rekrytering",
      "name": "Instruktörskurs Rekrytering",
      "shortName": "IKREK",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHGK2019526",
      "description": "Kursen omfattar teoretiska och praktiska moment inomhus och utomhus med fokus på yrkesinformatörsutbildningen, Försvarsmaktens värdegrund och rekryteringsmateriel. Deltagaren får kunskap om vägen in i Försvarsmakten och olika utbildningsinriktningar samt praktisk erfarenhet av att planera och genomföra en rekryteringsaktivitet.",
      "targetAudience": "Blivande utbildare av yrkesinformatörer.",
      "syllabus": "Teoretiska föreläsningar om Försvarsmaktens värdegrund och rekryteringsprocess, praktiska övningar i rekryteringsaktiviteter, tillämpning av rekryteringsmateriel.",
      "purpose": "Att ge deltagaren färdighet att planera, genomföra och utvärdera yrkesinformatörsutbildning samt att leda och planera lokala rekryteringsbefrämjande verksamheter.",
      "primaryLearningObjective": "Efter genomförd utbildning ska deltagaren kunna utbilda yrkesinformatörer och leda rekryteringsinsatser.",
      "secondaryLearningObjectives": [
        "Planera och genomföra rekryteringsaktiviteter.",
        "Tillämpa Försvarsmaktens värdegrund i rekryteringsarbete.",
        "Använda rekryteringsmateriel på ett effektivt sätt."
      ],
      "examination": "Deltagande i samtliga moment är obligatoriskt. Max ett genomförande under kursen.",
      "prerequisites": [],
      "literature": [
        "Framtaget kursmaterial från HVSS samt HRC (fastlagt underlag från HRC för blivande yrkesinformatörer)."
      ],
      "additionalInfo": "Kursen genomförs i samarbete med HRC.",
      "typicalDuration": "5 dagar om totalt 46 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205352"
    },
    {
      "id": "instruktörskurs-skjutr-ak-4bc-del-1",
      "name": "Instruktörskurs SkjutR AK 4B/C del 1",
      "shortName": "IKSR1",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHGK2111565",
      "description": "Kursen omfattar grundläggande skjutinstruktörsutbildning för AK4 enligt skjutreglemente A öft med fokus på att instruera och utveckla soldater som skyttar inom Hemvärnet. Utbildningen genomförs huvudsakligen i skjutterräng/skjutbana och innehåller både teori och praktik.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör AK4 inom Hemvärnet.",
      "syllabus": "Studier av reglementen och handböcker, skjututbildning och skjutinstruktörsspecifik utbildning, praktisk tillämpning i trupputbildningsmoment.",
      "purpose": "Att ge kursdeltagaren erforderlig kompetens att utses till övningsledare vid skjututbildning bas med AK4 och därigenom kunna utbilda och träna personal i skjutteknik enligt gällande reglemente.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande skjututbildning med AK4 inom Hemvärnet.",
      "secondaryLearningObjectives": [
        "Förklara innebörden av sjukvårdsberedskap och tillämpning enligt säkerhetsbestämmelser och aktuell skjutbana.",
        "Förklara konstruktion och tillämpning av riskområden för eldhandvapen.",
        "Förklara vapenverkan av finkalibrig ammunition och skjutbanans uppbyggnad.",
        "Tillämpa centrala och lokala säkerhets- och miljöbestämmelser vid skarpskjutning.",
        "Planera, genomföra och utvärdera skjututbildning för brukare med AK4 enligt gällande skjutreglemente.",
        "Värdera truppens aktuella förmåga, övningens svårighetsgrad och genomföra riskanalys.",
        "Analysera och utveckla skyttars skjutteknik."
      ],
      "examination": "Examination sker genom skriftliga prov och individuella muntliga/skriftliga redovisningar samt bedömning av personlig färdighet och förmåga att tillämpa gällande reglementen. Obligatorisk närvaro krävs. Max 3 examinationstillfällen, varav 2 omexaminationer per provmoment.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Godkänt kompetensprov AK4B/C.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjututbildning 2021",
        "Reglemente skjutning automatkarbin 2021",
        "Handbok skjututbildning automatkarbin 2021",
        "Reglemente verksamhetssäkerhet (SÄKR)",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 25 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205417"
    },
    {
      "id": "instruktörskurs-skjutr-ak-4bc-del-2",
      "name": "Instruktörskurs SkjutR AK 4B/C del 2",
      "shortName": "IKSR2",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111566",
      "description": "Kursen omfattar fortsatt skjutinstruktörsutbildning för AK4 med fokus på att utveckla förmågan att instruera och leda soldater i skjutteknik med AK4 inom Hemvärnet. Utbildningen varvar teori och praktik och genomförs huvudsakligen i skjutterräng/skjutbana.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör AK4 inom Hemvärnet.",
      "syllabus": "Fördjupning i skjutteknik, säkerhetsbestämmelser, pedagogik för skjututbildning, praktisk instruktion och ledning av skjutövningar med AK4 enligt gällande reglementen.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för AK4 inom Hemvärnet som kan planera, genomföra och utvärdera skjututbildning med AK4.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, leda och utvärdera skjututbildning med AK4 inom Hemvärnet som skjutinstruktör.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa gällande skjutreglementen och säkerhetsbestämmelser för AK4.",
        "Kunna använda pedagogiska metoder för att instruera och utveckla skyttar i skjutteknik.",
        "Genomföra praktiska skjutövningar med AK4 och bedöma skyttars färdigheter.",
        "Tillämpa riskhantering och säkerhetsrutiner vid skjutövningar.",
        "Använda biträde och säkerhetskontrollanter vid skjutövningar."
      ],
      "examination": "Fortlöpande praktiska och teoretiska examinationer under kursen, inklusive skriftligt uppslagsprov och bedömning av personlig färdighet och instruktionsförmåga. Max tre examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs skjutR AK 4B/C del 1 med godkänt resultat.",
        "Genomförd instruktörskurs säkr skjutbana.",
        "Godkänt kompetensprov AK4B/C.",
        "Registerkontroll enligt gällande bestämmelser."
      ],
      "literature": [
        "Reglemente skjututbildning 2021",
        "Skjutreglemente FM grunder 2011",
        "Skjutreglemente FM kompetensprov AK4 HV",
        "Handbok skjututbildning automatkarbin 2021",
        "Manual AK4B",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 25 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205436"
    },
    {
      "id": "instruktörskurs-stabstjänst",
      "name": "Instruktörskurs stabstjänst",
      "shortName": "IKST",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHGK119IN00",
      "description": "Grundläggande kurs i stabsarbetsmetodik för utbildningsofficerare vid utbildningsgrupp. Kursen omfattar organisation, indelning och uppgifter vid hemvärnsbataljonsstab samt hur staben verkar över tid med fokus på instruktörens uppföljning och stöd av stabens arbete. Undervisningen sker genom lärarledda lektioner, seminarier, grupparbeten och en avslutande stabsövning.",
      "targetAudience": "Avsedd för dig som är eller skall placeras som utbildningsbefäl på en utbildningsgrupp. Även öppen för övriga som utbildar stabsmedlemmar och/eller är stabsinstruktör på stabsövningar.",
      "syllabus": "Organisation och uppgifter i bataljonsstab, stabsprocesser, planering under tidspress (PUT), informationshantering, användning av informationssystem IS HV, instruktörens roll i stabsarbete, metodik för uppföljning och stöd.",
      "purpose": "Att ge deltagaren grundläggande färdighet att utbilda och öva bataljonsstab samt verka som instruktör vid grundkurs stabstjänst.",
      "primaryLearningObjective": "Efter genomförd kurs kunna verka som instruktör vid grundkurs stabstjänst och stödja stabens arbete.",
      "secondaryLearningObjectives": [
        "Kunna verka som stabstjänstinstruktör vid exempelvis kompanichefsövningar, ledningsträningsövningar och bataljonsförbandets övningar.",
        "Förklara och tillämpa planeringsmetodiken planering under tidspress (PUT) i stabens verksamhet.",
        "Beskriva hur information sprids, klassificeras, fördelas och handläggs inom staben.",
        "Använda informationssystem IS HV vid planering, genomförande och uppföljning av uppgifter.",
        "Genomföra och följa upp en stabsövning med fokus på stabens organisation och arbetsmetodik."
      ],
      "examination": "Praktiskt lärande examination genomförs i slutet av kursen i form av en stabsövning. Aktivt deltagande krävs för godkännande.",
      "prerequisites": [
        "Behörighet som brukare av informationssystem IS HV."
      ],
      "literature": [
        "Metodhandbok ledning bataljon 2007",
        "AH Ledning 2016",
        "Handbok stabstjänst 2016",
        "Handbok samband expeditionstjänst 2020",
        "Handbok utbildningsmetodik 2013",
        "Handbok hemvärnsbataljon (remissutgåva)"
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205504"
    },
    {
      "id": "instruktörskurs-säkr-avlyst-terräng",
      "name": "Instruktörskurs SäkR avlyst terräng",
      "shortName": "IKSRAT",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111564",
      "description": "Kursen omfattar grundläggande skjutinstruktörs brukarutbildning med finkaliber i avlyst terräng med riskområde. Undervisningen sker huvudsakligen i lektionssal med inslag av praktik.",
      "targetAudience": "Avsedd för dig som blivande skjutinstruktör finkaliber inom hemvärnet i avlyst terräng.",
      "syllabus": "Säkerhetsbestämmelser och riskhantering för skjutövningar i avlyst terräng, planering och genomförande av skjutövningar med finkaliber, användning av biträde och säkerhetskontrollant, tillämpning av lokala bestämmelser för skjutterräng.",
      "purpose": "Att kursdeltagaren skall kunna planera, genomföra och utvärdera grundläggande skjututbildning med finkaliber i avlyst terräng med stöd av övningsledare.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna leda skjutövningar med finkaliber i avlyst terräng enligt gällande säkerhetsbestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsregler och riskområden för lokal skjutterräng.",
        "Kunna använda riskhantering före, under och efter skjutövning.",
        "Kunna strukturera och dokumentera övningar i skriftligt planeringsmaterial.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Tillämpa lokala bestämmelser och säkerhetsföreskrifter vid skjutövningar."
      ],
      "examination": "Fortlöpande bedömning av personlig förmåga att omsätta och tillämpa säkerhetsbestämmelser i terräng. Skriftligt uppslagsprov i säkerhet. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs säkr skjutbana.",
        "Genomförd instruktörskurs för aktuellt vapen med godkänt resultat.",
        "Eget brukarutbildning och kompetensprov för aktuellt vapen.",
        "God fysisk status och gott omdöme."
      ],
      "literature": [
        "Säkr",
        "Riskhantering",
        "Manual för respektive vapen",
        "Lokala bestämmelser för skjutterräng",
        "Pedagogiska grunder"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205519"
    },
    {
      "id": "instruktörskurs-säkr-skjutbana",
      "name": "Instruktörskurs SäkR skjutbana",
      "shortName": "IKSRSB",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2111563",
      "description": "Kursen omfattar fortsatt grundläggande skjutsäkerhetsutbildning för finkaliber och pedagogik på skjutbana. Den genomförs huvudsakligen på skjutbana eller fast skjutplats/skjutfält och kan anpassas för specifika vapen. Kursen syftar till att utbilda skjutinstruktörer för skjutbana med finkalibriga vapen inom Hemvärnet.",
      "targetAudience": "Avsedd för dig som är blivande skjutinstruktör på skjutbana med finkalibriga vapen inom Hemvärnet.",
      "syllabus": "Säkerhetsbestämmelser och miljöregler för skjutbana, pedagogik för övningsledning, tillämpning av SäkR och lokala bestämmelser, riskhantering före, under och efter övning, planering och genomförande av skjutövningar, användning av biträde och säkerhetskontrollant vid skjutövningar.",
      "purpose": "Att utbilda och säkerställa behöriga skjutinstruktörer för finkalibriga vapen på skjutbana inom Hemvärnet, med fokus på säkerhet och pedagogik.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande skjututbildning med finkalibriga vapen på skjutbana enligt gällande säkerhetsbestämmelser och reglementen.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser och miljöregler för skjutbana.",
        "Kunna använda och tillämpa lokala bestämmelser för aktuell skjutbana/skjutfält.",
        "Genomföra riskhantering före, under och efter skjutövningar.",
        "Planera och strukturera skjutövningar med tydliga mål, krav och syfte.",
        "Använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Tillämpa pedagogiska grunder för övningsledning på skjutbana."
      ],
      "examination": "Fortlöpande bedömning av personligt omdöme och föregångsmannaskap under kursen. Skriftligt uppslagsprov i säkerhet vid skjutning på skjutbana samt prov på lokala bestämmelser. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Eget godkänt kompetensprov med aktuellt vapen.",
        "God fysisk status och gott omdöme.",
        "Registerkontroll genomförd enligt organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Reglemente skjututbildning 2021",
        "Reglemente skjutning automatkarbin 2021",
        "Handbok skjututbildning automatkarbin 2021",
        "Reglemente verksamhetssäkerhet (SäkR)",
        "Lokala bestämmelser för skjutbana/skjutfält"
      ],
      "additionalInfo": "Organisationsenheten förordnar och ordersätter godkänd elev med giltighet om högst 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning i lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 18 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205547"
    },
    {
      "id": "instruktörskurs-tårgas",
      "name": "Instruktörskurs Tårgas",
      "shortName": "IKTG",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2119502",
      "description": "Kursen omfattar grundläggande utbildning för hantering av tårgas. Utbildningen genomförs huvudsakligen i lektionssal med inslag av praktik.",
      "targetAudience": "Avsedd för dig som är blivande instruktör med tårgasbehörighet inom Hemvärnet.",
      "syllabus": "Teoretiska moment om säkerhetsbestämmelser och riskhantering kopplat till tårgas. Praktiska moment med täthetskontroller och hantering av tårgas enligt gällande manual och ammunitionsföreskrifter.",
      "purpose": "Att ge kursdeltagaren kompetens att planera, genomföra och utvärdera täthetskontroller med tårgas enligt säkerhetsbestämmelser med stöd av övningsledare.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera grundläggande täthetskontroller med tårgas.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser (säkr) avseende tårgas.",
        "Använda riskhantering före, under och efter övning.",
        "Strukturera övningar i skriftlig övningsplan (PM).",
        "Hantera tårgas enligt gällande manual och ammunitionsföreskrifter."
      ],
      "examination": "Fortlöpande bedömning av personlig förmåga att omsätta säkerhetsbestämmelser för tårgas. Skriftligt uppslagsprov i säkerhet. Max 3 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs 1 med godkänt resultat.",
        "Godkänt omdöme och gott omdöme samt personlig lämplighet.",
        "Registerkontroll genomförd enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Riskhantering",
        "Manual Tårgas",
        "Lokala bestämmelser",
        "Pedagogiska grunder"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HvSS). Organisationsenheten förordnar och ordersätter godkänd elev med giltighet upp till 5 år. Vid verksamhet utanför egen organisationsenhet krävs utbildning på lokala instruktioner.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205557"
    },
    {
      "id": "instruktörskurs-grundkurs-övningsledare-strisim-pc",
      "name": "Instruktörskurs grundkurs övningsledare Strisim PC",
      "shortName": "GKÖLSPC",
      "category": "Instruktörsutbildningar",
      "courseCode": "MARGK510ÖSSP",
      "description": "Kursen omfattar teoretiska och praktiska moment för att utbilda övningsledare i Strisim PC. Deltagaren lär sig säkerhetsbestämmelser, materielkunskap, IT- och tillträdessäkerhet, samt planering, genomförande och utvärdering av stridsutbildning med stöd av Strisim PC.",
      "targetAudience": "Civil och militär personal inom Försvarsmakten som ska utbilda och öva med brukare i Strisim PC. För Hemvärnet krävs instruktörskurs 1 och god kännedom om hemvärnets stridsteknik på bevaknings- och insatskompani.",
      "syllabus": "Säkerhetsbestämmelser och materielkunskap för Strisim PC och programvaror. IT- och tillträdessäkerhet. Hantering av skydd mot skadlig kod. Planering, genomförande och utvärdering av stridsutbildning och övningar med Strisim PC. Rutiner för rapportering av fel och brister i system och programvara.",
      "purpose": "Att tillgodose Försvarsmaktens behov av övningsledare i Strisim PC.",
      "primaryLearningObjective": "Efter kursen kunna planera, genomföra och utvärdera enklare övningar i Strisim PC samt hantera systemets och programvarans brukarfunktioner.",
      "secondaryLearningObjectives": [
        "Starta och använda aktuella programvaror.",
        "Anpassa inställningar och skapa grundläggande scenarion i VBS.",
        "Lämna underlag till systemoperatör för större eller avancerade scenarion.",
        "Använda grundläggande funktioner i real time editor (RTE)/VBS under övning.",
        "Använda grundläggande funktioner i utvärderingsverktyget (AAR).",
        "Rapportera fel och brister i programvara och system."
      ],
      "examination": "Kursen examineras genom skriftliga och praktiska prov. Betyg ges i tvågradig skala: godkänd (G) eller icke godkänd (IG). Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Erforderlig kompetens att leda stridsutbildning eller annan utbildning och övning i verksamhet som bedrivs med stöd av Strisim PC.",
        "Instruktörskurs 1 inom Hemvärnet.",
        "God kännedom om hemvärnets stridsteknik på bevaknings- och insatskompani."
      ],
      "literature": [
        "Instruktionsbok Strisim PC",
        "Övningshäfte Strisim PC GK"
      ],
      "additionalInfo": "Antalet elevplatser kan variera beroende på vilken Strisim PC-anläggning som används.",
      "typicalDuration": "2 dagar om totalt 16 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205617"
    },
    {
      "id": "instruktörskurs-fortsättningskurs-övningsledare-strisim-pc",
      "name": "Instruktörskurs fortsättningskurs övningsledare Strisim PC",
      "shortName": "FKÖLSPC",
      "category": "Instruktörsutbildningar",
      "courseCode": "MARFK510ÖSSP",
      "description": "Kursen är en fortsättningsutbildning för övningsledare i stridssimuleringsprogrammet Strisim PC (VBS). Den omfattar fördjupad materielkunskap, säkerhetsbestämmelser, IT- och tillträdessäkerhet samt hantering av skydd mot skadlig kod. Kursen tränar planering, genomförande och utvärdering av stridsutbildning och andra övningar med stöd av Strisim PC, inklusive rutiner för rapportering av fel och brister i system eller programvara.",
      "targetAudience": "Civil och militär personal inom Försvarsmakten som ska utbilda och öva med brukare i Strisim PC och som genomgått grundkurs övningsledare Strisim PC.",
      "syllabus": "Säkerhetsbestämmelser och materielkunskap för Strisim PC och programvaror, IT- och tillträdessäkerhet, skydd mot skadlig kod, planering, genomförande och utvärdering av stridsutbildning med Strisim PC, rapporteringsrutiner för system- och programvarufel.",
      "purpose": "Att tillgodose Försvarsmaktens behov av kompetenta övningsledare i Strisim PC med förmåga att planera, genomföra och utvärdera avancerade övningar.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna planera, genomföra och utvärdera avancerade övningar i Strisim PC samt använda avancerade funktioner i programvaran.",
      "secondaryLearningObjectives": [
        "Använda säkerhetsbestämmelser och materielkunskap för Strisim PC och programvaror.",
        "Tillämpa IT- och tillträdessäkerhet samt hantering av skydd mot skadlig kod.",
        "Planera och genomföra stridsutbildning och andra övningar med stöd av Strisim PC.",
        "Använda avancerade funktioner i real time editor (RTE)/VBS och utvärderingsverktyget (AAR).",
        "Skapa avancerade scenarion och enklare skriptfunktioner i VBS.",
        "Stödja systemoperatören vid utbildning av instruktörer.",
        "Rapportera fel och brister i system och programvara."
      ],
      "examination": "Kursen examineras genom skriftliga och praktiska prov med tvågradig betygsskala (godkänd/icke godkänd). Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd grundkurs övningsledare Strisim PC.",
        "Erforderlig kompetens att leda stridsutbildning eller annan utbildning och övning i verksamhet med stöd av Strisim PC.",
        "För Hemvärnet: instruktörskurs 1 samt god insikt i Hemvärnets stridsteknik på bevaknings- och insatskompani."
      ],
      "literature": [
        "Instruktionsbok Strisim PC",
        "Övningshäfte Strisim PC FK"
      ],
      "additionalInfo": "Antalet elevplatser kan variera beroende på vilken Strisim PC-anläggning som används.",
      "typicalDuration": "2,5 dagar om totalt 20 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205639"
    },
    {
      "id": "halvar-huvudinstruktörskurs",
      "name": "HALVAR Huvudinstruktörskurs",
      "shortName": "HALVARHIK",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHFÖ2011558",
      "description": "Kursen omfattar upprättande och användande av skyddsvaktsträningsanläggning HALVAR i dagsljus och mörker på skjutbana respektive i avlyst terräng vid utbildning av poster och skyddsvakter. Utbildningen fokuserar på materielkunskap, drift och praktiska övningar i skyddsvaktsträningsanläggningen. Elever ur kursen fungerar som biträdande lärare/instruktörer vid samtidiga HALVAR-instruktörskurser.",
      "targetAudience": "Avsedd för dig som är halvar-instruktör och ska bli huvudinstruktör för skyddsvaktsträningsanläggning HALVAR.",
      "syllabus": "Upprättande och drift av skyddsvaktsträningsanläggning HALVAR, tillämpning av säkerhetsbestämmelser (SÄKR) och HVSS bestämmelser, praktiska övningar som figurantchef och halvar-instruktör (skjutledare), teoretiskt prov i HVSS bestämmelser för HALVAR.",
      "purpose": "Att som huvudinstruktör kunna säkerhetsmässigt upprätta och driva skyddsvaktsträningsanläggning HALVAR enligt gällande bestämmelser och därmed kunna genomföra riktad utbildning i post- och skyddsvaktstjänst.",
      "primaryLearningObjective": "Efter kursen kunna tillämpa gällande bestämmelser och upprätta samt genomföra övningar i skyddsvaktsträningsanläggningen HALVAR.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa och förklara SÄKR samt lokala bestämmelser på skjutbana och avlyst terräng.",
        "Kunna förklara och tillämpa HVSS bestämmelser.",
        "Förbereda, genomföra och utvärdera utbildning i post- och skyddsvaktstjänst med stöd av gällande lagar och förordningar.",
        "Kunna agera som figurantchef och skjutledare vid utbildning av poster och skyddsvakter.",
        "Tillämpa säkerhetsrutiner vid upprättande av skjuttält enligt SÄKR och lokala bestämmelser."
      ],
      "examination": "Praktiska lärande examinationer avseende materielkunskap, upprättande och drift av anläggningen samt teoretiskt prov i HVSS bestämmelser för HALVAR. Eleven utvärderas fortlöpande under kursen med muntlig feedback från lärare och kurskamrater. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Agerat som halvar-instruktör under minst ett år.",
        "Förordnad av utbildningsgrupp."
      ],
      "literature": "SÄKR, HVSS bestämmelser för HALVAR 2013-03-23, HVSS scenarion för HALVAR 2012-03-05.",
      "additionalInfo": "Efter godkänd kurs förordnas eleven av HVSS till huvudinstruktör i fem år. Kursen omfattar cirka 45 timmar, varav huvuddelen är praktisk utbildning på övningsplats.",
      "typicalDuration": "5 dagar om totalt 45 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205702"
    },
    {
      "id": "halvar-instruktörskurs",
      "name": "HALVAR Instruktörskurs",
      "shortName": "HALVARIK",
      "category": "Instruktörsutbildningar",
      "courseCode": "MAHGK2011557",
      "description": "Kursen omfattar upprättande och användande av skyddsvaktsträningsanläggning HALVAR i dagsljus och mörker på skjutbana och i avlyst terräng vid utbildning av poster och skyddsvakter. Kursen innehåller praktisk utbildning i skyddsvaktsträningsanläggningen med fokus på skjutledarrollen och figurantchefens uppgifter.",
      "targetAudience": "Avsedd för dig som skall bli HALVAR-instruktör (skjutledare) i skyddsvaktsträningsanläggningen.",
      "syllabus": "Praktisk utbildning i upprättande och drift av skyddsvaktsträningsanläggningen HALVAR, skjutledarrollen, figurantchefens uppgifter, säkerhetsbestämmelser enligt Säkr och HVSS bestämmelser, teoretiskt prov i HVSS bestämmelser för HALVAR.",
      "purpose": "Att som HALVAR-instruktör kunna agera som figurantchef och skjutledare samt stödja huvudinstruktören i upprättande och drift av skyddsvaktsträningsanläggning HALVAR enligt gällande bestämmelser.",
      "primaryLearningObjective": "Efter kursen kunna agera som figurantchef och/eller skjutledare vid utbildning av poster och skyddsvakter i skyddsvaktsträningsanläggning HALVAR.",
      "secondaryLearningObjectives": [
        "Förbereda, genomföra och utvärdera utbildning i post- och/eller skyddsvaktstjänst med stöd av gällande lagar, förordningar och manual för aktuellt eldhandvapen enligt huvudinstruktörens bestämmelser.",
        "Kunna förklara och tillämpa scenarion med stöd av figuranter enligt huvudinstruktörens bestämmelser.",
        "Tillämpa Säkr samt lokala bestämmelser vid upprättande av skjuttält och skyddsvaktsträningsanläggning."
      ],
      "examination": "Praktiskt lärande examinationer i form av upprättande och drift av skyddsvaktsträningsanläggningen som figurantchef och HALVAR-instruktör (skjutledare). Teoretiskt prov i HVSS bestämmelser för HALVAR. Eleven bedöms fortlöpande under kursen med muntlig feedback. Max 2 examinationstillfällen.",
      "prerequisites": [
        "Skjutinstruktör AK4B/C.",
        "Skyddsvakt.",
        "Skyddsvaktsinstruktör.",
        "Giltigt kompetensprov vapen."
      ],
      "literature": [
        "Säkr",
        "HVSS bestämmelser för HALVAR 2013-03-23, 19170:50054",
        "HVSS scenarion för HALVAR 2012-03-05, 19170:50028",
        "Manual för aktuellt eldhandvapen"
      ],
      "additionalInfo": "Efter godkänd kurs förordnas eleven av HVSS som HALVAR-instruktör i fem år.",
      "typicalDuration": "5 dagar om totalt 45 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205717"
    },
    {
      "id": "anställda-vid-mr-grupp",
      "name": "Anställda vid MR-grupp",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2011301",
      "description": "Kursen omfattar hemvärnets utbildningsorganisation, administrativa bestämmelser, försäkringar, handbok hemvärnet (hvh) och medinflytande. Utbildningen genomförs i form av lärarledda lektioner, grupparbeten och ett applikatoriskt exempel.",
      "targetAudience": "Anställd personal på MR-grupp eller vid HVSS.",
      "syllabus": "Hemvärnets utbildningsorganisation, administrativa bestämmelser, försäkringar, handbok hemvärnet (hvh), medinflytande samt applikatoriskt exempel.",
      "purpose": "Efter genomförd kurs kunna förklara och använda gällande bestämmelser vid arbete med hemvärns- och frivilligorganisationer.",
      "primaryLearningObjective": "Kunna använda och tillämpa gällande bestämmelser för hemvärnet och frivilligorganisationer i sitt dagliga arbete på en MR-grupp eller HVSS.",
      "secondaryLearningObjectives": [
        "Använda handböcker och övriga handlingar som styr verksamheten i hemvärnet och frivilligorganisationer.",
        "Beskriva hemvärnets och frivilligorganisationers verksamhet samt deras förankring i samhället."
      ],
      "examination": "Eleven prövas under det lärande applikatoriska exemplet, i form av uppslagsfrågor kopplat till HVH och H Friv kapitel 7.",
      "prerequisites": [
        "Bör ha tjänstgjort minst sex månader vid MR-grupp eller vid HVSS."
      ],
      "literature": [
        "HVH",
        "H Friv kapitel 7",
        "KFS"
      ],
      "additionalInfo": "Kursen kan genomföras som distansutbildning. I kursanmälan skall befattning på MR-grupp respektive stab samt anställningstid framgå. Denna kurs bör kompletteras med en lokalt anordnad introduktionskurs.",
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205730"
    },
    {
      "id": "fredsadministrativkurs",
      "name": "Fredsadministrativkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK119FU01",
      "description": "Kursen ger kunskap och förståelse för de administrativa delar som en chef inom hemvärnet behöver hantera i fredstid. Fokus ligger på chefens ansvar avseende arbetsmiljö, medinflytande, säkerhetstjänst, personalfrågor samt utbildnings- och befordringssystem.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som bataljonschef, ställföreträdande bataljonschef, stabschef, chef eller ställföreträdande chef för hemvärnskompani, hemvärnsundkompani, båtkompani samt kvartermästare.",
      "syllabus": "Administrativa uppgifter för chef i fredstid, försvarsmaktens värdegrund, arbetsmiljöansvar, medinflytande och genomförande av stämma, säkerhetstjänst i fred, verksamhetssäkerhet vid övningar och skarpa uppgifter, personaladministration inklusive avtalstider, personalutvecklingsplaner, uppsägning och avveckling, försäkringar, utbildningssystem, kurser och befordringskrav.",
      "purpose": "Att deltagaren ska förstå och kunna hantera de administrativa uppgifter och ansvar som följer med chefsrollen inom hemvärnet i fredstid.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha förståelse för chefens administrativa ansvar och kunna tillämpa gällande bestämmelser i fredstid.",
      "secondaryLearningObjectives": [
        "Förstå försvarsmaktens värdegrund och dess betydelse för chefsrollen.",
        "Känna till arbetsmiljöansvar och medinflytandets innebörd samt hur en stämma genomförs.",
        "Förstå säkerhetstjänst i fred och verksamhetssäkerhet vid övningar och skarpa uppgifter.",
        "Ha kunskap om personaladministration, inklusive avtalstider, personalutvecklingsplaner och försäkringar.",
        "Känna till utbildningssystemet inom hemvärnet, kurser och befordringskrav."
      ],
      "examination": "Genom diskussioner, muntliga och skriftliga redovisningar bedöms deltagarens förståelse och förmåga att tillämpa kursens innehåll.",
      "prerequisites": [
        "Deltagaren ska vara eller planeras att placeras i relevant chefsbefattning inom ett år."
      ],
      "literature": [
        "Handbok Hemvärn (HVH)"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 33 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205739"
    },
    {
      "id": "fordon-förare-pb8",
      "name": "Fordon Förare PB8",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK5111102",
      "description": "Kursen är en kombination av teori och praktik och omfattar säkerhetsbestämmelser, civila och militära trafikbestämmelser, militär riskhantering, fordonets uppbyggnad samt körteknik på barmark, i mörker och dager. Kursen inkluderar även materielvård enligt FM bestämmelser, bogsering och transport av farligt gods (1000 poäng).",
      "targetAudience": "Hemvärnssoldater som skall placeras som förare PB 8/5.",
      "syllabus": "Säkerhetsbestämmelser, civila och militära trafikbestämmelser, militär riskhantering, fordonets uppbyggnad, körteknik på barmark, i mörker och dager, materielvård, bogsering, transport av farligt gods.",
      "purpose": "Att kursdeltagaren efter genomförd utbildning ska kunna bruka, vårda och framföra PB8 samt tillämpa civila lagar och militära regler som påverkar fordonstjänsten.",
      "primaryLearningObjective": "Efter kursen kunna framföra FM-standardfordon (personbil, minibuss) samt inneha förarbevis.",
      "secondaryLearningObjectives": [
        "Använda civila lagar och militära regler och föreskrifter som påverkar fordonstjänsten.",
        "Använda undantag och särbestämmelser för Försvarsmaktens förare.",
        "Beskriva olika funktioner utifrån de system som används av fordonstypen med tillhörande utrustning.",
        "Tillämpa körning av fordonet på ett trafiksäkert sätt på väg och genomföra godkänd halkkörning.",
        "Framföra fordonet i dager och mörker samt med tillhörande släpkärra.",
        "Genomföra åtgärder före, under och efter körning samt vård av fordon och utrustning."
      ],
      "examination": "Examination omfattar teoretiska prov på lärandemålen, praktisk körning som bedöms under kursen inklusive uppkörning, samt ett praktiskt slutprov på materielkunskap och vård enligt bestämmelser.",
      "prerequisites": [
        "Genomfört grundutbildning (GU).",
        "Inneha giltigt körkort klass B."
      ],
      "literature": [
        "Instruktionsbok PB8 (Sprinter 5t)",
        "FM Trafikteori",
        "Säkr Trafik",
        "Soldr Motor Körning och Vård",
        "Handbok Fordonstjänst 2017"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HVSS).",
      "typicalDuration": "10 dagar om totalt 100 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205804"
    },
    {
      "id": "halvar-figurantkurs",
      "name": "HALVAR Figurantkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ2011560",
      "description": "Kursen omfattar figurantutbildning i flera fastställda scenarion för träning av soldater i post- och/eller skyddsvaktstjänst i skyddsvaktsträningsanläggning HALVAR. Utbildningen är huvudsakligen praktisk och bedrivs på övningsplats under cirka 20 timmar.",
      "targetAudience": "Avsedd för dig som skall tjänstgöra som figurant vid övning i skyddsvaktsträningsanläggning HALVAR.",
      "syllabus": "Praktisk träning i olika scenarion enligt fastställd plan med fokus på inlevelse, förståelse och anpassningsförmåga. Biträde vid upprättande och brytande av skyddsvaktsträningsanläggning HALVAR ingår.",
      "purpose": "Att deltagaren skall kunna agera enligt fastställda scenarion för att ge poster och skyddsvakter realistisk träning.",
      "primaryLearningObjective": "Efter kursen kunna självständigt agera i olika roller och situationer för att skapa en realistisk miljö för övade poster och skyddsvakter.",
      "secondaryLearningObjectives": [
        "Relatera och förutse en skyddsvakts befogenheter och agerande utifrån figurantens agerande.",
        "Förstå och förklara utbildningsmetodiken samt rutiner för debriefing vid träning i skyddsvaktsträningsanläggning HALVAR.",
        "Biträda vid upprättande och brytande av skyddsvaktsträningsanläggning HALVAR."
      ],
      "examination": "Praktisk examination genomförs via flera scenarion enligt fastställd plan med bedömning av inlevelse, förståelse och anpassningsförmåga.",
      "prerequisites": [
        "Skyddsvaktsutbildad."
      ],
      "literature": [
        "HVSS scenarion för HALVAR 2012-03-05, 19170:50028",
        "HVSS bestämmelser för HALVAR 2013-03-23, 19170:50054"
      ],
      "additionalInfo": "Efter godkänd kurs förordnas deltagaren som figurant i skyddsvaktsträningsanläggning HALVAR i fem år. Kursen genomförs inte vid HVSS.",
      "typicalDuration": "3 dagar om totalt 25 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205819"
    },
    {
      "id": "hemvärns-personnel-recovery-officerskurs-(hv-pr-o)",
      "name": "Hemvärns Personnel Recovery Officerskurs (Hv PR-O)",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAÖGK043P007",
      "description": "Kursen syftar till att utbilda personal för tjänstgöring som stabsmedlem i personnel recovery (PR) befattning vid hemvärnsstab. Deltagaren ska efter kursen kunna verka som PR officer på bataljonsnivå eller vid skvadron/kompani och stödja chef i genomförande- och uppföljningsfasen av PR-systemet för undsättning och återförande av isolerad personal (ISOP).",
      "targetAudience": "Avsedd för personal med grad OR-6 eller högre, godkänd enligt FM:s fysiska grund- och tilläggskrav, som ska tjänstgöra som PR officer i hemvärnet.",
      "syllabus": "Kursen omfattar planering och integrering av PR i operationsplanering, förståelse för operation order (OPORD) och PR standard operating procedures (SOP), funktioner och ansvar inom PR-systemet, rapportering, lokalisering, understöd, kommunikation, underrättelsetjänst, undsättning, reintegrering samt PR debriefing. Undervisningen sker genom lärarledda lektioner, grupparbeten, praktiska övningar och applikatoriska exempel.",
      "purpose": "Att deltagaren ska kunna tjänstgöra som PR officer i hemvärnets stab och stödja undsättning och återförande av isolerad personal.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som stabsmedlem i PR-befattning på taktisk nivå och stödja PR-operationer i hemvärnet.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa operation order (OPORD) och PR SOP i planering och genomförande.",
        "Kunna rapportera och lokalisera isolerad personal enligt gällande mallar och checklistor.",
        "Stödja kommunikation och underrättelsetjänst i PR-operationer.",
        "Genomföra undsättningsinsatser och PR debriefing.",
        "Integrera PR-funktioner i hemvärnsbataljonsstabens verksamhet."
      ],
      "examination": "Fortlöpande examination genom skriftliga prov och grupparbeten under kursens gång. Betyg ges enligt tvågradig skala: godkänd (G) eller icke godkänd (IG).",
      "prerequisites": [
        "Grad OR-6 eller högre.",
        "Godkänd enligt FM:s fysiska grund- och tilläggskrav.",
        "Genomförd grundläggande överlevnadsutbildning (SERE A eller motsvarande).",
        "Genomförd digital förberedande kurs för SERE personnel recovery controller/planner."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "5 dagar, totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205840"
    },
    {
      "id": "informatörwebredaktör-bataljon",
      "name": "Informatör/webredaktör bataljon",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2019501",
      "description": "Kursen riktar sig till blivande eller nuvarande webredaktörer och informationsbefäl i bataljonsstab. Utbildningen omfattar grundläggande kunskaper i försvarsmaktens informationstjänst med fokus på publicering och kommunikation via sociala medier och webben.",
      "targetAudience": "Blivande eller nuvarande webredaktörer och informationsbefäl i bataljonsstab.",
      "syllabus": "Grundläggande principer för försvarsmaktens informationstjänst, sociala medier, publiceringsteknik, bildhantering och nyhetsvärdering. Praktiska övningar i publicering på hemvarnet.se och skapande av artiklar och personporträtt.",
      "purpose": "Att deltagaren ska kunna arbeta självständigt med informationstjänst och publicering på hemvarnet.se inom bataljonsstab.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna publicera och hantera information på hemvarnet.se samt förstå försvarsmaktens riktlinjer för kommunikation.",
      "secondaryLearningObjectives": [
        "Kunna tillämpa grunder i fotografering och bildteknik.",
        "Förstå och tillämpa skrivregler och kommunikativa plattformar.",
        "Känna till lagar, press- och informationsetik samt försvarsmaktens interna bestämmelser.",
        "Förstå nyhetsvärdering och informationsspridning internt och externt."
      ],
      "examination": "Vid kursstart redovisas utskickad hemuppgift. Under kursen genomförs självständigt arbete med personporträtt eller artikel samt gruppuppgift med fotouppgift. Eleven prövas i att självständigt kunna publicera på hemvarnet.se. Max 1 examinationstillfälle.",
      "prerequisites": [],
      "literature": [
        "Försvarsmaktens handbok i sociala medier",
        "Försvarsmaktens riktlinjer för sociala medier",
        "Försvarsmaktens riktlinjer för intern och extern kommunikation",
        "Språkliga riktlinjer för försvarsmakten",
        "Skrivregler för försvarsmakten"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205900"
    },
    {
      "id": "is-hv-super-user",
      "name": "IS Hv Super User",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ7110002",
      "description": "Kursen är en fördjupad utbildning med fokus på driftsättning och systemdrift av informationssystemet IS Hv. Utbildningen genomförs som praktiska övningar kombinerade med teoretiska föreläsningar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som driftstödstekniker eller driftansvarig tekniker för IS Hv.",
      "syllabus": "Driftsättning och underhåll av IS Hv, systemövervakning, felsökning, programvaruhantering, IT-säkerhet, utbildning av IS Hv-instruktörer och tekniker.",
      "purpose": "Att deltagaren ska kunna driftsätta, drifta och vid behov reparera IS Hv-systemet samt utbilda instruktörer och tekniker för att säkerställa systemets funktion och redundans i bataljonen.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som driftstödstekniker på IS Hv och självständigt hantera systemets drift och underhåll.",
      "secondaryLearningObjectives": [
        "Beskriva och tillämpa instruktioner från instruktions- och reparationshandböcker för IS Hv.",
        "Utföra förändringar i driftinställningar och övervaka systemets status.",
        "Återställa system och hantera programvaruarkiv.",
        "Utbilda IS Hv-instruktörer och tekniker för att skapa redundans i bataljonen."
      ],
      "examination": "Avslutas med ett teoretiskt prov. Max ett examinationstillfälle under kursen.",
      "prerequisites": [
        "Teknikerutbildning IS Hv.",
        "God kännedom och erfarenhet av IS Hv."
      ],
      "literature": [
        "Metodhandbok IS Hv 2",
        "Instruktionsbok IS Hv",
        "Reparationshandbok IS Hv"
      ],
      "additionalInfo": "Kursen genomförs av Frivilliga Radioorganisationen.",
      "typicalDuration": "1 dag, totalt 8 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205920"
    },
    {
      "id": "is-hv-teknikerkurs",
      "name": "IS Hv Teknikerkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK7090001",
      "description": "Kursen fördjupar deltagarnas tekniska kunskaper genom praktiska övningar och teoretiska föreläsningar. Den riktar sig till personal placerade på ledningspluton såsom sb/data tekniker, sign/driftledbiträdare.",
      "targetAudience": "Personal placerade på ledningspluton såsom sb/data tekniker, sign/driftledbiträdare.",
      "syllabus": "Teknisk fördjupning i informationssystem hemvärnet (IS Hv) med fokus på drift, underhåll och felsökning. Praktiska övningar kombineras med teoretiska föreläsningar.",
      "purpose": "Möjliggöra drift av IS Hv enligt säkerhetskrav med god tillgänglighet över tid i aktuell miljö, så att nyttjande förband erhåller önskat teknikstöd.",
      "primaryLearningObjective": "Deltagaren ska kunna agera i rollen som driftstödstekniker eller driftansvarig tekniker för IS Hv.",
      "secondaryLearningObjectives": [
        "Förstå IS Hv med tyngdpunkt på Sitaware.",
        "Identifiera och genomföra förändringar i driftinställningar.",
        "Övervaka driftstatus och reagera på felindikationer.",
        "Starta och stoppa enheter samt hantera arkivdisk och skrivare inklusive uppdatering.",
        "Återställa klientdatorer och stödja användare i tekniska frågor.",
        "Ominstallera server och omkonfigurera switchar (för driftansvarig tekniker).",
        "Leda och stödja verksamheten för driftstödstekniker."
      ],
      "examination": "Krav för godkänt är aktivt deltagande under utbildningen samt godkänt resultat på avslutande prov.",
      "prerequisites": [
        "FM AP H/R",
        "TSS Signalskydd Teori 1 (tidigare Sysop T)"
      ],
      "literature": [
        "Instruktionsbok IS Hv",
        "Reparationshandbok IS Hv"
      ],
      "additionalInfo": "Frivilliga Radioorganisationen har uppdraget som frivilligorganisation för kursen.",
      "typicalDuration": "3 dagar om totalt 20 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-205940"
    },
    {
      "id": "krigsförbandsplaneringskurs",
      "name": "Krigsförbandsplaneringskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ2011515",
      "description": "Kursen omfattar taktik och stridsteknik, krigsförbandsvärdering (KFV), mobiliserings-, förbandsutvecklings- (FUP), personalutvecklings- (PUP) och krigsförbandsplanering (KFÖ) samt motståndarutbildning och ledarskapsutbildning. Undervisningen sker genom lärarledda lektioner, grupparbeten, enskilda redovisningar och spel på stridsplaner i terrängen.",
      "targetAudience": "Avsedd för dig som är placerad i befattning som hemvärnsbataljonchef/stf, stabschef, sektionschef i bataljonsstab, kompanichef/stf (hvund, båt och bevakning). Öppen i mån av plats för kvartermästare på kompani samt plutonchef/stf.",
      "syllabus": "Taktik och stridsteknik, krigsförbandsvärdering, mobiliseringsplanering, förbands- och personalutvecklingsplanering, motståndarutbildning, ledarskap.",
      "purpose": "Att ge deltagaren grundläggande förmåga att agera och leda som chef vid eget förband (pluton, kompani, sektion, bataljon) samt förstå hur hemvärnets KFÖ-system och mobilisering påverkar och utvecklar förbandet.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna planera och genomföra krigsförbandsplanering och mobiliseringsplanering samt lösa tilldelade uppgifter inom ramen för hemvärnets krigsorganisation.",
      "secondaryLearningObjectives": [
        "Ge exempel på planering och genomförande av befattnings- och förbands KFÖ samt kompletteringsutbildning inom hemvärnet.",
        "Förklara hur bataljon och kompani förbereder och genomför mobilisering inom hemvärnet.",
        "Utveckla förmågan att använda eget kompani/pluton vid tagande av objekt.",
        "Förstå betydelsen av förbands- och personalutvecklingsplanering.",
        "Förklara hur KFS, beredskapsgrader och typinsatser hänger ihop längs konfliktskalan."
      ],
      "examination": "Praktiskt lärande examinationer där elevens förmåga att lösa tilldelade uppgifter värderas och examineras fortlöpande under kursen med tyngdpunkt på applikatoriska exempel inom KFÖ och mobiliseringsplanering.",
      "prerequisites": [
        "Lägst genomförd plutonchefskurs 1."
      ],
      "literature": [
        "KFS",
        "Handbok HV-kompani/pluton del 1-3",
        "Reglemente mobilisering 2018"
      ],
      "additionalInfo": "Kursen genomförs i Tylebäck i Försvarsutbildarnas regi.",
      "typicalDuration": "6 dagar om totalt 48 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210000"
    },
    {
      "id": "kvartermästarkurs-1",
      "name": "Kvartermästarkurs 1",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2019222",
      "description": "Kursen omfattar grundläggande kvartermästarutbildning med fokus på logistik på kompani/bataljonsnivån. Deltagarna får träna på att från en färdig stridsplan utarbeta punkten 4 uthållighet och genomföra ett helt bedömande fram till färdig stridsplan för att öka förståelsen för framförhållning i processen för egen befattning. Undervisningen sker genom lärarledda lektioner, grupparbeten, redovisningar samt studiebesök hos civila och militära logistiska aktörer.",
      "targetAudience": "Avsedd för dig som är eller skall placeras som bataljonskvartermästare, teknisk chef, underhållsbefäl bataljon/kompani, sjukvårdsbefäl, bataljonsläkare, kompanikvartermästare, chef stab/tross. Öppen i mån av plats för hundbefäl och stabsbefäl kompani.",
      "syllabus": "Logistik på kompani- och bataljonsnivå, planering och utveckling av uthållighet enligt punkten 4 i stridsplan, taktiska nötter med inriktning mot logistik, samordning och samverkan med militära och civila aktörer.",
      "purpose": "Att deltagaren ska få en grundläggande förmåga att agera som kvartermästare på kompani/bataljon och förstå logistiken på denna nivå.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna utveckla punkten 4 i en stridsplan samt leda och samordna logistiken på kompani/bataljon över tid.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara hur logistiken kan och bör ledas och samordnas inom en hemvärnsbataljon och hemvärnskompani.",
        "Använda bedömandemallen (PUT) för att ta fram en stridsplan för kompani/bataljon utifrån högre chefs order.",
        "Förklara behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva hur hemvärnet aktiveras och vilka praktiska åtgärder som ska genomföras vid beredskapshöjningar.",
        "Förklara ledarskapets betydelse i rollen som kvartermästare."
      ],
      "examination": "Praktiskt lärande examinationer där deltagarens redovisning av punkten 4 i bataljons- eller kompaniorder, användande av fem-punktsorder enligt handbok samt agerande i rollen som kvartermästare utvärderas fortlöpande under kursen genom taktiska nötter och spel på stridsplaner i terrängen.",
      "prerequisites": [
        "För kompanikvartermästare: genomförd plutonchefskurs 1."
      ],
      "literature": [
        "KFS",
        "Logistik vid insats",
        "Reglemente mobilisering 2018",
        "Sjuktransportledning",
        "MSR",
        "Handbok bataljon/kompani"
      ],
      "additionalInfo": null,
      "typicalDuration": "10 dagar om totalt 92 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210026"
    },
    {
      "id": "kvartermästarkurs-2",
      "name": "Kvartermästarkurs 2",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFK4109223",
      "description": "Kursen omfattar fortsatt utbildning för kvartermästare med fokus på logistik på kompani- och bataljonsnivå. Deltagarna utarbetar punkten 4 i uthållighet från en färdig stridsplan och genomför ett helt bedömande fram till färdig stridsplan för att öka förståelsen för framförhållning i processen för egen befattning. Utbildningen sker genom lärarledda lektioner, grupparbeten, redovisningar och taktiska nötter med inriktning mot logistik. Kursen genomförs delvis tillsammans med bataljonchefskurs 1 vid applikatoriska moment.",
      "targetAudience": "Avsedd för c s4 och kompanikvartermästare samt öppen för stabschef, teknisk chef, underhållsbefäl bataljon/kompani, sjukvårdsbefäl, bataljonsläkare och chef stab/tross.",
      "syllabus": "Logistikledning och samordning inom hemvärnsbataljon och kompani, tillämpning av bedömandemallen (PUT) vid framtagande av stridsplan, samverkan mellan militära och civila aktörer, aktivering och praktiska åtgärder vid hemvärnsberedskap och hemvärnslarm, ledarskapets betydelse i rollen som kvartermästare.",
      "purpose": "Att öka förmågan att agera som kvartermästare på kompani- och bataljonsnivå med särskilt fokus på logistisk planering och samordning.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna utveckla och delge punkten 4 i en stridsplan samt leda och samordna logistiken över tid på kompani och bataljon.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara logistiken inom hemvärnsbataljon och kompani.",
        "Använda bedömandemallen (PUT) för att ta fram en stridsplan utifrån högre chefs order.",
        "Förklara behovet av samordning och samverkan mellan militära och civila aktörer.",
        "Beskriva aktivering och praktiska åtgärder vid hemvärnsberedskap och hemvärnslarm.",
        "Förklara ledarskapets betydelse i rollen som kvartermästare."
      ],
      "examination": "Praktiskt lärande examinationer där deltagarens redovisning av punkten 4 i bataljons- och kompaniorder, användande av fem-punktsorder enligt handbok samt agerande i rollen som kvartermästare utvärderas fortlöpande under kursen, bland annat genom taktiska nötter med inriktning mot logistik.",
      "prerequisites": [
        "Genomförd kvartermästarkurs 1 (gäller ej stabschef)."
      ],
      "literature": [
        "KFS",
        "Logistik vid insats",
        "Reglemente mobilisering 2018",
        "Sjuktransportledning",
        "MSR",
        "Handbok bataljon/kompani"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210043"
    },
    {
      "id": "marin-hemvärnstaktik",
      "name": "Marin hemvärnstaktik",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2061519",
      "description": "Utbildningen syftar till att öka förmågan att verka i befattning i förband med marina uppgifter. Kursen omfattar ledning, planering och genomförande av marina och kustnära uppgifter såsom båtburen skyddsvakt, ytövervakning, eskort till sjöss, sjötransportledning, ombasering samt flygföretag med hemvärnets flyggrupp. Praktiska moment i stridsledningssignalering och samverkan med andra marina förband och civila myndigheter ingår.",
      "targetAudience": "Personal som är eller ska placeras i befattning i bataljonsledning, kompaniledning, plutonsledning (båtkompani/båtpluton) och stabsbefattningar i marina och kustnära hemvärnsförband, enligt prioritering av militärregionens utbildningsgrupp.",
      "syllabus": "Lärarledda lektioner och grupparbeten, rekognosering, applikatoriska exempel och spel på stridsplaner. Fokus på metodik, uppföljning och beslutsprocess ur perspektivet sensorbefäl och plutonchef.",
      "purpose": "Att deltagaren ska kunna verka i befattning på olika nivåer inom marina och kustnära hemvärnsförband och leda marinspecifika uppgifter enligt gällande författningar och riktlinjer.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna leda, planera och genomföra marina och kustnära uppgifter inom hemvärnet med handledning.",
      "secondaryLearningObjectives": [
        "Leda, planera och genomföra båtburen skyddsvakt.",
        "Leda, planera och genomföra ytövervakning.",
        "Stödja och genomföra eskort till sjöss.",
        "Leda, planera och genomföra sjötransportledning och ombasering.",
        "Leda och planera för flygföretag med hemvärnets flyggrupp.",
        "Genomföra stridsledningssignalering med handledning.",
        "Förstå juridiska förutsättningar och samverkan med andra marina förband och civila myndigheter."
      ],
      "examination": "Praktiska och teoretiska moment inklusive redovisningar, rekognosering och applikatoriska exempel med spel på stridsplaner. Max 1 examinationstillfälle under kursen.",
      "prerequisites": [
        "Crew Resource Management (CRM)",
        "Sjösäkerhetsutbildning",
        "Rakel och RA180"
      ],
      "literature": "Kursmaterial erhålls vid kursstart.",
      "additionalInfo": "Kursen genomförs på Amf 1 i Södertörnsgruppens regi.",
      "typicalDuration": "7 dagar om totalt 64 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210105"
    },
    {
      "id": "nordisk-chefskurs",
      "name": "Nordisk chefskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ2019812",
      "description": "Kursen är ett samarbete mellan Sverige, Norge och Danmark inom ramen för Samskandia-avtalet. Den genomförs årligen i ett av länderna med tolv deltagare från respektive land. Utbildningen är ledarskapsinriktad och behandlar olika ledarskapssituationer samt inkluderar ett applikatoriskt exempel på kompaninivå. Undervisningen sker genom lärarledda lektioner, grupparbeten, framtagande av stridsplaner, ordergivning samt spel på stridsplaner. Deltagarna delas in i grupper med två elever från varje land.",
      "targetAudience": "Avsedd för chefer från bataljonchef till plutonchef/stf med god kunskap om nationell hemvärnsorganisation.",
      "syllabus": "Ledarskapssituationer, ledarskapsmetoder, applikatoriskt exempel på kompaninivå, grupparbete, stridsplanering och ordergivning.",
      "purpose": "Att öka kunskap och förståelse för eget och övriga nordiska länders taktik och stridsteknik inom skydd och bevakning av hamn och flygplats samt att skapa nätverk mellan nationerna.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna hantera olika ledarskapssituationer i bataljon, kompani, sektion eller pluton i freds-, kris- och krigssituationer.",
      "secondaryLearningObjectives": [
        "Genomföra bedömningar och framtagande av stridsplan enligt respektive lands bedömandemodell.",
        "Beskriva och förklara olika ledarstilar, förändringsarbete och konflikthantering.",
        "Förklara respektive lands hemvärnsorganisation och stridstekniska lösningar i en nordisk miljö."
      ],
      "examination": "Uppföljning av redovisade gruppuppgifter samt utbildande examination och spel på stridsplaner. Ett examinationstillfälle under kursen.",
      "prerequisites": [
        "God kunskap om nationell hemvärnsorganisation."
      ],
      "literature": "Tilldelas av respektive land.",
      "additionalInfo": "Kursen genomförs vart tredje år i respektive land med nytt upplägg vart femte år, senast 2019 i Sverige.",
      "typicalDuration": "5 dagar om totalt 50 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210128"
    },
    {
      "id": "scanbal",
      "name": "Scanbal",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHFÖ7120001",
      "description": "Scanbal är en internationell utbildning som genomförs i samarbete mellan Sverige, Norge, Danmark, Estland, Lettland och Litauen. Kursen riktar sig till kompanichefer och plutonchefer och syftar till att öka kunskap och förståelse för taktik och stridsteknik inom skydd och bevakning av hamn och objekt i urban miljö. Utbildningen omfattar lärarledda lektioner, grupparbeten, rekognosering i terräng, framtagande av stridsplaner, ordergivning samt spel på stridsplaner i terräng.",
      "targetAudience": "Rutinerade kompani- och plutonchefer från deltagande länder.",
      "syllabus": "Taktik och stridsteknik för skydd och bevakning av hamn och objekt i urban miljö, samverkan över nationsgränser, framtagande av stridsplaner, ordergivning, rekognosering, spel på stridsplaner.",
      "purpose": "Att öka deltagarnas kunskap och förståelse för taktik och stridsteknik inom ramen för skydd och bevakning samt att skapa nätverk mellan deltagande nationer.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla och leda stridsplanering och genomförande vid skydd och bevakning av hamn och objekt i urban miljö.",
      "secondaryLearningObjectives": [
        "Använda bedömandemallen för att ta fram stridsplan utifrån högre chefs order.",
        "Förklara hur olika funktioner påverkar en stridsplan och behovet av samordning mellan militära och civila aktörer.",
        "Beskriva ledning och samordning av plutoner inom kompaniets strid.",
        "Förstå organisation och verksamhet i respektive lands hemvärn.",
        "Utbyta erfarenheter och skapa nätverk över nationsgränser."
      ],
      "examination": "Bedömning sker genom aktivt deltagande, redovisning av gruppuppgifter samt utbildande examination under kursens gång. Max ett examinationstillfälle.",
      "prerequisites": [
        "Rutinerad kompanichef eller plutonchef.",
        "Engelska enligt STANAG 6001 nivå 2-2-2-2."
      ],
      "literature": "Tilldelas av respektive land inför kursstart.",
      "additionalInfo": null,
      "typicalDuration": "5 dagar, totalt 50 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210143"
    },
    {
      "id": "stabschefskurs",
      "name": "Stabschefskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK119FU03",
      "description": "Kursen är en kurs i stabsarbetsmetodik för stabschefer, vilket omfattar organisation, indelning och uppgifter samt hur en stab verkar över tiden med fokus på stabschefens (sc) roll. Utbildningen genomförs i form av lärarledda lektioner och grupparbeten samt en avslutande stabsövning.",
      "targetAudience": "Avsedd för dig som är placerad, eller skall placeras i befattning som stabschef i bataljonsstab. Även öppen för c s3/5 (tillika stf sc).",
      "syllabus": "Organisation, indelning och uppgifter i bataljonsstab; stabens verksamhet över tid; stabschefens roll och ansvar; metodik och ledarskapsmoment; praktisk stabsövning.",
      "purpose": "Få en grundlagd förmåga att leda bataljonsstab.",
      "primaryLearningObjective": "Ha förståelse för hur ledningspluton, sektioner inom stab, tjänstegrenar och funktioner leds och samordnas.",
      "secondaryLearningObjectives": [
        "Ha grundlagd förståelse för samband- och informationssystem inom bataljonsstab.",
        "Stödja med fortlöpande information, konsekvensanalyser och beslutsunderlag åt bataljonchefen.",
        "Förklara och tillämpa stabsprocesser och gällande lednings- och planeringsmetod (PUT) omfattande planering, genomförande och uppföljning.",
        "Utveckla det indirekta ledarskapet.",
        "Identifiera och förklara stabens ansvar samt konsekvenser av beslut på kort och lång sikt, även ur ett etiskt och moraliskt perspektiv.",
        "Beskriva och tillämpa informationssystem IS HV vid planering, genomförande och uppföljning av tilldelad uppgift."
      ],
      "examination": "Praktiskt lärande examinationer där elevens agerande i rollen som stabschef utvärderas fortlöpande under kursen, genom metodik och ledarskapsmoment. Godkänt deltagande krävs.",
      "prerequisites": [
        "Bataljonsstridskurs (BS).",
        "Grundkurs stabstjänst (GKS).",
        "Kunna hantera och verka i programmet Sitaware HQ (IS HV)."
      ],
      "literature": [
        "Metodhandbok ledning bataljon 2007",
        "AH Ledning 2016",
        "Stabstjänst grunder 2016",
        "Handbok hemvärns-bataljon, kompani",
        "Handbok motståndaren 2016",
        "Arméreglemente taktik 2013",
        "Handbok IKFN"
      ],
      "additionalInfo": "IL och UL är meriterande förkunskaper.",
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210203"
    },
    {
      "id": "grundkurs-stabstjänst",
      "name": "Grundkurs Stabstjänst",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK119FU02",
      "description": "Grundläggande kurs i stabsarbetsmetodik för stabsmedlemmar med fokus på organisation, indelning och uppgifter samt hur staben verkar över tid. Kursen omfattar lektioner, grupparbeten och en avslutande stabsövning.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som kompanichef, bataljonchef, stabsmedlem eller chef/stf ledningspluton.",
      "syllabus": "Organisation och indelning av bataljonsstab, stabsmedlemmens roll, stabsprocesser, planering under tidspress (PUT), informationshantering och användning av informationssystem IS HV (Sitaware HQ).",
      "purpose": "Att ge deltagaren grundläggande förståelse för stabens verksamhet och stabsmedlemmens roll samt förbereda för vidare utbildning på kompani- och bataljonsnivå.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som stabsmedlem inom bataljonsstab och förstå stabens funktion över tid.",
      "secondaryLearningObjectives": [
        "Beskriva organisation, indelning och uppgifter inom bataljonsstab.",
        "Förklara planeringsmetoden planering under tidspress (PUT) och dess tillämpning i stab.",
        "Förstå hur information sprids, klassificeras, fördelas och handläggs inom staben.",
        "Använda informationssystem IS HV (Sitaware HQ) i stabsarbete.",
        "Delta aktivt i stabsövningar och tillämpa stabsarbetsmetodik."
      ],
      "examination": "Praktiskt lärande där deltagaren verkar i sin befattning under en formell stabsövning i slutet av kursen. Godkänt deltagande krävs för godkänt betyg.",
      "prerequisites": [
        "Färdighet i att hantera programmet Sitaware HQ (IS HV)."
      ],
      "literature": [
        "Arméhandbok del 2",
        "Metodhandbok ledning bataljon 2007",
        "Handbok hemvärns-bataljon, kompani",
        "Handbok markstrid – kompani 2016",
        "Handbok motståndaren 2016",
        "Arméreglemente taktik 2013",
        "Handbok IKFN 2016"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 44 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210226"
    },
    {
      "id": "grundkurs-störa",
      "name": "Grundkurs Störa",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK119FU04",
      "description": "Utbildande prestationsövning med fokus på stridsuppgiften störa. Kursen genomförs i fält och innehåller fysiska och psykiska prövningar med successiv stegring. Moment som eldöverfall, överfall, minor och upplagstjänst ingår. Avslutas med en slutövning där deltagarna prövas på inlärda moment.",
      "targetAudience": "Avsedd för grupp- och plutonchefer inom Hemvärnet. Övriga chefer som vill öka sin förståelse eller testa sitt ledarskap kan söka.",
      "syllabus": "Stridsuppgiften störa, eldöverfall, överfall, spaning, upplagstjänst, link up-metoder, fysisk och psykisk uthållighet, ledarskap under påfrestande situationer.",
      "purpose": "Öka Hemvärnets förmåga att lösa stridsuppgiften störa samt öka individens personliga färdighet och uthållighet i fält.",
      "primaryLearningObjective": "Efter kursen ska deltagaren ha kunskap om stridsuppgiften störa och kunna tillämpa den i grupp och pluton samt ha insikt i eget ledarskap under påfrestande förhållanden.",
      "secondaryLearningObjectives": [
        "Planera, leda och genomföra eldöverfall och överfall i grupps ram i dager och mörker.",
        "Planera, leda och genomföra spaning mot objekt och område.",
        "Använda alternativa sambands- och ledningssätt.",
        "Genomföra upplagstjänst och tillämpa link up-metoder."
      ],
      "examination": "Kontinuerlig bedömning av fysisk förmåga och prestationer under kursens moment. Slutövning med godkänt resultat krävs. Max två examinationstillfällen. Kurschef kan avskilja deltagare som ej bedöms lämpliga.",
      "prerequisites": [
        "Värnpliktig (VPL), GMU.",
        "Genomförd grupp- eller plutonchefsutbildning.",
        "Genomförd brukarutbildning AK4.",
        "God fysisk status."
      ],
      "literature": [],
      "additionalInfo": "Deltagaren kan när som helst avbryta kursen på egen begäran.",
      "typicalDuration": "10 dagar om totalt 130 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210248"
    },
    {
      "id": "grundkurs-underrättelsetjänst-hv",
      "name": "Grundkurs Underrättelsetjänst Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "HVT422FFU00",
      "description": "Grundläggande teoretisk och praktisk utbildning i underrättelseprocessen. Kursen är uppdelad i självstudier och lärarledda moment med grupparbeten och applikatoriska övningar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i underrättelsebefattning inom underrättelsekompanistab eller bataljonsstab, samt personal vid s3 och hundbefäl vid kompani. Kursen är även sökbar för bataljonschef, stf bataljonschef, stabschef och kompanichefer.",
      "syllabus": "Underrättelseprocessens teori och praktik, analys av terräng och motståndare, planering och ledning av egen inhämtning, produktion av underrättelseorder och rapporter, kategorisering av information, underrättelseföredragning.",
      "purpose": "Att öka förmågan att verka i nuvarande eller kommande stabsbefattning inom underrättelsetjänst.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna verka som stabsmedlem i underrättelsebefattning och producera underrättelseprodukter som stödjer beslutsfattande.",
      "secondaryLearningObjectives": [
        "Beskriva hur analys av terräng och motståndares organisation påverkar underrättelseprocessen.",
        "Utveckla underrättelsebehov och planera egen inhämtning.",
        "Utforma underrättelseorder och producera underrättelserapporter.",
        "Kategorisera information och genomföra underrättelseföredragning."
      ],
      "examination": "Elevens underrättelseprodukter värderas fortlöpande under kursen.",
      "prerequisites": [
        "Minst genomförd grundutbildning för hemvärnet (gu-f)."
      ],
      "literature": [
        "FM Undr 2010",
        "FM Undh Rapp 2015",
        "Nomen Und 2021",
        "Handbok Undsäktjänst vid hemvärnsförband 2017",
        "Markstridshandbok Motståndaren 2021",
        "Distribuerat lärande: Introduktion underrättelsetjänst (a110714-1, 1.0)"
      ],
      "additionalInfo": "Efter kursen rekommenderas praktisk tillämpning som stabsmedlem i s2-sektionen under stabstjänstövning, kfö eller motsvarande.",
      "typicalDuration": "4 dagar självstudier samt 11 dagar lärarledd utbildning (totalt 144 timmar).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210315"
    },
    {
      "id": "vaktb-kurs",
      "name": "VaktB kurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK0440001",
      "description": "Kursen omfattar 8 timmar och består av teoretiska grunder samt praktiska tillämpningsövningar. Undervisningen varvar teori med praktik och sker både inomhus och utomhus.",
      "targetAudience": "Avsedd för dig som är placerad i x-befattning, eller inte uppfyller kraven för skyddsvakt enligt bestämmelser i FM 2020-8736:1.",
      "syllabus": "Teoretiska och praktiska lektioner med fokus på vapnets användning, nödvärn inklusive skjutprov samt lagstöd i envarsrätt, nödvärnsrätt och rätten att bistå vid tjänsteåtgärd (\"hjälpares rätt\").",
      "purpose": "Att efter godkänd kurs kunna tjänstgöra som vaktpost enligt gällande regelverk.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna tillämpa gällande lagar och bestämmelser inom ramen för posttjänsten.",
      "secondaryLearningObjectives": [
        "Behärska vapnets användning och säker hantering.",
        "Förstå och tillämpa nödvärnsrätt och lagstöd för vakttjänst.",
        "Genomföra skjutprov med eget eldhandvapen.",
        "Tillämpa säkerhetsbestämmelser enligt utbildningspaket skyddsvakt."
      ],
      "examination": "Teoretiskt prov och praktiskt prov med eget eldhandvapen. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GMU, GU eller GU-F.",
        "Genomfört godkänt kompetensprov på eget eldhandvapen."
      ],
      "literature": [
        "Utbildningspaket skyddsvakt i tillämpliga delar.",
        "Skrivelse 2020-8736:1.",
        "Handbok bevakning 2017.",
        "FM UndSäk Skyddsvaktsutb.",
        "FMSS skrivelse 2020-8736:1."
      ],
      "additionalInfo": "Utbildad VaktB-soldat skall omförordnas minst vart femte år med start från och med årsskiftet 2022-01-01. Hemvärnssoldater som tidigare genomfört godkänd skyddsvaktsutbildning har behörighet som vaktpost först efter omförordnande enligt VaktB.",
      "typicalDuration": "1 dag om 8 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210326"
    },
    {
      "id": "stridsledning-sensor-hund-hv",
      "name": "Stridsledning Sensor Hund Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "HVT424L0000",
      "description": "Kursen omfattar utbildning i planering och stridsledning av grupper med hundekipage samt planering med samtliga tillgängliga sensorer. Fokus ligger på metodik, uppföljning och beslutsprocess ur perspektivet sensorbefäl samt plutonchef.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som sensorbefäl, stridsbefäl, plutonchef eller kompanichef.",
      "syllabus": "Planering och stridsledning av enheter med hundekipage och tekniska sensorer, metodik för uppföljning och beslutsfattning, upprättande av sensoroleat, stöd till plutonsstab vid uppgifter med sensorer.",
      "purpose": "Att deltagaren skall kunna leda enheter med hund och tekniska sensorer under tidspress och stödja plutonchef i stridsledning.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna stridsleda enheter med hund och tekniska sensorer samt förstå beslutsprocessen.",
      "secondaryLearningObjectives": [
        "Kunna planera och stödja chef med beslutsunderlag för enheter med hund och tekniska sensorer.",
        "Kunna betjäna plutonsstab vid uppgifter med sensorer.",
        "Kunna med handledning stridsleda pluton med hund under förföljning.",
        "Kunna upprätta sensoroleat."
      ],
      "examination": "Praktiskt lärande examinationer där elevens arbete vid stridsledning av enheter med sensorer utvärderas fortlöpande under kursen med tyngdpunkt på uppföljning och framförhållning. Bedömning sker mot godkänd/icke godkänd-skala vid ämnesexaminationer.",
      "prerequisites": [],
      "literature": [
        "Direktiv patrullhund hemvärn 2021",
        "Utbildningsanvisning stridsteknik sensorer"
      ],
      "additionalInfo": null,
      "typicalDuration": "5 dagar om totalt 46 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210353"
    },
    {
      "id": "säkerhetstjänstkurs-hv",
      "name": "Säkerhetstjänstkurs Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK8100020",
      "description": "Kursen omfattar grundläggande teoretisk och praktisk utbildning i säkerhetstjänst med fokus på ledning, lydnadsförhållanden, hotbild samt tillämpliga regler, handböcker och reglementen. Deltagarna får träna på att utarbeta och delge säkerhetsanalyser och säkerhetsplaner genom föreläsningar, diskussioner, grupparbeten samt praktiska exempel.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som c s2, undbefäl. Kursen är öppen i mån av plats även för bataljonchef/stf, stabschef, kompanichef och plutonchefer för specialplutoner.",
      "syllabus": "Grundläggande faktakunskaper om ledning och lydnadsförhållanden, hotbild, styrande och stödjande regelverk. Praktisk tillämpning av säkerhetsanalys och säkerhetsplanering.",
      "purpose": "Att deltagaren ska kunna stödja eget förbands verksamhet avseende säkerhetstjänst och planera samt genomföra enklare säkerhetsprodukter för beslutsfattning och säkerhetsmedvetenhet inom hemvärnsförband.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna planera och genomföra säkerhetstjänst samt utarbeta säkerhetsanalyser och säkerhetsplaner för hemvärnsförband.",
      "secondaryLearningObjectives": [
        "Beskriva och förklara säkerhetshot och krav på hemvärnsstab avseende dokumentation, analys och delgivning av säkerhetsprodukter.",
        "Ge exempel på styrande regelverk inom Försvarsmakten avseende säkerhetstjänst.",
        "Beskriva säkerhetstjänstarbetet inom eget förband och samverkan med högre chef, egen stab och underställda förband.",
        "Ge exempel på underrättelse- och säkerhetsbehov samt rapportering.",
        "Beskriva stående bataljonsorder avseende säkerhetstjänst."
      ],
      "examination": "Praktiskt lärande prov där deltagaren ska utarbeta en säkerhetsanalys och föreslå relevanta förebyggande åtgärder. Prov betygssätts med godkänd/icke godkänd. Max två examinationstillfällen under kursen.",
      "prerequisites": [
        "Lägst GU-F samt genomförd kunskapskontroll omfattande handbok undsäktjänst vid hemvärnsförband 2017.",
        "Genomförd FM lärportal eller IT's learning utbildning 'Grunder säkerhetstjänst'."
      ],
      "literature": [
        "H Säkr Grunder 2013 kap 2-4",
        "H Sekretess Bedömning del A 2011",
        "H Hv Säkrprövning 2016 sid 52",
        "Samsäk 2017",
        "Säkbest IS Hv 2017"
      ],
      "additionalInfo": null,
      "typicalDuration": "3 dagar om totalt 26 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210401"
    },
    {
      "id": "ungdomsledarkurs",
      "name": "Ungdomsledarkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": "MAHGK2011535",
      "description": "Kursen syftar till att ge deltagaren kompetens att tjänstgöra som ungdomsledare inom Hemvärnet eller frivilligorganisation. Teori och praktiska uppgifter varvas under kursens genomförande.",
      "targetAudience": "Avsedd för dig som är eller skall placeras som ungdomsledare i Hemvärnet eller i en frivilligorganisation.",
      "syllabus": "Pedagogiska grunder, direkt ledarskap, säkerhetstjänst, Hemvärnets handbok, värdegrund, utbildningsmetodik, kommunikation, gruppdynamik, etik och moral, utvecklande ledarskap.",
      "purpose": "Att deltagaren skall kunna organisera och planlägga utbildningsverksamhet för ungdomar samt ge och ta utvecklande feedback i enlighet med Försvarsmaktens värdegrund och utbildningssäkerhet.",
      "primaryLearningObjective": "Efter genomförd utbildning ska deltagaren kunna tjänstgöra som ungdomsledare vid Hemvärnet eller frivilligorganisation.",
      "secondaryLearningObjectives": [
        "Kunna organisera och planlägga utbildningsverksamhet för ungdomar.",
        "Ha färdighet i att ge och ta utvecklande feedback.",
        "Förstå bestämmelserna för ungdomsutbildning i Försvarsmakten.",
        "Förstå Försvarsmaktens värdegrund med fokus på öppenhet, resultat och ansvar (ÖRA).",
        "Förstå hur värderingar påverkar relationer och ledarskap samt behovet av olika ledarstilar.",
        "Ha kunskap om utbildningssäkerhet och utbildningsmetodikens grunder.",
        "Ha faktakunskap om kommunikation, gruppdynamiska processer, mellanmänskliga relationer samt etik och moral.",
        "Ha faktakunskap om utvecklande ledarskap (UL)."
      ],
      "examination": "Deltagande i samtliga kursmoment samt praktiska och teoretiska uppgifter. Kursen genomförs inte vid Hemvärnets stridsskola (HVSS).",
      "prerequisites": [
        "Bedömd lämplig att tjänstgöra som ungdomsledare.",
        "Militär utbildning motsvarande gruppchef eller lång erfarenhet som ungdomsinstruktör."
      ],
      "literature": [
        "Pedagogiska grunder 2006",
        "Direkt ledarskap 2006",
        "Säkerhetstjänst",
        "Hemvärnets handbok (HVH)",
        "Handbok för frivilligorganisationer (H-Friv)"
      ],
      "additionalInfo": "Kursen genomförs av utbildningsgrupp eller frivilligorganisation och erbjuds inte vid HVSS.",
      "typicalDuration": "7 dagar om totalt 62 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210414"
    },
    {
      "id": "hv-intro-automatkarbin-4",
      "name": "Hv-Intro Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA00",
      "description": "Kursen genomförs för att säkerställa att soldaten kan hantera sitt vapen på ett säkert sätt för att vidare kunna utvecklas mot basförmåga automatkarbin 4.",
      "targetAudience": "Personal som genomför utbildning hv-intro.",
      "syllabus": "Säkerhet, vapendelar och funktion, laddning och avladdning i olika skjutställningar, vapenkontroll, åtgärder före, under och efter skjutning, inskjutning och skjutövningar enligt fastställda delmoment.",
      "purpose": "Att ge kursdeltagaren förmåga att hantera automatkarbin 4 på ett säkert sätt för att kunna påbörja vidare utbildning mot basförmåga.",
      "primaryLearningObjective": "Efter avslutad kurs ska skytten kunna hantera automatkarbin 4 på ett säkert sätt och vara förberedd för basförmåga automatkarbin 4.",
      "secondaryLearningObjectives": [
        "Förklara säkerhetsbestämmelser och vapenhantering enligt gällande reglementen.",
        "Identifiera och namnge vapendelar samt deras funktion.",
        "Utföra laddning och avladdning i liggande, knästående och stående skjutställning.",
        "Genomföra vapenkontroll och åtgärder före, under och efter skjutning.",
        "Utföra inskjutning och grundläggande skjutövningar."
      ],
      "examination": "Godkänt resultat på samtliga praktiska övningar och prov enligt kursplan. Obligatorisk närvaro krävs.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller motsvarande."
      ],
      "literature": [
        "Manual automatkarbin 4b, senaste utgåva.",
        "Handbok skjututbildning automatkarbin, senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "12 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210430"
    },
    {
      "id": "basförmåga-8,4-cm-granatgevär",
      "name": "Basförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA01",
      "description": "Kursen genomförs för att ge soldaten basförmåga på 8,4 cm granatgevär så att soldaten efter avslutad kurs kan påbörja strids- och förbandsutbildning i befattning med tilldelat granatgevär.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Materielkunskap, säkerhetsbestämmelser, skjutställningar, servistjänst, skjutregler, fordonsigenkänning, mål-, fart- och avståndsbedömning, vapenkontroll och träffbildsskjutning.",
      "purpose": "Att soldaten ska kunna hantera 8,4 cm granatgevär på ett säkert sätt och kunna avge eld mot mål på kända avstånd.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna påbörja förbands- och stridsutbildning i befattning som granatgevärsskytt.",
      "secondaryLearningObjectives": [
        "Behärska materielkunskap och säkerhetsbestämmelser för granatgevär.",
        "Utföra korrekta skjutställningar och servistjänst.",
        "Genomföra skjutning med god träffbild enligt gällande skjutreglemente.",
        "Bedöma mål, fart och avstånd samt känna igen fordon enligt kursplan."
      ],
      "examination": "Godkänt resultat på prov inom materielkunskap, säkerhetsbestämmelser, skjutställningar, servistjänst, skjutregler, fordonsigenkänning, mål-, fart- och avståndsbedömning, vapenkontroll samt träffbildsskjutning. Genomförda grund- och skjutövningar enligt kursplan.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Basförmåga AK4."
      ],
      "literature": [
        "Manual 8,4 cm granatgevär, 2016 års utgåva (m7739-353117).",
        "Skjutr GRG, 2002 års utgåva (m7742-111062).",
        "Skjutr GRG TLG, 2002 års utgåva (m7742-110071)."
      ],
      "additionalInfo": null,
      "typicalDuration": "41 timmar fördelat på 5 dagar (11 timmar teori, 30 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210447"
    },
    {
      "id": "basförmåga-automatkarbin-4",
      "name": "Basförmåga Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA02",
      "description": "Kursen ger soldaten basförmåga på automatkarbin 4 så att soldaten efter avslutad kurs kan påbörja strids- och förbandsutbildning i befattning med tilldelad automatkarbin 4. Utbildningen omfattar både teori och praktik med fokus på vapenhantering, skjutteknik och säkerhet.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Vapenhantering och säkerhetsbestämmelser, skjutställningar, magasinshantering, eldavbrott, omladdning, träffbildsskjutning på avstånd upp till 100 meter i olika skjutställningar och under varierande förhållanden, inklusive skjutning i mörker och med stridsfältsbelysning.",
      "purpose": "Att ge soldaten basförmåga på automatkarbin 4 för att kunna verka i befattning med vapnet inom hemvärnet.",
      "primaryLearningObjective": "Efter avslutad kurs ska kursdeltagaren kunna hantera och använda automatkarbin 4 på ett säkert och effektivt sätt i grundläggande skjutställningar och situationer.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa vapenhantering och säkerhetsbestämmelser enligt gällande reglementen.",
        "Utföra laddning, magasinbyte och omladdning i olika skjutställningar.",
        "Genomföra träffbildsskjutning med flera skott på varierande avstånd och under olika förhållanden.",
        "Åtgärda eldavbrott och hantera skjutövningar i dagsljus och mörker."
      ],
      "examination": "Godkänt resultat på prov i vapenhantering och säkerhetsbestämmelser samt praktiska skjutövningar enligt kursplan. Examinationen omfattar övningar 1–17 och delmoment 1–10 samt 27. Obligatorisk närvaro krävs.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV."
      ],
      "literature": [
        "Manual automatkarbin 4b, senaste utgåva.",
        "Handbok skjututbildning automatkarbin, senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "50 timmar fördelat på 5 dagar (10 timmar teori och 40 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210505"
    },
    {
      "id": "basförmåga-granattillsats-40mm",
      "name": "Basförmåga Granattillsats 40mm",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA03",
      "description": "Kursen genomförs för att ge soldaten basförmåga på granattillsats 40mm så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning med tilldelad granattillsats 40mm.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Grundövningar 1-8, skjutövningar 1, 3-4, stridsövningar 4 och 7.",
      "purpose": "Att ge soldaten basförmåga på granattillsats 40mm för att kunna verka i befattning med tilldelad granattillsats 40mm.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna hantera granattillsats 40mm på ett säkert sätt och avge eld mot mål på kända avstånd.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för granattillsats med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser för lokal skjutterräng.",
        "Använda riskhantering före, under och efter skjutövning.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar."
      ],
      "examination": "Godkänt resultat på samtliga grundövningar, skjutövningar och stridsövningar enligt kursplan.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV.",
        "Genomförd och godkänd basförmåga automatkarbin 4 eller motsvarande."
      ],
      "literature": [
        "Skjutr grtillsats ak år 2000 (m7742-110401).",
        "Skjutr grtillsats ak tlg år 2000 (m7742-110411)."
      ],
      "additionalInfo": null,
      "typicalDuration": "28 timmar fördelat på 3 dagar",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210526"
    },
    {
      "id": "basförmåga-kulspruta-58",
      "name": "Basförmåga Kulspruta 58",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA04",
      "description": "Kursen genomförs för att ge soldaten basförmåga på kulspruta 58 så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning med tilldelad kulspruta 58.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Grundövningar i vapenhantering och säkerhetsbestämmelser, skjutställningar, servistjänst, riktregler och eldens utsträckning, skottställning, samt skjutövningar mot rörligt mål och bogserat mål.",
      "purpose": "Att ge soldaten basförmåga på kulspruta 58 för att kunna verka i stridande befattning med vapnet.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna hantera kulspruta 58 på ett säkert och effektivt sätt samt påbörja förbands- och stridsutbildning i befattning med vapnet.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa vapenhantering och säkerhetsbestämmelser för kulspruta 58.",
        "Utföra isärtagning och hopsättning av vapnet.",
        "Genomföra laddning och avfyrning i olika skjutställningar.",
        "Använda riktregler och bedöma eldens utsträckning.",
        "Genomföra skjutövningar mot rörligt och bogserat mål."
      ],
      "examination": "Godkänd på teoretiska och praktiska prov enligt skjutr a pek 1 och 2 samt godkänt deltagande i samtliga grundövningar och skjutövningar. Max två omexaminationstillfällen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller GMU HV."
      ],
      "literature": [
        "Manual kulspruta m/58 (senaste utgåva).",
        "Skjutr a pek 1, 1994 års utgåva (senaste utgåva).",
        "Skjutr a pek 2, 1994 års utgåva (senaste utgåva)."
      ],
      "additionalInfo": null,
      "typicalDuration": "30 timmar fördelat på 4 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210539"
    },
    {
      "id": "basförmåga-pansarskott-m86",
      "name": "Basförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA05",
      "description": "Kursen genomförs för att ge soldaten basförmåga på pansarskott m/86 så att soldaten efter avslutad kurs kan påbörja stridsutbildning och förbandsutbildning i befattning nyttjandes pansarskott m/86.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Materielkunskap och data, funktion rsv. Säkerhetsbestämmelser del a och b. Skjutregler. Grundövningar och skjutövningar enligt skjutr pskott 86.",
      "purpose": "Att ge soldaten basförmåga på pansarskott m/86 för att kunna verka i stridande befattning.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna hantera pansarskott m/86 på ett säkert sätt och avge eld mot mål på kända avstånd.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser och skjutregler för pansarskott m/86.",
        "Genomföra grundläggande skjutövningar och stridsövningar med pansarskott m/86.",
        "Hantera materiel och ammunition enligt gällande manualer och reglementen."
      ],
      "examination": "Godkänd på prov av materielkunskap, säkerhetsbestämmelser och skjutregler samt genomförda grund- och skjutövningar. Max 3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV eller GMU, GMU HV."
      ],
      "literature": [
        "Manual pansarskott m/86 (m7739-370101)",
        "Skjutbok skjutr pskott m/86 utg 1 2004-03-12",
        "Skjutr pek 1, 1994 års utgåva (m7742-111002)",
        "Skjutr pek 2, 1994 års utgåva (m7742-111012)"
      ],
      "additionalInfo": null,
      "typicalDuration": "26 timmar fördelat på 3 dagar",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210601"
    },
    {
      "id": "pistolkurs-fortsättning",
      "name": "Pistolkurs fortsättning",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA10",
      "description": "Kursen omfattar repetition av handhavande, teori, grundläggande skjutövningar samt kompetensprov och en fältskjutning.",
      "targetAudience": "Avsedd för dig som är utrustad med pistol som tjänstevapen.",
      "syllabus": "Repetition av pistolens handhavande, säkerhetsbestämmelser, skjutövningar och genomförande av kompetensprov samt fältskjutning.",
      "purpose": "Att deltagaren skall få ökat förtroende för sitt vapen och förbättra sin skjutförmåga.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha förbättrad förmåga i skytte med pistol och vara godkänd på kompetensprovet.",
      "secondaryLearningObjectives": [
        "Förstå uppbyggnad av skjutr pistol och handha vapnet på ett säkert sätt i avancerade övningar.",
        "Genomföra en fältskjutning enligt gällande bestämmelser.",
        "Uppnå godkänt resultat på kompetensprovet."
      ],
      "examination": "Praktiska övningar och skjutövningar med ett avslutande kompetensprov. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "VPL, GMU eller GU-F.",
        "Genomförd grundläggande pistolutbildning.",
        "Genomförd hemvärnsintro."
      ],
      "literature": [
        "Manual pistol 88",
        "Skjutr pistol 2015",
        "FM handböcker och reglementen"
      ],
      "additionalInfo": "Utbildningen är avsedd för de med tjänstevapen pistol som önskar öka sin säkerhet och förmåga i vapnets handhavande.",
      "typicalDuration": "35 timmar fördelat på 4 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210612"
    },
    {
      "id": "spetsförmåga-8,4-cm-granatgevär",
      "name": "Spetsförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA21",
      "description": "Kursen genomförs för att ge soldaten spetsförmåga på 8,4 cm granatgevär så att soldaten efter avslutad kurs, med hög duglighet, kan verka stridande i befattning med tilldelat granatgevär.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Stridsövningar i dagsljus och med stridsfältsbelysning enligt gällande manualer och skjutreglementen för granatgevär.",
      "purpose": "Att soldaten ska kunna verka i befattning som granatgevärsskytt och avge eld mot mål på kända och okända avstånd i både dager och mörker.",
      "primaryLearningObjective": "Efter kursen ska skytten kunna verka i befattning som granatgevärsskytt med hög duglighet.",
      "secondaryLearningObjectives": [
        "Kunna avge eld från stridsställning mot mål på kända och okända avstånd med 8,4 cm granatgevär.",
        "Behärska skjutning i både dagsljus och mörker med stridsfältsbelysning."
      ],
      "examination": "Godkänt resultat på stridsövningar enligt kursplan och gällande skjutreglementen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV eller GMU, GMU HV.",
        "Godkänd kurs basförmåga 8,4 cm granatgevär eller motsvarande utbildning.",
        "Godkänd kurs tilläggsförmåga 8,4 cm granatgevär eller motsvarande utbildning."
      ],
      "literature": [
        "Manual 8,4 cm granatgevär, 2016 års utgåva (m7739-353117).",
        "Skjutr grg, 2002 års utgåva (m7742-111062).",
        "Skjutr grg tlg, 2002 års utgåva (m7742-110071)."
      ],
      "additionalInfo": null,
      "typicalDuration": "22 timmar fördelat på 2 dagar (11 timmar teori och 11 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210627"
    },
    {
      "id": "spetsförmåga-pansarskott-m86",
      "name": "Spetsförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA20",
      "description": "Kursen genomförs för att ge soldaten spetsförmåga på pansarskott m/86 så att soldaten efter avslutad kurs kan verka i stridande befattning nyttjandes pansarskott m/86.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Stridsövning kapitel 4.4 samt kapitel 5. Praktiska moment med fokus på stridsteknik och vapenhantering enligt gällande skjutreglemente.",
      "purpose": "Att ge soldaten spetsförmåga att verka i stridande befattning med pansarskott m/86.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna nyttja pansarskott m/86 i stridande befattning.",
      "secondaryLearningObjectives": [
        "Kunna avge eld mot mål på kända och okända avstånd från stridsställning i dagsljus och mörker med stridsfältsbelysning.",
        "Förstå och tillämpa säkerhetsbestämmelser och skjutregler för pansarskott m/86.",
        "Behärska vapenhantering och underhåll enligt manual och skjutreglemente."
      ],
      "examination": "Praktiskt lärande examination med bedömning av förmåga att genomföra stridsövningar och korrekt vapenhantering. Max 2 examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV eller GMU, GMU HV.",
        "Godkänd kurs: Basförmåga pansarskott m/86.",
        "Godkänd kurs: Tilläggsförmåga pansarskott m/86."
      ],
      "literature": [
        "Manual pansarskott m/86 (m7739-370101)",
        "Skjutbok skjutr pskott m/86 utg 1 2004-03-12",
        "Skjutr pek 1, 1994 års utgåva (m7742-111002)",
        "Skjutr pek 2, 1994 års utgåva (m7742-111012)"
      ],
      "additionalInfo": null,
      "typicalDuration": "12 timmar under 1 dag.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210645"
    },
    {
      "id": "tilläggsförmåga-8,4-cm-granatgevär",
      "name": "Tilläggsförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA11",
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på 8,4 cm granatgevär så att soldaten efter avslutad kurs kan verka stridande i befattning med tilldelat granatgevär.",
      "targetAudience": "Hemvärnets personal placerad i bevakning/insatskompani.",
      "syllabus": "Skjutövningar 3, 5, 9-12 (13-14 om möjligt) samt stridsövningar 1 och 3.",
      "purpose": "Att soldaten skall kunna verka i befattning som granatgevärsskytt och från stridsställning under enklare förhållanden kunna avge eld mot upptäckta mål på kända och okända avstånd med 8,4 cm granatgevär.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten ha förmåga att verka i befattning som granatgevärsskytt med tilldelat granatgevär.",
      "secondaryLearningObjectives": [
        "Kunna avge eld mot mål på kända och okända avstånd från stridsställning under enklare förhållanden."
      ],
      "examination": "Godkänt resultat på skjutövningar och stridsövningar enligt kursplan.",
      "prerequisites": [
        "Genomförd och godkänd GU, GU HV, GMU eller motsvarande.",
        "Godkänd kurs basförmåga 8,4 cm granatgevär eller motsvarande utbildning.",
        "Godkänd kurs tilläggsförmåga 8,4 cm granatgevär eller motsvarande utbildning."
      ],
      "literature": [
        "Manual 8,4 cm granatgevär, 2016 års utgåva (m7739-353117).",
        "Skjutr grg, 2002 års utgåva (m7742-111062).",
        "Skjutr grg tlg, 2002 års utgåva (m7742-110071)."
      ],
      "additionalInfo": null,
      "typicalDuration": "24 timmar fördelat på 3 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210704"
    },
    {
      "id": "tilläggsförmåga-automatkarbin-4",
      "name": "Tilläggsförmåga Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA12",
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på automatkarbin 4 så att soldaten efter avslutad kurs kan verka i stridande befattning med tilldelad automatkarbin 4.",
      "targetAudience": "Hemvärnets personal placerad i insats-, bevaknings- eller underrättelsekompani.",
      "syllabus": "Teoretiska och praktiska moment med fokus på avancerad skjutteknik, skjutställningar i dager och mörker, skjutning under förflyttning samt träffsäkerhet på avstånd upp till 300 meter. Övningar omfattar delmoment 12–15, 17, 21 och 28 samt övningar 34–39, 43 och 58–63 enligt kursplan.",
      "purpose": "Att ge soldaten förmåga att verka i stridande befattning med automatkarbin 4 och kunna träffa mål i varierande situationer och skjutställningar.",
      "primaryLearningObjective": "Efter avslutad kurs ska kursdeltagaren kunna verka i stridande befattning med automatkarbin 4 och tillämpa avancerad skjutteknik i olika miljöer och situationer.",
      "secondaryLearningObjectives": [
        "Behärska skjutställningar i både dager och mörker med burna sensorer.",
        "Kunna skjuta under förflyttning och träffa rörliga mål på avstånd upp till 300 meter.",
        "Kunna åtgärda eldavbrott samt genomföra magasinsbyten och omladdningar.",
        "Tillämpa säkerhetsbestämmelser och vapenhantering enligt gällande manualer."
      ],
      "examination": "Examination sker genom praktiska prov på skjutövningar och delmoment enligt kursplan. Godkänt resultat krävs på samtliga moment för godkänd kurs.",
      "prerequisites": [
        "Genomförd och godkänd grundutbildning (GU, GU HV, GMU eller GMU HV)."
      ],
      "literature": [
        "Manual automatkarbin 4b, senaste utgåva.",
        "Handbok skjututbildning automatkarbin, senaste utgåva."
      ],
      "additionalInfo": null,
      "typicalDuration": "40 timmar fördelat på 4 dagar (4 timmar teori och 36 timmar praktik).",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210717"
    },
    {
      "id": "tilläggsförmåga-granattillsats-40mm",
      "name": "Tilläggsförmåga Granattillsats 40mm",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK119VA13",
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på granattillsats 40mm så att soldaten efter avslutad kurs kan verka stridande i befattning med tilldelad granattillsats 40mm.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Skjutövning 2, stridsövningar 1-3, 5-6 enligt gällande skjutreglemente för granattillsats.",
      "purpose": "Att ge soldaten förmåga att verka med granattillsats 40mm i stridande befattning.",
      "primaryLearningObjective": "Efter avslutad kurs ska soldaten kunna hantera granattillsats 40mm och avge eld mot mål på kända och okända avstånd från stridsställning under enklare förhållanden.",
      "secondaryLearningObjectives": [],
      "examination": "Godkänt resultat på skjutövning och stridsövningar enligt kursplan. Max 2-3 examinationstillfällen.",
      "prerequisites": [
        "Genomförd och godkänd grundutbildning (gu, gu hv, gmu, gmu hv).",
        "Genomförd och godkänd basförmåga granattillsats 40mm."
      ],
      "literature": [
        "Skjutr grtillsats ak år 2000 (m7742-110401).",
        "Skjutr grtillsats ak tlg år 2000 (m7742-110411)."
      ],
      "additionalInfo": null,
      "typicalDuration": "24 timmar fördelat på 3 dagar",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210742"
    },
    {
      "id": "tilläggsförmåga-kulspruta-m58",
      "name": "Tilläggsförmåga Kulspruta m/58",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA14",
      "description": "Kursen ger soldaten tilläggsförmåga på kulspruta m/58 för att verka i stridande befattning med vapnet. Utbildningen omfattar skjutövningar mot rörligt och bogserat mål samt tillämpning av säkerhetsbestämmelser och vapenhantering.",
      "targetAudience": "Hemvärnets personal med godkänd basförmåga kulspruta m/58.",
      "syllabus": "Skjutövning mot rörligt mål i förbiflygning, skjutövning mot bogserat mål, säkerhetsbestämmelser, vapenhantering och materielkunskap enligt manual kulspruta m/58.",
      "purpose": "Att ge soldaten förmåga att verka i stridande befattning med kulspruta m/58 och kunna hantera vapnet i tillämpade skjutställningar mot rörliga mål.",
      "primaryLearningObjective": "Efter avslutad kurs ska deltagaren kunna verka i stridande befattning med kulspruta m/58 och genomföra skjutövningar mot rörliga mål med god säkerhet och precision.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa säkerhetsbestämmelser för skjutning med kulspruta m/58.",
        "Genomföra skjutövningar mot rörliga och bogserade mål.",
        "Hantera och vårda kulspruta m/58 enligt gällande manual och reglementen."
      ],
      "examination": "Praktiska skjutövningar och teoretiska prov i materielkunskap och säkerhetsbestämmelser. Max 2-3 examinationstillfällen enligt kursplan.",
      "prerequisites": [
        "Genomförd och godkänd basförmåga kulspruta m/58.",
        "God fysisk status.",
        "Genomförd grundläggande militär utbildning (GU, GMU eller motsvarande)."
      ],
      "literature": [
        "Manual kulspruta m/58 (senaste utgåva).",
        "Skjutreglemente A pek 1 och 2 (senaste utgåvor)."
      ],
      "additionalInfo": null,
      "typicalDuration": "10 timmar fördelat på 1–2 dagar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210809"
    },
    {
      "id": "tilläggsförmåga-pansarskott-m86",
      "name": "Tilläggsförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHFK119VA15",
      "description": "Kursen genomförs för att ge soldaten tilläggsförmåga på pansarskott m/86 så att soldaten efter avslutad kurs kan verka stridande i befattning nyttjandes pansarskott m/86.",
      "targetAudience": "Hemvärnets personal.",
      "syllabus": "Kursen omfattar utbildning i säker vapenhantering, tillämpning av skjutreglemente och manual för pansarskott m/86 samt riskhantering och säkerhetsbestämmelser för lokal skjutfält eller skjutterräng. Praktiska skjutövningar och stridsövningar ingår.",
      "purpose": "Att ge soldaten tilläggsförmåga att verka i stridande befattning med pansarskott m/86.",
      "primaryLearningObjective": "Efter kursen ska soldaten kunna nyttja pansarskott m/86 och avge eld mot mål på kända och okända avstånd i dagsljus och mörker med stridsfältsbelysning.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa skjutreglemente och manual för pansarskott m/86 med fokus på säker vapenhantering.",
        "Kunna tillämpa säkerhetsbestämmelser och riskhantering för lokal skjutfält eller skjutterräng.",
        "Kunna använda biträde och säkerhetskontrollant vid skjutövningar.",
        "Genomföra praktiska skjutövningar och stridsövningar enligt fastställda moment."
      ],
      "examination": "Fortlöpande praktiska examinationer av personlig färdighet och skjutförmåga samt teoretiskt uppslagsprov. Max tre examinationstillfällen under kursen.",
      "prerequisites": [
        "Genomförd instruktörskurs ak4 del 1.",
        "Instruktörskurs säkr skjutbana.",
        "Egen brukarutbildning.",
        "Godkänt kompetensprov på pansarskott m/86.",
        "Registerkontroll enligt respektive organisationsenhet eller frivilligorganisation."
      ],
      "literature": [
        "Säkr",
        "Skjutr pansarskott m/86",
        "Manual pansarskott m/86",
        "Lokala bestämmelser"
      ],
      "additionalInfo": "Kursen genomförs inte vid hemvärnets stridsskola (HvSS). Organisationsenheten förordnar och ordersätter godkänd elev med en giltighet om högst 5 år. Förordnandet ska ange aktuell skjutfält/skjutterräng. Verksamhet utanför egen organisationsenhet kräver utbildning på lokala instruktioner.",
      "typicalDuration": "1 dag om 10 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210841"
    },
    {
      "id": "skarpskytt-psg90-hv",
      "name": "Skarpskytt PSG90 Hv",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": "MAHGK4101701",
      "description": "Kursen innehåller säkerhetsbestämmelser, materielkunskap, vård, ballistiklära, skarpskytts uppträdande och strid samt skjutning på olika avstånd i dager och under mörker. Kursen är en kombination av teori och praktik.",
      "targetAudience": "Hemvärnets personal som ska placeras som skarpskytt PSG90 i hemvärnet.",
      "syllabus": "Säkerhetsbestämmelser, materielkunskap, vapenvård, ballistiklära, skarpskytts uppträdande och strid, skjutning på olika avstånd i dagsljus och mörker.",
      "purpose": "Att eleven efter genomförd kurs ska kunna tjänstgöra som skarpskytt i hemvärnsförband och fortsätta utbildningen inom eget förband.",
      "primaryLearningObjective": "Efter genomförd kurs ska eleven ha förståelse för vapnets funktion, effekt, verkan och säkerhetsbestämmelser samt ha färdighet i handhavande och vård av vapnet enligt gällande bestämmelser.",
      "secondaryLearningObjectives": [
        "Förstå vädrets inverkan på träffresultatet.",
        "Uppnå färdighet i skarpskyttets roll och agerande i hemvärnsförband.",
        "Genomföra skjutning med hög precision på varierande avstånd i olika ljusförhållanden."
      ],
      "examination": "Teoretiska och praktiska prov samt ett fysiskt test. Max ett examinationstillfälle under aktuell kurs.",
      "prerequisites": [
        "Genomfört grundutbildning (GU).",
        "Godkänt kompetensprov AK."
      ],
      "literature": [
        "Soldr mtrl vapen PSG 90",
        "Handbok prickskytt",
        "Skjutr PSG 90"
      ],
      "additionalInfo": "Kursen genomförs inte vid Hemvärnets stridsskola (HVSS).",
      "typicalDuration": "10 dagar om totalt 100 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210858"
    },
    {
      "id": "indirekt-ledarskap",
      "name": "Indirekt ledarskap",
      "shortName": "IL",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK705LE11",
      "description": "Kursen riktar sig till chefer och ledare på högre organisatoriska nivåer inom Försvarsmakten och frivillig försvarsorganisation. Fokus ligger på att utveckla förståelse för det indirekta ledarskapets betydelse och ge verktyg för att påverka medarbetare och organisation genom handlings- och imageinriktad påverkan.",
      "targetAudience": "Chefer och ledare på högre organisatoriska nivåer inom Försvarsmakten och frivillig försvarsorganisation, med minst två organisatoriska nivåer under sig.",
      "syllabus": "Föreläsningar, gruppdiskussioner och eget arbete med fokus på analys och reflektion kring det egna indirekta ledarskapet, förebildsrollen och dess påverkan på medarbetare och organisation.",
      "purpose": "Att ge deltagaren förståelse för det indirekta ledarskapets roll och betydelse samt verktyg för att utveckla sitt eget indirekta ledarskap.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna utveckla och tillämpa sitt indirekta ledarskap för att påverka medarbetare och organisation positivt.",
      "secondaryLearningObjectives": [
        "Analysera och reflektera över det egna indirekta ledarskapet och dess påverkan.",
        "Förstå hur handlingsinriktad påverkan sker genom interaktion med chefer på lägre nivåer.",
        "Förstå hur imageinriktad påverkan sker genom ledarens förebildsroll.",
        "Utveckla en personlig utvecklingsplan för det indirekta ledarskapet."
      ],
      "examination": "Deltagande och aktivt engagemang under kursens teoretiska och praktiska moment.",
      "prerequisites": [
        "Egen erfarenhet som indirekt ledare med minst två organisatoriska nivåer under sig, eller motsvarande bedömning av kursarrangör."
      ],
      "literature": [
        "Gällande handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": "Kursen genomförs med en sammanhållen del om två dagar samt en fördjupningsdag 2-3 månader senare. Minst 6 och max 12 deltagare per kurs. Ledare ska vara behöriga och registrerade i Försvarshögskolans handledarregister.",
      "typicalDuration": "2+1 dagar, totalt 24 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210914"
    },
    {
      "id": "ledarskap-och-självkännedom",
      "name": "Ledarskap och självkännedom",
      "shortName": "LoS",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK705LE12",
      "description": "Kursen syftar till att deltagaren efter genomgången utbildning ska vara bättre rustad att fungera som ledare och gruppmedlem genom fördjupad insikt om sig själv som person och ledare. Kursen omfattar teoretiska och praktiska moment med fokus på personlig utveckling och ledarskap.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som chef/stf på tropp- eller plutonsnivå inom Hemvärnet, samt för övriga chefer inom Försvarsmakten eller civila chefer som tillträtt eller ska tillträda ny chefsbefattning.",
      "syllabus": "Reflektionsövningar under fältmässiga förhållanden, grupparbeten, teoretiska föreläsningar, framtagande av personlig utvecklingsplan och uppföljningsdag.",
      "purpose": "Att deltagaren ska utveckla sin självkännedom och ledarskapsförmåga för att bättre kunna fungera som ledare inom Hemvärnet eller motsvarande organisation.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha fördjupad insikt om sig själv som ledare och kunna utarbeta en personlig plan för utveckling av sitt ledarskap.",
      "secondaryLearningObjectives": [
        "Reflektera över egna ledarskapsmönster och beteenden.",
        "Koppla teoretiska ledarskapsmodeller till praktiska erfarenheter.",
        "Utveckla förmågan att ge och ta emot konstruktiv feedback.",
        "Förstå hur värderingar påverkar relationer och ledarskap.",
        "Utforma en personlig utvecklingsplan för ledarskap."
      ],
      "examination": "Deltagande och aktivt engagemang under kursen samt framtagande av personlig utvecklingsplan. Ingen skriftlig examination.",
      "prerequisites": [],
      "literature": [
        "Handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": "Kursen genomförs normalt med en sammanhållen del om tre dagar och en uppföljningsdag efter minst en månad. Kursen leds av behöriga handledare certifierade av Försvarshögskolan.",
      "typicalDuration": "4 dagar totalt, varav 3 dagar sammanhängande och 1 uppföljningsdag.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210943"
    },
    {
      "id": "utveckling-grupp-ledare",
      "name": "Utveckling grupp ledare",
      "shortName": "UGL",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK705LE13",
      "description": "Utbildningsmetoden bygger på upplevelsebaserat lärande där deltagarna genomför gemensamma uppgifter som skapar grupprocesser. Dessa undersöks och reflekteras över för att utveckla både individ och grupp. Kursen syftar till att ge deltagarna verktyg för att utveckla sina egna grupper till mer produktiva enheter genom bättre samarbete, konflikthantering och kommunikation.",
      "targetAudience": "Kursen riktar sig till chefer och ledare inom Försvarsmakten och frivilligförsvarsorganisationer som vill utveckla sin förmåga att leda och utveckla grupper.",
      "syllabus": "Upplevelsebaserade gruppövningar, grupprocessanalys, reflektion och diskussion, teoribildningar om gruppdynamik och ledarskap, personlig utvecklingsplanering.",
      "purpose": "Att deltagarna ska få erfarenhet av gruppdynamiska situationer och förstå sin roll i dessa för att kunna utveckla sina grupper till mer effektiva och samarbetsvilliga enheter.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagarna kunna reflektera över och utveckla sitt ledarskap och sin förmåga att påverka gruppers samarbete och prestation.",
      "secondaryLearningObjectives": [
        "Arbeta med reflektion och lärande både enskilt och i grupp.",
        "Hantera och förstå konflikter samt använda konflikthanteringsverktyg.",
        "Kommunicera direkt och klart.",
        "Förstå känslors inverkan på individ- och gruppnivå.",
        "Ta och ge utvecklande feedback.",
        "Förstå hur värderingar påverkar relationer och ledarskap.",
        "Uppfatta och hantera olika roller och normer i gruppen.",
        "Identifiera olika stadier i en grupps utveckling och anpassa sitt ledarskap därefter.",
        "Använda olika ledarstilar efter behov."
      ],
      "examination": "Deltagande och aktivt engagemang under kursen samt reflektion och diskussion kring genomförda uppgifter.",
      "prerequisites": [
        "Eventuella förkunskapskrav enligt respektive kursarrangör inom Försvarsmakten eller frivilligförsvarsorganisation."
      ],
      "literature": [
        "Gällande handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": "Kursen genomförs i grupper om 8-12 deltagare och leds av två behöriga handledare med avtal från Försvarshögskolan. Kursen får inte genomföras på kortare tid än fem dagar utan skriftligt medgivande från Försvarshögskolan.",
      "typicalDuration": "5 dagar om totalt 40 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-210956"
    },
    {
      "id": "utvecklande-ledarskap",
      "name": "Utvecklande ledarskap",
      "shortName": "UL",
      "category": "Ledarskapsutbildningar",
      "courseCode": "ÄMLGK816LE10",
      "description": "Kursen syftar till att deltagarna skall utveckla sitt ledarskap genom analys, reflektion och medveten utveckling av sina dagliga ledarhandlingar med hjälp av modellen utvecklande ledarskap (UL). Deltagarna får 360-graders feedback från närmaste chef och medarbetare och utarbetar en personlig utvecklingsplan.",
      "targetAudience": "Avsedd för HV-personal placerad som chef eller ställföreträdare vid bataljon, kompani, pluton eller tropp. Även lämplig för bataljonsstabschef, sektionschef och erfarna gruppchefer. Mångfald eftersträvas.",
      "syllabus": "Teoretisk bakgrund till ledarskapsmodellen UL och ledarstilsmodellen. Praktiska moment och gruppdiskussioner. Framtagande av personlig utvecklingsplan baserad på erhållen feedback. Fördjupningsdag 3-6 månader efter kursstart med revidering av utvecklingsplan och fördjupande teorier.",
      "purpose": "Att deltagarna skall kunna analysera, reflektera över och utveckla sitt ledarskap för att bättre utveckla medarbetare och organisation och därigenom öka effektiviteten.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren ha utvecklat sitt personliga ledarskap och kunna använda UL-modellen för att utveckla medarbetare och organisation.",
      "secondaryLearningObjectives": [
        "Förstå och tillämpa den övergripande ledarskapsmodellen och ledarstilsmodellen UL.",
        "Ta emot och använda 360-graders feedback från chef och medarbetare.",
        "Utveckla en personlig utvecklingsplan för det egna ledarskapet.",
        "Delta aktivt i praktiska moment och gruppdiskussioner för att stärka ledarskapsförmågan."
      ],
      "examination": "Deltagande under kursen utgör grund för godkännande. Kursen avslutas med en fördjupningsdag där deltagarens utvecklingsplan revideras och fördjupas.",
      "prerequisites": [
        "Eventuella förkunskapskrav enligt respektive kursarrangör inom Försvarsmakten eller frivillig försvarsorganisation."
      ],
      "literature": [
        "Handledarmaterial och deltagarmaterial utgivet av Försvarshögskolan."
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar totalt, varav 3 dagar initial utbildning och 1 dag fördjupning efter 3-6 månader.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-211006"
    },
    {
      "id": "chef-musikkar",
      "name": "Chef musikkår",
      "shortName": "CMK",
      "category": "Musikutbildningar",
      "courseCode": "MAHGK3031741",
      "description": "Grundkurs för att kunna placeras som musikkårchef eller ställföreträdande vid hemvärnsmusikkår. Kursen bör genomföras innan befattningen tillträds.",
      "targetAudience": "Nuvarande eller blivande musikkårchefer eller ställföreträdande.",
      "syllabus": "Roll och ansvar som musikkårchef, Försvarsmaktens värdegrund (ÖRA), organisation och uppgifter, verksamhetsplanering, utvärdering och verksamhetsutveckling, pedagogiska grunder, militär kontext inklusive formellt uppträdande och uniformsbestämmelser, verksamhetssäkerhet, personalansvar, rekrytering, materieltjänsthantering samt fysiskt stridsvärde för musikkår.",
      "purpose": "Att deltagaren ska kunna verka som chef eller ställföreträdande för en hemvärnsmusikkår.",
      "primaryLearningObjective": "Efter kursen ska deltagaren med handledning kunna organisera, planera och leda verksamheten vid hemvärnsmusikkår.",
      "secondaryLearningObjectives": [
        "Förstå rollen som musikkårchef.",
        "Förstå Försvarsmaktens värdegrund – ÖRA.",
        "Känna till Försvarsmaktens organisation och uppgifter.",
        "Förstå verksamhetsplaneringsprocessen vid hemvärnsmusikkår.",
        "Använda utvärdering som metod för verksamhetsutveckling.",
        "Känna till Försvarsmaktens pedagogiska grundsyn.",
        "Förstå militär kontext avseende formellt uppträdande och uniformsbestämmelser.",
        "Förstå verksamhetssäkerhet med riskmedvetenhet och riskanalys.",
        "Känna till personalansvar avseende ersättningar, försäkringar, avtal, lagar och förordningar.",
        "Förstå rekryteringsprocessen vid hemvärnsmusikkår.",
        "Känna till materieltjänsthanteringen inom hemvärnsmusikkår.",
        "Förstå det fysiska stridsvärdet vid hemvärnsmusikkår."
      ],
      "examination": "Deltagande i all verksamhet under kursen krävs för godkännande.",
      "prerequisites": [
        "God kännedom om egen hemvärnsmusikkår."
      ],
      "literature": [
        "Pedagogiska grunder 2006",
        "Säki grunder",
        "HVH 2018",
        "FFS",
        "FIB",
        "FM Uniformsbestämmelser",
        "CERI FM 2010"
      ],
      "additionalInfo": null,
      "typicalDuration": "4 dagar om totalt 30 timmar.",
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-211035"
    },
    {
      "id": "gu-f",
      "name": "Grundläggande soldatutbildning för frivillig personal, GU-F",
      "shortName": "GU-F",
      "category": "Grundläggande militärutbildning",
      "courseCode": null,
      "description": "Grundläggande utbildning som genomförs som GSSU av frivilliga försvarsorganisationer för personal utan militär grundutbildning. Kursen syftar till att ge deltagaren förmåga att försvara sig själv och tillsammans med andra kunna försvara plats eller anläggning samt att handla i enlighet med gällande lagar, regler och Försvarsmaktens värdegrund.",
      "targetAudience": "Personal som inte har militär grundutbildning och är rekryterad mot en konkret befattning i insatsorganisationen. Deltagaren ska vara medlem i en frivillig försvarsorganisation, ha fyllt 18 år, vara svensk medborgare och folkbokförd i Sverige.",
      "syllabus": "Grundläggande soldatkunskaper inklusive fysisk träning, exercis, CBRN, hälso- och sjukvård, försvarsupplysning, Försvarsmaktens värdegrund, folkrätt, uniformssystem och brandutbildning.",
      "purpose": "Att ge deltagaren grundläggande kunskaper och färdigheter för att kunna verka i Försvarsmaktens krigsorganisation och tilldelas vapen vid övning, beredskap eller tjänstgöring.",
      "primaryLearningObjective": "Efter genomförd kurs ska deltagaren kunna försvara sig själv och tillsammans med andra försvara plats eller anläggning samt agera enligt gällande regelverk och värdegrund.",
      "secondaryLearningObjectives": [
        "Förstå sin roll och status i Försvarsmaktens krigsorganisation.",
        "Tillämpa grundläggande soldatkunskaper i praktiska situationer.",
        "Följa Försvarsmaktens värdegrund, folkrätt och regelverk."
      ],
      "examination": "Godkänt deltagande i samtliga utbildningsmoment krävs. Eventuell komplettering ska ske inom sex månader från kurstillfället.",
      "prerequisites": [
        "Upprättad utbildningsplan tillsammans med frivillig försvarsorganisation.",
        "Tecknat utbildningsavtal med Försvarsmakten inklusive säkerhetsprövning.",
        "God fysisk status.",
        "Medlemskap i frivillig försvarsorganisation.",
        "Minst 18 år, svensk medborgare och folkbokförd i Sverige."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "14 dagar",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-211056"
    },
    {
      "id": "tccc-cls",
      "name": "TCCC-CLS (Combat Life Saver)",
      "shortName": "TCCC-CLS",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen är en komplettering för hemvärnssjukvårdare, gruppsjukvårdare och stridssjukvårdare som tidigare genomgått äldre utbildningar och syftar till att ge kunskap om TCCC-principer, koncept och kritiska färdigheter i stridsmiljö.",
      "targetAudience": "Hemvärnssjukvårdare, gruppsjukvårdare och stridssjukvårdare som gått äldre utbildningar före 2024 eller tidigare stridssjukvårdsutbildning utan TCCC-koncept.",
      "syllabus": "TCCC-principer, livräddande åtgärder i stridsmiljö, värdering av livräddande färdigheter och deras tillämpning i vardagen.",
      "purpose": "Att säkerställa att deltagaren förstår och kan tillämpa livräddande färdigheter enligt TCCC-konceptet för att eliminera förebyggbara dödsfall vid trauma i stridsmiljö.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna utföra grundläggande livräddande åtgärder enligt TCCC-konceptet i stridsmiljö.",
      "secondaryLearningObjectives": [
        "Förstå vikten av livräddande färdigheter och deras roll i att minska dödsfall på grund av trauma.",
        "Tillämpa TCCC-principer i praktiska situationer.",
        "Integrera livräddande åtgärder i vardaglig tjänstgöring."
      ],
      "examination": "Godkänt deltagande i samtliga utbildningsmoment krävs. Eventuell komplettering ska ske inom sex månader efter kursen.",
      "prerequisites": [
        "Befattning som gruppsjukvårdare, stridssjukvårdare eller hemvärnssjukvårdare."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "Fem dagar (40 timmar).",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-211106"
    },
    {
      "id": "gk-tung-slapkarra",
      "name": "Gk Tung släpkärra",
      "shortName": "GKTSK",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att kursdeltagaren efter genomförd utbildning ska kunna bruka och vårda tung släpkärra med påskjutsbroms samt tillämpa civila lagar och militära regler och föreskrifter som påverkar fordonstjänsten. Under kursen används personbil 8 (pb8) som dragfordon.",
      "targetAudience": "Avsedd för dig som är placerad eller ska placeras i befattning i kokgrupp. Ansökan är öppen för övriga i mån av plats.",
      "syllabus": "Tillämpning av civila lagar och militära regler för fordonstjänst, användning av undantag och särbestämmelser för Försvarsmaktens fordonsförare, beskrivning av fordonsystem och utrustning, praktisk körning av ekipaget på väg i dags- och mörkerförhållanden, rangering (backning) av ekipaget, åtgärder före, under och efter körning samt vård av fordon och utrustning.",
      "purpose": "Att kursdeltagaren ska kunna framföra och vårda tung släpkärra med påskjutsbroms på ett säkert och korrekt sätt enligt gällande regelverk.",
      "primaryLearningObjective": "Efter kursen ska deltagaren kunna köra och vårda tung släpkärra med påskjutsbroms samt tillämpa relevanta lagar och regler för fordonstjänst.",
      "secondaryLearningObjectives": [
        "Tillämpa civila och militära regler och föreskrifter som påverkar fordonstjänsten.",
        "Använda undantag och särbestämmelser för Försvarsmaktens fordonsförare.",
        "Beskriva funktioner och system på fordonstypen med tillhörande utrustning.",
        "Köra ekipaget trafiksäkert i dags- och mörkerförhållanden.",
        "Rangera ekipaget med god förmåga.",
        "Utföra åtgärder före, under och efter körning samt vårda fordon och utrustning."
      ],
      "examination": "Praktisk körning och vård av ekipaget bedöms under kursen. Godkänt förarbevis för personbil 8 krävs för deltagande.",
      "prerequisites": [
        "Giltigt förarbevis för personbil 8 (pb8)."
      ],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "Fem dagar.",
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ],
      "lastModifiedBy": "gpt-4.1-mini",
      "lastModified": "20260107-211125"
    },
    {
      "id": "instruktörskurs-12",
      "name": "Instruktörskurs 1 + 2",
      "shortName": "IK12",
      "category": "Instruktörsutbildningar",
      "courseCode": "IK12",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "primaryLearningObjective": "",
      "secondaryLearningObjectives": [],
      "examination": "",
      "prerequisites": [],
      "literature": [],
      "additionalInfo": null,
      "typicalDuration": "",
      "courseResponsible": "MRM",
      "baseTemplateIds": [
        "instruktörskurs-1",
        "instruktörskurs-2"
      ],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "auto-gkdnbi",
      "courseCode": "GKDNBI",
      "name": "GK2 DNBI Krigssjukvård",
      "shortName": "GKDNBI",
      "category": "Funktionsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-undgk311sf11",
      "courseCode": "UNDGK311SF11",
      "name": "IK-skyddsvakt",
      "shortName": "UNDGK311SF11",
      "category": "Funktionsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-und424isf45",
      "courseCode": "UND424ISF45",
      "name": "Skyddsvakt grundutbildning (Skvakt GU)",
      "shortName": "UND424ISF45",
      "category": "Funktionsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-hvt423f1000",
      "courseCode": "HVT423F1000",
      "name": "GK ÖLAK",
      "shortName": "HVT423F1000",
      "category": "Instruktörsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-gc12",
      "courseCode": "GC12",
      "name": "Gruppchef 1-2",
      "shortName": "GC12",
      "category": "Chefsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-ikgrg18",
      "courseCode": "IKGRG18",
      "name": "IK GRG18",
      "shortName": "IKGRG18",
      "category": "Instruktörsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-gkmotorsåg",
      "courseCode": "GKMOTORSÅG",
      "name": "Motorsåg nivå 1 och 2",
      "shortName": "GKMOTORSÅG",
      "category": "Funktionsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-gkuav06a",
      "courseCode": "GKUAV06A",
      "name": "Grundkurs MRPAS",
      "shortName": "GKUAV06A",
      "category": "Funktionsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-iktmm",
      "courseCode": "IKTMM",
      "name": "Instruktörskurs TMM",
      "shortName": "IKTMM",
      "category": "Instruktörsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-mar423fbank",
      "courseCode": "MAR423FBANK",
      "name": "Instruktörskurs närkamp bas",
      "shortName": "MAR423FBANK",
      "category": "Instruktörsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-loggk404040",
      "courseCode": "LOGGK404040",
      "name": "Instruktörskurs TOS",
      "shortName": "LOGGK404040",
      "category": "Instruktörsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-c16020",
      "courseCode": "C16020",
      "name": "Instruktörskurs CBRN",
      "shortName": "C16020",
      "category": "Instruktörsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    },
    {
      "id": "auto-gksensor",
      "courseCode": "GKSENSOR",
      "name": "GK Sensor",
      "shortName": "GKSENSOR",
      "category": "Funktionsutbildningar",
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "learningObjectives": [],
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": "Automatiskt skapad från kurstillfälle",
      "typicalDuration": "",
      "courseResponsible": "",
      "baseTemplateIds": [],
      "sourceFiles": [
        "events.csv"
      ],
      "lastModifiedBy": "csv-import",
      "lastModified": "20260108-184644"
    }
  ]
}