{
  "templates": [
    {
      "id": "kombu",
      "name": "Kombattantutbildning för krigsplacerad, obeväpnad personal (KombU)",
      "shortName": "KombU",
      "category": "Grundläggande militärutbildning",
      "courseCode": null,
      "description": "Kursen ger grundläggande militär utbildning för krigsplacerad personal som inte är beväpnad, med fokus på skydd, säkerhet och grundläggande soldatkunskaper anpassade för obeväpnad tjänst.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som är krigsplacerad i obeväpnad befattning.",
      "syllabus": "Grundläggande soldatkunskaper, skydd mot verkanseld, agerande vid stridskontakt, sjukvård, säkerhetstjänst och Försvarsmaktens värdegrund.",
      "purpose": "Att ge obeväpnad krigsplacerad personal de kunskaper och färdigheter som krävs för att kunna verka säkert och effektivt i sin befattning inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna agera självständigt och i grupp enligt gällande säkerhetsrutiner och instruktioner för obeväpnad personal vid insats.",
      "subGoals": [
        "Förstå och tillämpa grundläggande skyddsåtgärder vid hot och fara.",
        "Kunna agera enligt säkerhetsrutiner vid stridskontakt och andra incidenter.",
        "Tillämpa grundläggande sjukvård och första hjälpen.",
        "Känna till Försvarsmaktens värdegrund och soldatregler."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att agera enligt kursens mål bedöms.",
      "prerequisites": [],
      "literature": "FM Handböcker och reglementen relevanta för obeväpnad personal.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "gruppchef-1",
      "name": "Gruppchefskurs 1",
      "shortName": "GC1",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande gruppchefsutbildning där fokus ligger på orderträning, stridsteknik, beslutsfattning där teori varvas med praktiska övningar utomhus.",
      "targetAudience": "Avsedd för dig som är eller skall placeras i befattning som gruppchef/stf inom Hemvärnet.",
      "syllabus": "Grundläggande ledarskap, ordergivning, gruppens stridsteknik, soldatregler och tillämpade övningar.",
      "purpose": "Att deltagaren skall kunna verka som gruppchef/stf inom Hemvärnet eller frivilligorganisation.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som gruppchef inom Hemvärnet eller frivilligorganisation.",
      "subGoals": [
        "Förklara och utveckla gruppchefens roll, ansvar och utförande av befälsföring av grupp vid uppgifts lösande samt tillämpandet av soldatreglerna, FM Värdegrund och fysiskt stridsvärde.",
        "Förklara och använda högre chefs order i form av att ge order till egen grupp.",
        "Exemplifiera och använda stridsteknik enligt handbok hemvärnspluton-grupp vid framryckande och tagande av skyddsobjekt inom hemvärnsplutons ram.",
        "Beskriva upprättandet av förläggning, observationsplats och postställe.",
        "Definiera och beskriva hemvärnsplutonernas organisation och uppgifter."
      ],
      "examination": "Praktiskt lärande examinationer där elevens ordergivning vid nedbrytande av plutonchefs order, användande av OBO alternativt 5 punkts order enligt handbok och agerande i rollen som gruppchef utvärderas fortlöpande under kursen med tyngdpunkt på fältdygnen. Max 2 examinationstillfälle under kursen.",
      "prerequisites": [
        "VPL, GMU, eller GU.",
        "Genomfört kompetensprov Ak 4B/C.",
        "Fysisk status för att klara minst två fältdygn."
      ],
      "literature": "Handbok Hvplut/Hvgrp del 1-2, (Grunder och Objektet), MSR, FM Handböcker och reglementen",
      "additionalInfo": "Utbildning till gruppchef/stf omfattar två kurser; Gruppchefskurs1 och Gruppchefskurs 2. Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "gruppchef-2",
      "name": "Gruppchefskurs 2",
      "shortName": "GC2",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Fördjupande kurs för gruppchefer inom Hemvärnet med fokus på ledarskap, ordergivning, stridsteknik och gruppens samverkan i mer komplexa situationer. Kursen varvar teori med praktiska moment och övningar utomhus.",
      "targetAudience": "För dig som är eller ska placeras som gruppchef/stf inom Hemvärnet och har genomfört Gruppchefskurs 1.",
      "syllabus": "Fördjupat ledarskap, avancerad ordergivning, gruppens stridsteknik i olika miljöer, samverkan med andra enheter, tillämpade övningar och fälttjänst.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att självständigt kunna leda en grupp inom Hemvärnet i mer krävande situationer.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som gruppchef inom Hemvärnet med förmåga att leda gruppen i komplexa uppgifter och situationer.",
      "subGoals": [
        "Tillämpa fördjupade kunskaper i ledarskap och ordergivning.",
        "Planera och genomföra gruppens uppgifter i samverkan med andra enheter.",
        "Använda avancerad stridsteknik och anpassa gruppens agerande efter situation och miljö.",
        "Utveckla gruppens samarbete och effektivitet under fälttjänst.",
        "Följa Försvarsmaktens värdegrund och soldatregler i rollen som gruppchef."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att leda, ge order och samverka med andra utvärderas under kursens gång, särskilt under fältdygnen.",
      "prerequisites": [
        "Genomförd Gruppchefskurs 1.",
        "Fysisk status för att klara fältdygn och praktiska moment."
      ],
      "literature": "Handbok Hvplut/Hvgrp del 1-2, MSR, relevanta FM handböcker och reglementen.",
      "additionalInfo": "Gruppchefskurs 2 är en fortsättningskurs och bygger vidare på kunskaper från Gruppchefskurs 1.",
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "gruppchef-3",
      "name": "Gruppchefskurs 3",
      "shortName": "GC3",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen riktar sig till dig som är eller ska bli chef eller ställföreträdande chef för understödsgrupp inom Hemvärnet. Utbildningen fokuserar på ledarskap, ordergivning och taktik för understödsgruppens uppgifter.",
      "targetAudience": "För dig som är eller ska placeras som chef eller ställföreträdande chef för understödsgrupp inom Hemvärnet.",
      "syllabus": "Ledarskap och befälsföring, ordergivning, understödsgruppens taktik och stridsteknik, tillämpade övningar samt hantering av understödsvapen.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att kunna leda en understödsgrupp inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som chef eller ställföreträdande chef för understödsgrupp inom Hemvärnet.",
      "subGoals": [
        "Förklara och tillämpa understödsgruppens roll och uppgifter inom hemvärnspluton.",
        "Planera och genomföra ordergivning till understödsgrupp.",
        "Använda stridsteknik och taktik anpassad för understödsgruppens verksamhet.",
        "Hantera och leda användning av understödsvapen enligt gällande reglementen.",
        "Tillämpa FM Värdegrund och soldatregler i rollen som gruppchef."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att leda understödsgrupp, ge order och tillämpa taktik samt hantera understödsvapen under praktiska övningar.",
      "prerequisites": [
        "Genomförd Gruppchefskurs 1 och 2.",
        "Godkänd på kompetensprov för aktuella understödsvapen.",
        "Fysisk status för att klara fältdygn och praktiska moment."
      ],
      "literature": "Handbok Hvplut/Hvgrp, relevanta FM handböcker och reglementen för understödsgrupp och understödsvapen.",
      "additionalInfo": "Gruppchefskurs 3 är endast avsedd för de som är eller skall bli chef/stf för en understödsgrupp.",
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "gruppchef-12",
      "name": "Gruppchefskurs 1 + 2",
      "shortName": "GC12",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar både grundläggande och fördjupad utbildning för gruppchefer inom Hemvärnet. Fokus ligger på ledarskap, ordergivning, stridsteknik, beslutsfattande samt tillämpade övningar utomhus. Teori varvas med praktiska moment för att utveckla deltagarens förmåga att leda en grupp i olika situationer.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som gruppchef eller ställföreträdande gruppchef inom Hemvärnet.",
      "syllabus": "Ledarskap, ordergivning, gruppens stridsteknik, soldatregler, tillämpade övningar, förläggning, observationsplats, postställe samt fördjupning i gruppchefens ansvar och befälsföring.",
      "purpose": "Att deltagaren ska kunna verka som gruppchef eller ställföreträdande gruppchef inom Hemvärnet eller frivilligorganisation.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna leda en grupp inom Hemvärnet enligt gällande regelverk och metoder.",
      "subGoals": [
        "Förklara och utveckla gruppchefens roll, ansvar och befälsföring vid uppgiftslösning.",
        "Använda och förmedla order enligt fastställda metoder till egen grupp.",
        "Tillämpa stridsteknik och soldatregler i praktiska övningar.",
        "Beskriva och upprätta förläggning, observationsplats och postställe.",
        "Redogöra för hemvärnsplutonernas organisation och uppgifter."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att leda, ge order och tillämpa stridsteknik bedöms under kursens gång.",
      "prerequisites": [
        "VPL, GMU eller GU.",
        "Genomfört kompetensprov Ak 4B/C.",
        "Fysisk status för att klara minst två fältdygn."
      ],
      "literature": "Handbok Hvplut/Hvgrp del 1-2, MSR, Försvarsmaktens handböcker och reglementen.",
      "additionalInfo": "Gruppchefskurs 1 + 2 utgör den samlade utbildningen för gruppchefer inom Hemvärnet. Gruppchefskurs 3 är avsedd för understödsgruppchefer.",
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [
        "gruppchef-1",
        "gruppchef-2"
      ],
      "sourceFiles": [
        "hvss-kurskatalog-2025.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "gruppchef-x",
      "name": "Gruppchefskurs X",
      "shortName": "GCX",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupad utbildning för gruppchefer inom Hemvärnet med fokus på ledarskap, ordergivning och praktiska moment anpassade efter gruppchefens ansvar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som gruppchef inom Hemvärnet.",
      "syllabus": "Fördjupat ledarskap, ordergivning, gruppens taktik och stridsteknik, tillämpade övningar samt grundläggande kunskap om Hemvärnets organisation och uppgifter.",
      "purpose": "Att deltagaren ska utveckla sin förmåga att verka som gruppchef inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna leda och ansvara för en grupp inom Hemvärnet enligt gällande regelverk och metoder.",
      "subGoals": [
        "Utveckla förståelse för gruppchefens ansvar och befogenheter.",
        "Tillämpa ordergivning och ledarskap i praktiska situationer.",
        "Använda stridsteknik och taktik enligt Hemvärnets riktlinjer.",
        "Beskriva och tillämpa Hemvärnets organisation och uppgifter."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att leda och ge order utvärderas.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Godkänd vapenutbildning enligt Hemvärnets krav."
      ],
      "literature": "Handbok Hvplut/Hvgrp, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "troppchef-stab-tross",
      "name": "Troppchef Stab och Tross",
      "shortName": "CSOT",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som troppchef inom stab och tross i Hemvärnet. Utbildningen omfattar ledarskap, ordergivning, planering och genomförande av stab- och trossuppgifter samt samverkan inom pluton och kompani.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som troppchef inom stab och tross i Hemvärnet.",
      "syllabus": "Ledarskap och befälsföring, ordergivning, planering och genomförande av stab- och trossuppgifter, samverkan inom pluton och kompani, grundläggande logistik och försörjning.",
      "purpose": "Att deltagaren ska kunna verka som troppchef inom stab och tross i Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna leda och ansvara för stab- och trossuppgifter inom hemvärnsförband.",
      "subGoals": [
        "Förklara och tillämpa troppchefens roll och ansvar inom stab och tross.",
        "Planera och leda genomförandet av grundläggande stab- och trossuppgifter.",
        "Samverka med andra funktioner inom pluton och kompani.",
        "Tillämpa Försvarsmaktens värdegrund och soldatregler i rollen som troppchef."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, leda och genomföra stab- och trossuppgifter samt ordergivning och samverkan.",
      "prerequisites": [
        "Genomförd grundläggande chefsutbildning inom Hemvärnet eller motsvarande.",
        "Lämplig befattning inom stab och tross."
      ],
      "literature": "Handbok för Hemvärnsstab och tross, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "plutonchef-1",
      "name": "Plutonchefskurs 1",
      "shortName": "PC1",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande utbildning för dig som ska tjänstgöra som plutonchef inom Hemvärnet. Fokus ligger på ledarskap, ordergivning, planering och genomförande av plutonens uppgifter, där teori varvas med praktiska övningar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som plutonchef eller ställföreträdande plutonchef inom Hemvärnet.",
      "syllabus": "Ledarskap på plutonsnivå, ordergivning, planering och genomförande av plutonens uppgifter, taktik, samverkan, tillämpade övningar samt Försvarsmaktens värdegrund.",
      "purpose": "Att deltagaren ska kunna verka som plutonchef eller ställföreträdande plutonchef inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna leda och genomföra plutonens uppgifter enligt gällande reglementen och riktlinjer.",
      "subGoals": [
        "Förklara och tillämpa plutonchefens roll, ansvar och befälsföring.",
        "Planera och genomföra plutonens uppgifter utifrån givna order.",
        "Ge tydliga order till gruppchefer och säkerställa förståelse.",
        "Använda grundläggande taktik och stridsteknik på plutonsnivå.",
        "Samverka med andra enheter och tillämpa Försvarsmaktens värdegrund."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att leda plutonen, ge order och fatta beslut bedöms under övningar och fältdygn.",
      "prerequisites": [
        "Genomförd gruppchefskurs eller motsvarande erfarenhet.",
        "Godkänd vapenutbildning enligt Hemvärnets krav.",
        "Fysisk status för att klara fältdygn och praktiska moment."
      ],
      "literature": "Handbok för hemvärnspluton och plutonchef, Försvarsmaktens handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "plutonchef-2",
      "name": "Plutonchefskurs 2",
      "shortName": "PC2",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att fördjupa kunskaper och färdigheter i att leda en hemvärnspluton, med fokus på planering, ledning och genomförande av plutonens uppgifter i olika situationer.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som plutonchef eller ställföreträdande plutonchef inom Hemvärnet.",
      "syllabus": "Fördjupad ledarskapsträning, ordergivning på plutonsnivå, taktik och stridsteknik, planering och genomförande av plutonens uppgifter, samverkan med underställda och sidoförband samt tillämpade övningar.",
      "purpose": "Att ge deltagaren fördjupad kompetens för att självständigt kunna leda en hemvärnspluton vid olika typer av uppgifter.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och genomföra plutonens verksamhet enligt gällande reglementen och riktlinjer.",
      "subGoals": [
        "Tillämpa och utveckla plutonchefens roll och ansvar vid ledning av hemvärnspluton.",
        "Planera och genomföra ordergivning på plutonsnivå.",
        "Använda taktik och stridsteknik anpassad för hemvärnsplutonens uppgifter.",
        "Samverka med underställda grupper och andra förband.",
        "Genomföra praktiska övningar och utvärdera plutonens insats."
      ],
      "examination": "Löpande bedömning under kursen med fokus på praktiska övningar, ordergivning och ledarskap vid genomförande av plutonens uppgifter.",
      "prerequisites": [
        "Genomförd Plutonchefskurs 1 eller motsvarande.",
        "Tidigare erfarenhet av befattning som gruppchef eller ställföreträdande plutonchef.",
        "Fysisk status för att klara fältdygn och övningar."
      ],
      "literature": "Handbok Hemvärnspluton/Hemvärnsgrupp, FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "plutonchef-3",
      "name": "Plutonchefskurs 3",
      "shortName": "PC3",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att fördjupa plutonchefens kunskaper och färdigheter i ledning av hemvärnspluton under mer komplexa förhållanden, med fokus på planering, genomförande och utvärdering av plutonens verksamhet.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som plutonchef eller ställföreträdande plutonchef inom Hemvärnet.",
      "syllabus": "Fördjupad ledning av pluton, taktik och stridsteknik på plutonsnivå, ordergivning, planering och genomförande av övningar, utvärdering av verksamhet samt tillämpning av gällande reglementen och handböcker.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att självständigt kunna leda en hemvärnspluton i olika typer av uppgifter.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och utvärdera plutonens verksamhet under varierande förhållanden.",
      "subGoals": [
        "Tillämpa fördjupad ordergivning och ledning av pluton enligt gällande metoder.",
        "Planera och genomföra plutonens uppgifter i enlighet med chefens intentioner.",
        "Analysera och utvärdera plutonens insatser och utvecklingsbehov.",
        "Använda relevanta handböcker och reglementen i plutonchefens arbete."
      ],
      "examination": "Löpande bedömning under kursen genom praktiska och teoretiska moment där deltagarens förmåga att leda, planera och utvärdera plutonens verksamhet prövas.",
      "prerequisites": [
        "Genomförd Plutonchefskurs 2 eller motsvarande.",
        "Tidigare erfarenhet av befattning som plutonchef eller ställföreträdande plutonchef rekommenderas."
      ],
      "literature": "Handbok Hemvärnspluton, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "plutonchef-12",
      "name": "Plutonchefskurs 1 + 2",
      "shortName": "PC12",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen omfattar grundläggande och fördjupad utbildning för plutonchefer inom Hemvärnet. Fokus ligger på ledarskap, ordergivning, planering och genomförande av plutonens uppgifter, där teori varvas med praktiska övningar.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som plutonchef eller ställföreträdande plutonchef inom Hemvärnet.",
      "syllabus": "Ledarskap på plutonsnivå, ordergivning, planering och genomförande av plutonens stridsuppgifter, taktik, samverkan, tillämpade övningar samt Försvarsmaktens värdegrund.",
      "purpose": "Att deltagaren ska kunna verka som plutonchef eller ställföreträdande plutonchef inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna leda en hemvärnspluton i olika uppgifter enligt gällande reglementen och riktlinjer.",
      "subGoals": [
        "Förklara och tillämpa plutonchefens roll, ansvar och befälsföring.",
        "Planera och genomföra plutonens uppgifter utifrån givna order.",
        "Ge tydliga order till gruppchefer och säkerställa uppföljning.",
        "Tillämpa grundläggande och fördjupad taktik på plutonsnivå.",
        "Samverka med andra enheter och aktörer vid genomförande av uppgifter."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att leda, planera och genomföra plutonens uppgifter bedöms.",
      "prerequisites": [
        "Genomförd gruppchefskurs eller motsvarande.",
        "Godkänd fysisk status enligt Försvarsmaktens krav."
      ],
      "literature": "Handbok för hemvärnspluton och plutonchef, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [
        "plutonchef-1",
        "plutonchef-2"
      ],
      "sourceFiles": [
        "hvss-kurskatalog-2025.pdf",
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "ledningsplutonchef",
      "name": "Ledningsplutonchefskurs",
      "shortName": "LPC",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupad utbildning för dig som ska tjänstgöra som chef eller ställföreträdande chef för ledningspluton inom Hemvärnet. Fokus ligger på ledning, planering och genomförande av plutonens uppgifter samt samverkan med andra enheter.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som chef eller ställföreträdande chef för ledningspluton inom Hemvärnet.",
      "syllabus": "Ledarskap på plutonsnivå, ordergivning, planering och genomförande av ledningsplutonens uppgifter, sambandstjänst, samverkan och tillämpade övningar.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att kunna leda en ledningspluton inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som chef eller ställföreträdande chef för ledningspluton inom Hemvärnet.",
      "subGoals": [
        "Förklara och tillämpa ledningsplutonchefens roll och ansvar.",
        "Planera och leda ledningsplutonens verksamhet utifrån givna order.",
        "Genomföra ordergivning och rapportering enligt gällande rutiner.",
        "Samverka med andra plutoner och enheter inom Hemvärnet.",
        "Tillämpa sambandstjänst och säkerställa effektiv kommunikation inom plutonen."
      ],
      "examination": "Löpande bedömning under kursen genom praktiska och teoretiska moment, med särskilt fokus på ordergivning, planering och ledning av plutonens uppgifter.",
      "prerequisites": [
        "Genomförd grundläggande chefsutbildning inom Hemvärnet eller motsvarande.",
        "Tjänstgöring eller planerad placering som chef/stf chef för ledningspluton."
      ],
      "literature": "Handbok för ledningspluton, FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "kompanichef-1",
      "name": "Kompanichefskurs 1",
      "shortName": "KC1",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande utbildning för blivande eller nuvarande kompanichefer inom Hemvärnet. Fokus ligger på ledarskap, ordergivning, planering och genomförande av kompaniets uppgifter.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som kompanichef eller ställföreträdande kompanichef inom Hemvärnet.",
      "syllabus": "Ledarskap på kompaninivå, ordergivning, planering och genomförande av kompaniets verksamhet, samverkan med plutonchefer och högre chef, tillämpning av Försvarsmaktens regelverk och värdegrund.",
      "purpose": "Att deltagaren ska kunna verka som kompanichef eller ställföreträdande kompanichef inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna leda ett hemvärnskompani enligt gällande regelverk och riktlinjer.",
      "subGoals": [
        "Förklara kompanichefens roll, ansvar och befogenheter.",
        "Planera och leda kompaniets verksamhet utifrån givna order.",
        "Tillämpa Försvarsmaktens värdegrund och regelverk i rollen som kompanichef.",
        "Samverka effektivt med plutonchefer och högre chef.",
        "Genomföra ordergivning och uppföljning på kompaninivå."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, leda och genomföra kompaniets verksamhet samt ordergivning och ledarskap i praktiska och teoretiska moment.",
      "prerequisites": [
        "Genomförd grundläggande chefsutbildning inom Hemvärnet eller motsvarande.",
        "Tidigare erfarenhet av befattning som plutonchef eller motsvarande rekommenderas."
      ],
      "literature": "Handbok för hemvärnskompani, Försvarsmaktens handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "kompanichef-2",
      "name": "Kompanichefskurs 2",
      "shortName": "KC2",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Fördjupad utbildning för kompanichefer inom Hemvärnet med fokus på ledarskap, planering och genomförande av kompaniets verksamhet samt samverkan med andra förband och myndigheter.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som kompanichef eller ställföreträdande kompanichef inom Hemvärnet.",
      "syllabus": "Fördjupat ledarskap, kompaniets stridsteknik och taktik, ordergivning, planering av kompaniets verksamhet, samverkan med andra förband och myndigheter, samt tillämpade övningar.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att kunna leda ett hemvärnskompani i olika typer av insatser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som kompanichef eller ställföreträdande kompanichef inom Hemvärnet.",
      "subGoals": [
        "Förklara och tillämpa kompanichefens ansvar och befogenheter.",
        "Planera och leda kompaniets verksamhet utifrån givna order och förutsättningar.",
        "Genomföra ordergivning och leda kompaniet i olika typer av insatser.",
        "Samverka med andra förband och myndigheter.",
        "Tillämpa Försvarsmaktens värdegrund och regelverk i rollen som kompanichef."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, leda och genomföra kompaniets verksamhet samt genomförande av praktiska och teoretiska moment.",
      "prerequisites": [
        "Genomförd Kompanichefskurs 1 eller motsvarande.",
        "Tidigare erfarenhet av chefsbefattning inom Hemvärnet eller Försvarsmakten."
      ],
      "literature": "Handbok för hemvärnskompani, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "kompanichef-3",
      "name": "Kompanichefskurs 3",
      "shortName": "KC3",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att fördjupa kunskaper och färdigheter i att leda hemvärnskompanier på högre nivå, med fokus på planering, ledning och samordning av större förband inom ramen för Hemvärnets uppgifter.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som kompanichef eller ställföreträdande kompanichef inom Hemvärnet.",
      "syllabus": "Fördjupad ledarskapsträning, operativ planering, ordergivning på kompaninivå, samverkan med andra förband och myndigheter, samt tillämpade övningar i fält.",
      "purpose": "Att ge deltagaren förmåga att självständigt leda och samordna hemvärnskompaniets verksamhet i olika typer av insatser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som kompanichef eller ställföreträdande kompanichef inom Hemvärnet.",
      "subGoals": [
        "Förklara och tillämpa kompanichefens ansvar och befogenheter.",
        "Planera och leda kompaniets verksamhet vid olika typer av insatser.",
        "Genomföra ordergivning och uppföljning på kompaninivå.",
        "Samverka med andra förband och civila aktörer.",
        "Tillämpa Försvarsmaktens värdegrund och regelverk i rollen som kompanichef."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, leda och samverka under praktiska övningar och scenarier.",
      "prerequisites": [
        "Genomförd Kompanichefskurs 2 eller motsvarande.",
        "Tjänstgöring eller planerad placering som kompanichef/stf kompanichef inom Hemvärnet."
      ],
      "literature": "Handbok för hemvärnskompanier, Försvarsmaktens reglementen och handböcker, relevanta styrdokument.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "kompanistridskurs",
      "name": "Kompanistridskurs",
      "shortName": "KSTR",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper och färdigheter i att leda och genomföra strid på kompaninivå inom Hemvärnet. Teori varvas med praktiska övningar för att utveckla deltagarens förmåga att planera, leda och utvärdera kompaniets stridsinsatser.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som kompanichef, ställföreträdande kompanichef eller annan ledande befattning på kompaninivå inom Hemvärnet.",
      "syllabus": "Stridsteknik på kompaninivå, ordergivning, ledning av kompaniets strid, samverkan med understödjande enheter, planering och genomförande av kompanistridsmoment samt utvärdering av insatser.",
      "purpose": "Att ge deltagaren förmåga att självständigt leda och genomföra strid på kompaninivå inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och utvärdera kompaniets stridsinsatser enligt gällande reglementen och riktlinjer.",
      "subGoals": [
        "Förklara kompanichefens roll och ansvar vid stridsledning.",
        "Tillämpa ordergivning och ledning av kompaniets strid enligt Försvarsmaktens metoder.",
        "Planera och genomföra kompanistridsmoment i olika miljöer.",
        "Samverka med understödjande och angränsande enheter.",
        "Utvärdera och återkoppla genomförda insatser för fortsatt utveckling."
      ],
      "examination": "Löpande bedömning under praktiska och teoretiska moment samt avslutande övning där deltagarens förmåga att leda kompaniets strid utvärderas.",
      "prerequisites": [
        "Genomförd grundläggande chefsutbildning (exempelvis Gruppchefskurs och Plutonchefskurs) eller motsvarande erfarenhet.",
        "God fysisk status för att klara fältmässiga moment."
      ],
      "literature": "Handbok kompanistrid, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "bataljonchef-1",
      "name": "Bataljonchefskurs 1",
      "shortName": "BC1",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som bataljonchef inom Hemvärnet. Utbildningen omfattar ledarskap, planering, ordergivning samt bataljonens uppgifter och organisation.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som bataljonchef inom Hemvärnet.",
      "syllabus": "Ledarskap på bataljonsnivå, ordergivning, planering av bataljonens verksamhet, samverkan med underställda och sidoförband, bataljonens organisation och uppgifter, tillämpade övningar.",
      "purpose": "Att ge deltagaren förmåga att leda och ansvara för en hemvärnsbataljon enligt Försvarsmaktens krav och riktlinjer.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som bataljonchef inom Hemvärnet.",
      "subGoals": [
        "Redogöra för bataljonchefens roll, ansvar och befogenheter.",
        "Planera och leda bataljonens verksamhet utifrån givna order och förutsättningar.",
        "Genomföra ordergivning och leda bataljonens insatser i olika situationer.",
        "Samverka med underställda chefer, sidoförband och civila aktörer.",
        "Tillämpa Försvarsmaktens värdegrund och regelverk i rollen som bataljonchef."
      ],
      "examination": "Löpande bedömning under kursen samt praktiska och teoretiska moment där deltagarens förmåga att planera, leda och ge order på bataljonsnivå utvärderas.",
      "prerequisites": [
        "Genomförd utbildning motsvarande kompanichefskurs.",
        "Relevant erfarenhet av chefstjänst inom Hemvärnet eller Försvarsmakten."
      ],
      "literature": "Handbok bataljon, FM handböcker och reglementen, relevanta styrdokument för Hemvärnet.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "bataljonchef-2",
      "name": "Bataljonchefskurs 2",
      "shortName": "BC2",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att vidareutveckla bataljonchefens förmåga att leda, planera och genomföra verksamhet på bataljonsnivå inom Hemvärnet. Fokus ligger på ledarskap, taktik, stabstjänst och beslutsfattande i komplexa situationer.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som bataljonchef inom Hemvärnet.",
      "syllabus": "Ledarskap på bataljonsnivå, taktik och stridsteknik, stabstjänst, ordergivning, planering av bataljonsuppgifter samt samverkan med andra förband och myndigheter.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att kunna verka som bataljonchef inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna leda och ansvara för bataljonens verksamhet enligt gällande regelverk och riktlinjer.",
      "subGoals": [
        "Förstå och tillämpa bataljonchefens ansvar och befogenheter.",
        "Planera och leda bataljonens verksamhet i olika typer av insatser.",
        "Utveckla och använda effektiva ledningsmetoder och beslutsprocesser.",
        "Samverka med andra förband och civila aktörer.",
        "Tillämpa relevanta regelverk och handböcker för bataljonsnivån."
      ],
      "examination": "Löpande bedömning och praktiska övningar där deltagarens förmåga att leda och fatta beslut på bataljonsnivå utvärderas.",
      "prerequisites": [
        "Genomförd Bataljonchefskurs 1 eller motsvarande.",
        "Relevant erfarenhet av chefsbefattning inom Hemvärnet."
      ],
      "literature": "Handböcker och reglementen för bataljonsnivå inom Hemvärnet samt Försvarsmaktens ledarskaps- och taktikdokument.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "bataljonchef-3",
      "name": "Bataljonchefskurs 3",
      "shortName": "BC3",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att fördjupa kunskaper och färdigheter för bataljonchefer inom Hemvärnet, med fokus på ledning, planering och genomförande av bataljonsuppgifter i olika typer av insatser.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som bataljonchef inom Hemvärnet.",
      "syllabus": "Fördjupad ledning av bataljon, operativ planering, samverkan med andra förband och myndigheter, beslutsfattande under press samt tillämpade övningar.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att kunna verka som bataljonchef inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna leda och samordna en hemvärnsbataljon vid olika typer av insatser.",
      "subGoals": [
        "Förklara bataljonchefens roll och ansvar inom Hemvärnet.",
        "Tillämpa operativ planering och ledning av bataljon.",
        "Samverka med andra förband och civila myndigheter.",
        "Fatta beslut och leda under pressade förhållanden.",
        "Genomföra och utvärdera bataljonsövningar."
      ],
      "examination": "Löpande bedömning samt praktiska och teoretiska prov där deltagarens förmåga att leda och planera bataljonsinsatser utvärderas.",
      "prerequisites": [
        "Genomförd Bataljonchefskurs 2 eller motsvarande.",
        "Tjänstgöring eller planerad placering som bataljonchef inom Hemvärnet."
      ],
      "literature": "Handböcker och reglementen för bataljonsledning inom Hemvärnet samt relevanta Försvarsmaktsdokument.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "bataljonstridskurs",
      "name": "Bataljonstridskurs",
      "shortName": "BSTR",
      "category": "Chefsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper i bataljonens strid och ledning, med fokus på planering, genomförande och samordning av bataljonens insatser inom Hemvärnet.",
      "targetAudience": "Avsedd för befäl som är eller ska placeras i ledande befattning på bataljonsnivå inom Hemvärnet.",
      "syllabus": "Stridsteknik på bataljonsnivå, ledning och samordning av förband, ordergivning, samband, logistik samt tillämpade övningar i fält.",
      "purpose": "Att ge deltagaren förmåga att planera, leda och samordna bataljonens verksamhet vid olika typer av insatser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka i ledande befattning på bataljonsnivå och genomföra bataljonens strid enligt gällande doktrin.",
      "subGoals": [
        "Förstå och tillämpa bataljonens organisation och uppgifter.",
        "Planera och leda bataljonens strid och insatser.",
        "Samordna understöd, samband och logistik på bataljonsnivå.",
        "Utveckla förmåga att ge och ta emot order på bataljonsnivå.",
        "Genomföra praktiska övningar i bataljonsstrid."
      ],
      "examination": "Löpande bedömning under praktiska och teoretiska moment samt avslutande övning där deltagarens förmåga att leda och samordna bataljonens strid utvärderas.",
      "prerequisites": [
        "Genomförd grundläggande chefsutbildning inom Hemvärnet eller motsvarande.",
        "Tjänstgöring i relevant befattning."
      ],
      "literature": "Handbok bataljon, FM handböcker och reglementen, relevanta utbildningsmaterial från Försvarsmakten.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-1",
      "name": "Instruktörskurs 1",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i att planera, genomföra och utvärdera utbildning inom Hemvärnet. Deltagaren tränas i pedagogik, instruktörsmetodik och ledarskap med fokus på att skapa en säker och lärande utbildningsmiljö.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör vid utbildning av soldater och grupper.",
      "syllabus": "Pedagogiska grunder, instruktörsmetodik, lektionsplanering, genomförande av utbildning, återkoppling och utvärdering, säkerhetsbestämmelser samt grundläggande ledarskap.",
      "purpose": "Att ge deltagaren de grundläggande verktyg som krävs för att självständigt kunna instruera och utbilda inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera utbildningsmoment som instruktör inom Hemvärnet.",
      "subGoals": [
        "Förklara och tillämpa grundläggande pedagogik och instruktörsmetodik.",
        "Planera och genomföra lektionspass enligt Försvarsmaktens riktlinjer.",
        "Ge konstruktiv återkoppling och utvärdera utbildningsinsatser.",
        "Tillämpa säkerhetsbestämmelser vid utbildning."
      ],
      "examination": "Praktiska och teoretiska moment där deltagaren bedöms på sin förmåga att planera, genomföra och utvärdera utbildningspass samt tillämpa säkerhetsbestämmelser.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning (VPL, GMU eller GU).",
        "Lämplighet för instruktörsuppgifter bedömd av hemvärnsförbandet."
      ],
      "literature": "FM Handbok Pedagogik, relevanta reglementen och utbildningsmaterial från Hemvärnet.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-2",
      "name": "Instruktörskurs 2",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Fördjupad utbildning för instruktörer inom Hemvärnet med fokus på att utveckla förmågan att planera, genomföra och utvärdera utbildningar samt handleda andra instruktörer.",
      "targetAudience": "Avsedd för dig som är instruktör inom Hemvärnet och har genomfört Instruktörskurs 1 eller motsvarande.",
      "syllabus": "Pedagogik för vuxna, utbildningsmetodik, handledning av instruktörer, lektionsplanering, utvärdering av utbildning samt praktiska övningar.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att kunna verka som instruktör och handledare inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna planera, genomföra och utvärdera utbildningar samt handleda andra instruktörer inom Hemvärnet.",
      "subGoals": [
        "Redogöra för och tillämpa pedagogiska metoder anpassade för vuxenutbildning.",
        "Planera och genomföra utbildningspass för olika målgrupper.",
        "Ge konstruktiv återkoppling och handleda andra instruktörer.",
        "Utvärdera utbildningsinsatser och föreslå förbättringsåtgärder."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, genomföra och utvärdera utbildningsmoment samt handleda andra instruktörer.",
      "prerequisites": [
        "Genomförd Instruktörskurs 1 eller motsvarande.",
        "Tjänstgöring som instruktör inom Hemvärnet."
      ],
      "literature": "FM Handböcker, utbildningsmaterial från HvSS samt relevanta reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-fusa-grupp",
      "name": "Instruktörskurs FUSA grupp",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som instruktör för FUSA-grupp inom Hemvärnet. Fokus ligger på pedagogik, metodik och praktisk tillämpning av utbildning inom FUSA:s verksamhetsområde.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör för FUSA-grupp.",
      "syllabus": "Pedagogik och instruktörsmetodik, planering och genomförande av utbildning, säkerhetsbestämmelser, praktiska övningar samt utvärdering av utbildningsmoment inom FUSA-gruppens ansvarsområde.",
      "purpose": "Att deltagaren ska kunna planera, genomföra och utvärdera utbildning för FUSA-grupp inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna verka som instruktör för FUSA-grupp inom Hemvärnet.",
      "subGoals": [
        "Redogöra för instruktörens roll och ansvar inom FUSA-grupp.",
        "Planera och genomföra utbildningsmoment enligt gällande riktlinjer.",
        "Tillämpa pedagogiska metoder och anpassa undervisningen efter målgrupp.",
        "Genomföra och utvärdera praktiska övningar inom FUSA-gruppens verksamhet."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, genomföra och utvärdera utbildningsmoment samt praktiskt prov i instruktörsrollen.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning.",
        "Tjänstgöring inom Hemvärnet.",
        "Lämplig erfarenhet från FUSA-verksamhet rekommenderas."
      ],
      "literature": "Gällande handböcker, reglementen och utbildningsmaterial för FUSA-grupp.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-gevär-22-ungdomsvapen",
      "name": "Instruktörskurs Gevär 22 Ungdomsvapen",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna utbilda och instruera ungdomar i säker hantering och skjutning med Gevär 22 inom Hemvärnet.",
      "targetAudience": "Avsedd för dig som ska utbilda ungdomar i skytte med Gevär 22 inom Hemvärnet eller frivillig försvarsorganisation.",
      "syllabus": "Vapenkännedom, säker vapenhantering, skjutteknik, pedagogik för ungdomsutbildning samt tillämpade övningar.",
      "purpose": "Att deltagaren ska kunna verka som instruktör för ungdomar vid utbildning med Gevär 22.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna planera och genomföra utbildning i Gevär 22 för ungdomar enligt gällande säkerhetsföreskrifter.",
      "subGoals": [
        "Redogöra för säkerhetsbestämmelser vid hantering av Gevär 22.",
        "Visa förmåga att instruera ungdomar i grundläggande skjutteknik.",
        "Planera och genomföra övningar med Gevär 22 på ett säkert och pedagogiskt sätt.",
        "Tillämpa grundläggande pedagogik anpassad för ungdomar."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens förmåga att instruera och tillämpa säker vapenhantering bedöms fortlöpande under kursen.",
      "prerequisites": [
        "Fyllda 18 år.",
        "Genomförd grundläggande utbildning inom Hemvärnet eller motsvarande.",
        "Godkänd säkerhetsgenomgång för vapenhantering."
      ],
      "literature": "Gällande handböcker och reglementen för Gevär 22 samt utbildningsmaterial från Försvarsmakten.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-granattillsats-ak4b",
      "name": "Instruktörskurs Granattillsats Ak4B",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskap och färdighet för att kunna utbilda och instruera i hantering och användning av granattillsats till Ak4B inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör för granattillsats Ak4B.",
      "syllabus": "Teori och praktik kring granattillsats Ak4B, säkerhetsbestämmelser, hantering, skjutteknik och instruktörsmetodik.",
      "purpose": "Att deltagaren efter genomförd kurs självständigt ska kunna utbilda och instruera i granattillsats Ak4B.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna genomföra utbildning och handleda personal i säker och korrekt användning av granattillsats Ak4B.",
      "subGoals": [
        "Redogöra för säkerhetsbestämmelser och hantering av granattillsats Ak4B.",
        "Visa förmåga att instruera i montering, laddning och skjutning med granattillsats Ak4B.",
        "Planera och genomföra utbildningsmoment för granattillsats Ak4B enligt gällande reglementen."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens instruktörsförmåga och kunskap om granattillsats Ak4B bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd skjututbildning Ak4B."
      ],
      "literature": "Gällande handböcker och reglementen för granattillsats Ak4B samt Försvarsmaktens säkerhetsbestämmelser.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-grg-m48",
      "name": "Instruktörskurs Grg m/48",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskaper och färdigheter för att kunna utbilda och instruera i hantering och användning av granatgevär m/48 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör på granatgevär m/48.",
      "syllabus": "Vapenteknik och funktion för Grg m/48, säkerhetsbestämmelser, skjutteknik, utbildningsmetodik, praktiska instruktionsövningar samt hantering av ammunition och eldledning.",
      "purpose": "Att deltagaren ska kunna genomföra utbildning och instruktion på Grg m/48 på ett säkert och pedagogiskt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna utbilda och instruera personal i användning av Grg m/48 enligt gällande bestämmelser.",
      "subGoals": [
        "Redogöra för Grg m/48:s konstruktion, funktion och säkerhetsbestämmelser.",
        "Planera och genomföra utbildning i skjutteknik och hantering av Grg m/48.",
        "Tillämpa utbildningsmetodik vid instruktion av olika moment.",
        "Genomföra praktiska övningar med fokus på säkerhet och pedagogik."
      ],
      "examination": "Praktisk och teoretisk examination där deltagarens förmåga att instruera och hantera Grg m/48 bedöms.",
      "prerequisites": [
        "Genomförd grundläggande utbildning på Grg m/48.",
        "Lämplig erfarenhet av tjänst inom Hemvärnet."
      ],
      "literature": "Handbok Granatgevär m/48, Försvarsmaktens reglementen och säkerhetsbestämmelser.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-is-hv",
      "name": "Instruktörskurs IS Hv",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som instruktör inom informationssystem (IS) i Hemvärnet. Utbildningen varvar teori och praktik med fokus på pedagogik, metodik och hantering av aktuella IS-system.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör på informationssystem.",
      "syllabus": "Pedagogik och instruktörsmetodik, genomgång av aktuella IS-system, planering och genomförande av utbildning, praktiska övningar i instruktörsrollen.",
      "purpose": "Att deltagaren ska kunna utbilda och handleda andra inom Hemvärnet i användning av informationssystem.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera utbildning inom informationssystem för Hemvärnet.",
      "subGoals": [
        "Redogöra för instruktörens roll och ansvar vid utbildning av IS-system.",
        "Visa förmåga att planera och genomföra lektionspass inom IS.",
        "Tillämpa grundläggande pedagogiska principer vid utbildning.",
        "Hantera och instruera i aktuella informationssystem som används inom Hemvärnet."
      ],
      "examination": "Praktisk och teoretisk examination där deltagaren bedöms på sin förmåga att instruera, planera och genomföra utbildningsmoment inom IS.",
      "prerequisites": [
        "Genomförd grundläggande utbildning inom Hemvärnet.",
        "God kännedom om aktuella informationssystem."
      ],
      "literature": "Handböcker och instruktioner för aktuella IS-system, Försvarsmaktens pedagogiska riktlinjer.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-ksp-58b",
      "name": "Instruktörskurs Ksp 58B",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper och färdigheter i att utbilda och instruera på kulspruta 58B inom Hemvärnet. Deltagaren lär sig att planera, genomföra och utvärdera utbildning i vapnets hantering, säkerhet och användning.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör på kulspruta 58B.",
      "syllabus": "Vapentjänst och säkerhetsbestämmelser för Ksp 58B, utbildningsmetodik, lektionsplanering, praktisk instruktörsträning, felsökning och åtgärder vid driftstörningar, samt tillämpade övningar.",
      "purpose": "Att deltagaren ska kunna utbilda och instruera andra i säker och korrekt hantering av Ksp 58B inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna planera och genomföra utbildning på Ksp 58B som instruktör inom Hemvärnet.",
      "subGoals": [
        "Redogöra för Ksp 58B:s funktion, hantering och säkerhetsbestämmelser.",
        "Planera och genomföra lektionspass om Ksp 58B.",
        "Identifiera och åtgärda vanliga driftstörningar och fel på vapnet.",
        "Tillämpa pedagogiska metoder vid utbildning av Ksp 58B.",
        "Genomföra praktiska övningar och utvärdera utbildningsresultat."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens förmåga att instruera, hantera och utbilda på Ksp 58B bedöms fortlöpande under kursen.",
      "prerequisites": [
        "Genomförd grundläggande utbildning på Ksp 58B.",
        "Tjänstgöring inom Hemvärnet.",
        "Lämplig fysisk status för att delta i praktiska moment."
      ],
      "literature": "Handbok Ksp 58B, FM utbildningsmaterial och relevanta reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-oden",
      "name": "Instruktörskurs ODEN",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att verka som instruktör inom Hemvärnet med fokus på ODEN-systemet. Utbildningen varvar teori och praktik för att säkerställa att deltagaren kan planera, genomföra och utvärdera utbildning inom ramen för ODEN.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör med inriktning mot ODEN-systemet.",
      "syllabus": "Instruktörsmetodik, pedagogik, utbildningsplanering, praktisk tillämpning av ODEN-systemet samt utvärdering av utbildningsmoment.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att självständigt kunna utbilda andra inom ODEN-systemet i Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, genomföra och utvärdera utbildning inom ODEN-systemet som instruktör i Hemvärnet.",
      "subGoals": [
        "Redogöra för instruktörens roll och ansvar vid utbildning inom Hemvärnet.",
        "Tillämpa grundläggande pedagogiska metoder vid utbildning.",
        "Planera och genomföra utbildningsmoment med ODEN-systemet.",
        "Utvärdera och återkoppla utbildningsinsatser inom ramen för ODEN."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera, genomföra och utvärdera utbildningsmoment samt praktisk tillämpning av ODEN-systemet.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Godkänd på tidigare utbildningsmoment inom Hemvärnet."
      ],
      "literature": "Handbok ODEN, Försvarsmaktens reglementen och utbildningsmaterial.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-pansarskott-m86",
      "name": "Instruktörskurs Pansarskott m86",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskaper och färdigheter för att kunna utbilda andra i handhavande och användning av Pansarskott m/86 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör på Pansarskott m/86.",
      "syllabus": "Vapnets konstruktion och funktion, säkerhetsbestämmelser, skjutteknik, utbildningsmetodik samt praktiska övningar i instruktörsrollen.",
      "purpose": "Att deltagaren ska kunna genomföra utbildning av personal på Pansarskott m/86 på ett säkert och pedagogiskt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna verka som instruktör på Pansarskott m/86 inom Hemvärnet.",
      "subGoals": [
        "Redogöra för Pansarskott m/86 konstruktion, funktion och säkerhetsbestämmelser.",
        "Visa förmåga att instruera i handhavande och skjutteknik.",
        "Planera och genomföra utbildningsmoment enligt gällande utbildningsplan.",
        "Bedöma och säkerställa säker vapenhantering vid utbildning."
      ],
      "examination": "Praktisk och teoretisk examination där deltagarens instruktörsförmåga och kunskaper om Pansarskott m/86 bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd skytt på Pansarskott m/86.",
        "Rekommenderas av egen chef."
      ],
      "literature": "Handbok och instruktionsmaterial för Pansarskott m/86 samt Försvarsmaktens säkerhetsbestämmelser.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-pistol-88",
      "name": "Instruktörskurs Pistol 88",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskap och färdighet för att kunna utbilda och instruera i hantering och skjutning med Pistol 88 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör i Pistol 88.",
      "syllabus": "Vapenkännedom, säker vapenhantering, skjutteknik, utbildningsmetodik, säkerhetsbestämmelser samt praktiska instruktörsövningar.",
      "purpose": "Att deltagaren ska kunna genomföra utbildning och handledning i Pistol 88 på ett säkert och pedagogiskt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som instruktör i Pistol 88 inom Hemvärnet.",
      "subGoals": [
        "Redogöra för säker vapenhantering och tillämpa säkerhetsbestämmelser vid utbildning.",
        "Instruera i grundläggande och tillämpad skjutteknik med Pistol 88.",
        "Planera och genomföra utbildningsmoment för Pistol 88.",
        "Bedöma och återkoppla på deltagarnas vapenhantering och skjutskicklighet."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens instruktörsförmåga, säkerhetstänkande och vapenhantering bedöms.",
      "prerequisites": [
        "Genomförd grundläggande utbildning inom Hemvärnet.",
        "Godkänd skytt med Pistol 88.",
        "Rekommenderad av egen chef."
      ],
      "literature": "Handbok Pistol 88, Försvarsmaktens säkerhetsbestämmelser för vapen och ammunition, relevanta utbildningsanvisningar.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-psg90-alt-ak4b-med-kikarsikte",
      "name": "Instruktörskurs Psg90 alt. AK4B med kikarsikte",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskaper och färdigheter för att kunna utbilda och instruera i användning av Psg90 eller AK4B utrustad med kikarsikte inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör på Psg90 eller AK4B med kikarsikte.",
      "syllabus": "Vapenteknik och handhavande, säkerhetsbestämmelser, skjutteknik med kikarsikte, instruktörsmetodik, planering och genomförande av utbildning samt praktiska övningar.",
      "purpose": "Att deltagaren ska kunna utbilda och handleda andra i säker och effektiv användning av Psg90 eller AK4B med kikarsikte.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som instruktör för Psg90 eller AK4B med kikarsikte inom Hemvärnet.",
      "subGoals": [
        "Redogöra för vapnets funktion, säkerhetsbestämmelser och handhavande.",
        "Visa förmåga att instruera i skjutteknik och användning av kikarsikte.",
        "Planera och genomföra utbildningstillfällen för Psg90 eller AK4B med kikarsikte.",
        "Bedöma och återkoppla på deltagarnas färdigheter och säkerhet."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens instruktörsförmåga, vapenkunskap och säkerhet bedöms fortlöpande under kursen.",
      "prerequisites": [
        "Genomförd grundläggande vapentjänst.",
        "Godkänd skytt på aktuellt vapen.",
        "Lämplig instruktörserfarenhet eller rekommendation från förband."
      ],
      "literature": "Handbok för Psg90 och AK4B, Försvarsmaktens reglementen och säkerhetsbestämmelser.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-rekrytering",
      "name": "Instruktörskurs Rekrytering",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som instruktör vid rekryteringsinsatser inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör vid rekrytering och introduktion av nya medlemmar.",
      "syllabus": "Pedagogik och metodik för rekryteringsutbildning, kommunikation, presentationsteknik, Försvarsmaktens värdegrund, samt praktiska övningar i att genomföra rekryteringsmoment.",
      "purpose": "Att ge deltagaren förmåga att planera och genomföra rekryteringsutbildning samt introducera nya medlemmar till Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som instruktör vid rekryteringsinsatser inom Hemvärnet.",
      "subGoals": [
        "Redogöra för grundläggande pedagogiska principer vid rekryteringsutbildning.",
        "Planera och genomföra utbildningsmoment för rekrytering.",
        "Tillämpa Försvarsmaktens värdegrund i rekryteringssammanhang.",
        "Kommunicera och motivera nya medlemmar till fortsatt engagemang."
      ],
      "examination": "Löpande bedömning av praktiska och teoretiska moment under kursen.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Lämplighet för instruktörsuppdrag enligt Hemvärnets krav."
      ],
      "literature": "FM Handböcker, utbildningsmaterial från Hemvärnet samt relevanta delar av Försvarsmaktens reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-skjutr-ak-4bc-del-1",
      "name": "Instruktörskurs SkjutR AK 4B/C del 1",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att verka som instruktör i skjutreglemente för automatkarbin 4B/C inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör i skjutreglemente AK 4B/C.",
      "syllabus": "Teori och praktik kring skjutreglemente AK 4B/C, säkerhetsbestämmelser, instruktörsmetodik samt genomförande av skjutövningar.",
      "purpose": "Att deltagaren ska kunna genomföra utbildning och handledning i skjutreglemente AK 4B/C på ett säkert och pedagogiskt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och utvärdera skjututbildning med AK 4B/C enligt gällande reglemente.",
      "subGoals": [
        "Redogöra för och tillämpa säkerhetsbestämmelser vid skjutning med AK 4B/C.",
        "Planera och genomföra skjutövningar enligt skjutreglemente.",
        "Använda pedagogiska metoder för att instruera och handleda skyttar.",
        "Identifiera och åtgärda vanliga fel vid skjutning."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens förmåga att instruera, tillämpa säkerhetsregler och genomföra skjutövningar bedöms fortlöpande.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning (VPL, GMU eller GU).",
        "Godkänd skytt med AK 4B/C.",
        "Rekommenderad erfarenhet av skjututbildning inom Hemvärnet."
      ],
      "literature": "Skjutreglemente AK 4B/C, relevanta Försvarsmaktens handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-skjutr-ak-4bc-del-2",
      "name": "Instruktörskurs SkjutR AK 4B/C del 2",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper och färdigheter för att kunna utbilda och instruera i skjutning med automatkarbin 4B/C inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör i skjutning med AK 4B/C.",
      "syllabus": "Fördjupad vapentjänst, säker vapenhantering, skjutteknik, instruktörsmetodik, praktiska övningar och tillämpad utbildning av skjutmoment.",
      "purpose": "Att deltagaren ska kunna planera, genomföra och utvärdera utbildning i skjutning med AK 4B/C som instruktör inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna verka som instruktör vid skjututbildning med AK 4B/C.",
      "subGoals": [
        "Redogöra för och tillämpa säkerhetsbestämmelser vid skjutning med AK 4B/C.",
        "Planera och genomföra utbildningsmoment i skjutning enligt gällande reglementen.",
        "Instruera och handleda deltagare i skjutteknik och vapenhantering.",
        "Bedöma och utvärdera deltagarnas färdigheter och utvecklingsbehov."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens förmåga att instruera och tillämpa säkerhetsrutiner samt genomföra skjututbildning bedöms.",
      "prerequisites": [
        "Genomförd grundläggande instruktörsutbildning.",
        "Godkänd utbildning i skjutning med AK 4B/C.",
        "Uppfyller fysiska och medicinska krav för tjänstgöring inom Hemvärnet."
      ],
      "literature": "Gällande handböcker, reglementen och utbildningsmaterial för AK 4B/C samt Försvarsmaktens säkerhetsbestämmelser.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-stabstjänst",
      "name": "Instruktörskurs stabstjänst",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper och färdigheter i att utbilda och handleda inom stabstjänst för Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör inom stabstjänst.",
      "syllabus": "Pedagogik och metodik för instruktörer, planering och genomförande av utbildning inom stabstjänst, övningsledning, sambands- och rapporteringsrutiner, samt praktiska övningar i stabsarbete.",
      "purpose": "Att deltagaren ska kunna utbilda och handleda andra inom stabstjänst på förbandsnivå.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna planera, genomföra och utvärdera utbildning inom stabstjänst för Hemvärnet.",
      "subGoals": [
        "Redogöra för grunderna i stabstjänst och dess tillämpning inom Hemvärnet.",
        "Planera och genomföra utbildningsmoment inom stabstjänst.",
        "Använda pedagogiska metoder anpassade för vuxenutbildning.",
        "Leda och utvärdera övningar inom stabstjänst."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att planera och genomföra utbildningsmoment samt praktisk examination i att leda utbildning inom stabstjänst.",
      "prerequisites": [
        "Genomförd grundläggande stabstjänstutbildning.",
        "Tidigare erfarenhet av stabsarbete inom Hemvärnet."
      ],
      "literature": "Handböcker och reglementen för stabstjänst inom Hemvärnet samt Försvarsmaktens utbildningsmaterial.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-säkr-avlyst-terräng",
      "name": "Instruktörskurs SäkR avlyst terräng",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskap och färdighet för att kunna utbilda och leda verksamhet enligt Säkerhetsreglemente för avlyst terräng inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör vid övningar och utbildning i avlyst terräng.",
      "syllabus": "Genomgång av Säkerhetsreglemente för avlyst terräng, planering och genomförande av utbildning, riskbedömning, säkerhetsrutiner samt praktiska övningar i instruktörsrollen.",
      "purpose": "Att ge deltagaren förmåga att på ett säkert och korrekt sätt instruera och leda verksamhet i avlyst terräng enligt gällande säkerhetsreglemente.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som instruktör för verksamhet i avlyst terräng inom Hemvärnet.",
      "subGoals": [
        "Redogöra för och tillämpa Säkerhetsreglemente för avlyst terräng.",
        "Planera och genomföra utbildning och övningar i avlyst terräng.",
        "Genomföra riskbedömningar och säkerställa efterlevnad av säkerhetsrutiner.",
        "Agera som instruktör och föregå med gott exempel i säkerhetsfrågor."
      ],
      "examination": "Löpande bedömning under kursen samt praktiskt prov där deltagaren visar förmåga att instruera och leda verksamhet enligt säkerhetsreglementet.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Tidigare erfarenhet av verksamhet i avlyst terräng är önskvärd."
      ],
      "literature": "Säkerhetsreglemente för avlyst terräng, relevanta Försvarsmaktens handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-säkr-skjutbana",
      "name": "Instruktörskurs SäkR skjutbana",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger kunskap och färdighet för att kunna utbilda och verka som instruktör i säkerhetsreglemente (SäkR) på skjutbana inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska utbilda eller ansvara för säkerheten vid skjutbanor.",
      "syllabus": "Genomgång av säkerhetsreglemente för skjutbana, instruktörsmetodik, riskbedömning, praktiska övningar i säker vapenhantering och tillämpning av SäkR på skjutbana.",
      "purpose": "Att deltagaren ska kunna utbilda och handleda andra i säkerhetsreglemente på skjutbana samt ansvara för säkerheten vid skjutövningar.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som instruktör i SäkR på skjutbana inom Hemvärnet.",
      "subGoals": [
        "Redogöra för och tillämpa säkerhetsreglemente för skjutbana.",
        "Genomföra riskbedömning och säkerhetskontroller vid skjutövningar.",
        "Utbilda andra i säker vapenhantering och SäkR på skjutbana.",
        "Agera som instruktör och säkerhetsansvarig vid skjutövningar."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens förmåga att tillämpa SäkR och agera instruktör på skjutbana bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd vapenutbildning enligt Hemvärnets krav."
      ],
      "literature": "Säkerhetsreglemente för skjutbana (SäkR), Försvarsmaktens handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-tårgas",
      "name": "Instruktörskurs Tårgas",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna utbilda och leda moment med tårgas inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som instruktör vid utbildning med tårgas.",
      "syllabus": "Teori om tårgas och dess verkan, säkerhetsbestämmelser, hantering och användning av tårgas, planering och genomförande av utbildningsmoment samt praktiska övningar.",
      "purpose": "Att deltagaren ska kunna genomföra och ansvara för utbildning med tårgas på ett säkert och korrekt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som instruktör vid utbildning med tårgas inom Hemvärnet.",
      "subGoals": [
        "Redogöra för tårgasens egenskaper och verkan.",
        "Tillämpa gällande säkerhetsföreskrifter vid hantering och användning av tårgas.",
        "Planera och genomföra utbildningsmoment med tårgas.",
        "Agera som instruktör och handleda deltagare vid övningar med tårgas."
      ],
      "examination": "Praktisk och teoretisk examination där deltagarens kunskaper om tårgas, säkerhetsrutiner samt instruktörsförmåga bedöms.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Godkänd säkerhetsprövning enligt Försvarsmaktens krav."
      ],
      "literature": "Gällande Försvarsmaktens handböcker och säkerhetsföreskrifter för hantering av tårgas.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-grundkurs-övningsledare-strisim-pc",
      "name": "Instruktörskurs grundkurs övningsledare Strisim PC",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som övningsledare och instruktör vid användning av Strisim PC inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som instruktör eller övningsledare vid Strisim PC-utbildning.",
      "syllabus": "Introduktion till Strisim PC, planering och genomförande av övningar, instruktörsmetodik, felsökning och hantering av vanliga problem, samt praktiska övningar i att leda och utvärdera Strisim PC-övningar.",
      "purpose": "Att ge deltagarna förmåga att självständigt planera, leda och utvärdera utbildning och övningar med Strisim PC.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna agera som instruktör och övningsledare vid Strisim PC-övningar inom Hemvärnet.",
      "subGoals": [
        "Förklara Strisim PC:s funktion och användningsområden.",
        "Planera och genomföra övningar med Strisim PC.",
        "Tillämpa grundläggande instruktörsmetodik vid utbildning.",
        "Identifiera och åtgärda vanliga problem vid användning av Strisim PC.",
        "Utvärdera och återkoppla på genomförda övningar."
      ],
      "examination": "Praktisk och teoretisk prövning där deltagaren visar förmåga att planera, genomföra och utvärdera en Strisim PC-övning.",
      "prerequisites": [
        "Grundläggande datorvana.",
        "Tjänstgöring inom Hemvärnet."
      ],
      "literature": "Instruktionsmaterial för Strisim PC samt relevanta handböcker och anvisningar från Försvarsmakten.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "instruktörskurs-fortsättningskurs-övningsledare-strisim-pc",
      "name": "Instruktörskurs fortsättningskurs övningsledare Strisim PC",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Fördjupningskurs för instruktörer och övningsledare i användning av Strisim PC inom Hemvärnet. Kursen syftar till att utveckla deltagarnas förmåga att planera, leda och utvärdera övningar med hjälp av Strisim PC.",
      "targetAudience": "Avsedd för instruktörer och övningsledare inom Hemvärnet som tidigare genomfört grundläggande utbildning i Strisim PC.",
      "syllabus": "Fördjupad användning av Strisim PC, planering och genomförande av övningar, utvärdering och återkoppling, felsökning och problemlösning, pedagogik för övningsledning.",
      "purpose": "Att ge deltagarna fördjupade kunskaper och färdigheter i att använda Strisim PC som verktyg för övningsledning inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna planera, leda och utvärdera övningar med Strisim PC.",
      "subGoals": [
        "Förklara och tillämpa avancerade funktioner i Strisim PC.",
        "Planera och genomföra övningar med Strisim PC som stöd.",
        "Utvärdera övningar och ge återkoppling till deltagare.",
        "Hantera vanliga problem och felsökning i Strisim PC-miljö."
      ],
      "examination": "Löpande bedömning under kursen samt praktiskt prov där deltagaren planerar och leder en övning med Strisim PC.",
      "prerequisites": [
        "Genomförd grundläggande instruktörskurs i Strisim PC.",
        "Erfarenhet av övningsledning inom Hemvärnet."
      ],
      "literature": "Handbok Strisim PC, Försvarsmaktens instruktioner och anvisningar för övningsledning.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "halvar-huvudinstruktörskurs",
      "name": "HALVAR Huvudinstruktörskurs",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att utbilda och förbereda instruktörer för rollen som huvudinstruktör inom HALVAR-systemet i Hemvärnet. Deltagarna får fördjupade kunskaper i utbildningsmetodik, planering och genomförande av utbildning samt ledarskap och ansvar kopplat till instruktörsrollen.",
      "targetAudience": "Avsedd för dig som är eller ska bli huvudinstruktör inom HALVAR-systemet i Hemvärnet.",
      "syllabus": "Utbildningsmetodik, planering och genomförande av utbildning, ledarskap, ansvar och uppföljning, samt fördjupning i HALVAR-systemets funktion och användning.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att självständigt kunna verka som huvudinstruktör inom HALVAR-systemet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och utvärdera utbildning inom HALVAR-systemet som huvudinstruktör.",
      "subGoals": [
        "Förklara huvudinstruktörens roll och ansvar inom HALVAR-systemet.",
        "Tillämpa utbildningsmetodik och pedagogiska verktyg vid utbildning av instruktörer.",
        "Planera och genomföra utbildningsmoment kopplade till HALVAR-systemet.",
        "Utvärdera och följa upp utbildningsinsatser inom ramen för HALVAR."
      ],
      "examination": "Löpande bedömning samt praktiska och teoretiska moment där deltagarens förmåga att planera, genomföra och utvärdera utbildning inom HALVAR-systemet prövas.",
      "prerequisites": [
        "Genomförd grundläggande instruktörsutbildning inom Hemvärnet eller motsvarande.",
        "Erfarenhet av arbete med HALVAR-systemet rekommenderas."
      ],
      "literature": "Handbok HALVAR, relevanta Försvarsmaktens handböcker och utbildningsmaterial.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "halvar-instruktörskurs",
      "name": "HALVAR Instruktörskurs",
      "shortName": null,
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som instruktör inom HALVAR-systemet i Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska utbilda och instruera i användning av HALVAR-systemet.",
      "syllabus": "Teoretisk genomgång av HALVAR-systemet, praktisk tillämpning, instruktörsmetodik samt övningar i att planera och genomföra utbildning.",
      "purpose": "Att deltagaren ska kunna utbilda och handleda andra i användning av HALVAR-systemet inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna verka som instruktör för HALVAR-systemet.",
      "subGoals": [
        "Förklara HALVAR-systemets funktion och användningsområden.",
        "Planera och genomföra utbildningspass om HALVAR-systemet.",
        "Tillämpa grundläggande instruktörsmetodik vid utbildning.",
        "Felsöka och hantera vanliga problem vid användning av HALVAR-systemet."
      ],
      "examination": "Bedömning sker genom praktiska och teoretiska moment där deltagaren visar förmåga att instruera och hantera HALVAR-systemet.",
      "prerequisites": [
        "Grundläggande militär utbildning.",
        "Erfarenhet av Hemvärnets verksamhet."
      ],
      "literature": "Instruktionsmaterial för HALVAR-systemet samt relevanta handböcker från Försvarsmakten.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "anställda-vid-utbildningsgrupp",
      "name": "Anställda vid utbildningsgrupp",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen riktar sig till anställda vid utbildningsgrupp och ger grundläggande kunskaper om utbildningsgruppens uppgifter, organisation och arbetsmetoder inom Hemvärnet.",
      "targetAudience": "Anställda vid utbildningsgrupp inom Hemvärnet.",
      "syllabus": "Utbildningsgruppens roll och ansvar, organisation, planering och genomförande av utbildning, samverkan med frivilligorganisationer samt administrativa rutiner.",
      "purpose": "Att ge deltagarna de kunskaper och färdigheter som krävs för att effektivt kunna arbeta inom en utbildningsgrupp.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som anställd vid utbildningsgrupp och bidra till planering och genomförande av utbildningsverksamhet inom Hemvärnet.",
      "subGoals": [
        "Redogöra för utbildningsgruppens organisation och uppgifter.",
        "Tillämpa grundläggande administrativa rutiner och processer.",
        "Planera och stödja genomförande av utbildning inom Hemvärnet.",
        "Samverka med frivilligorganisationer och andra aktörer."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att tillämpa kursens innehåll genom praktiska och teoretiska moment.",
      "prerequisites": [],
      "literature": "FM Handböcker och interna styrdokument för utbildningsgrupper.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "anställda-vid-mr-grupp",
      "name": "Anställda vid MR-grupp",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för personal som är eller ska bli anställda vid MR-grupp inom Hemvärnet.",
      "targetAudience": "Avsedd för dig som är eller ska tjänstgöra som anställd vid MR-grupp.",
      "syllabus": "Introduktion till MR-gruppens uppgifter, organisation och rutiner. Genomgång av relevanta arbetsuppgifter, säkerhetsföreskrifter samt samverkan inom Hemvärnet.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att kunna verka som anställd vid MR-grupp.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna utföra sina arbetsuppgifter som anställd vid MR-grupp på ett säkert och korrekt sätt.",
      "subGoals": [
        "Förstå MR-gruppens roll och ansvar inom Hemvärnet.",
        "Kunna tillämpa säkerhetsrutiner och arbetsprocesser.",
        "Känna till och följa gällande instruktioner och regelverk."
      ],
      "examination": "Löpande bedömning av deltagarens förmåga att utföra arbetsuppgifter enligt kursens mål.",
      "prerequisites": [],
      "literature": "Aktuella handböcker, instruktioner och reglementen för MR-grupp.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "fredsadministrativkurs",
      "name": "Fredsadministrativkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper i administration och rutiner som krävs för att hantera fredstida administrativa uppgifter inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som har eller kommer att få administrativa uppgifter på kompaninivå eller motsvarande.",
      "syllabus": "Administrativa rutiner, dokumenthantering, rapportering, personaladministration, registerhantering och tillämpning av Försvarsmaktens administrativa system.",
      "purpose": "Att deltagaren ska kunna utföra administrativa uppgifter enligt gällande rutiner och regelverk inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera fredstida administrativa arbetsuppgifter inom Hemvärnet.",
      "subGoals": [
        "Redogöra för grundläggande administrativa rutiner inom Hemvärnet.",
        "Tillämpa Försvarsmaktens administrativa system och verktyg.",
        "Hantera och arkivera dokument enligt gällande bestämmelser.",
        "Utföra personaladministration och rapportering på kompaninivå."
      ],
      "examination": "Löpande bedömning av praktiska och teoretiska moment under kursen.",
      "prerequisites": [
        "Grundläggande soldatutbildning eller motsvarande erfarenhet."
      ],
      "literature": "Försvarsmaktens administrativa handböcker och aktuella reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "fordon-förare-pb8",
      "name": "Fordon Förare PB8",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande utbildning för att framföra och hantera personbil 8 (PB8) inom Hemvärnet. Fokus ligger på säker körning, fordonshantering och tillämpning av Försvarsmaktens regler för militär fordonsförare.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som förare av PB8.",
      "syllabus": "Fordonsteknik, säkerhetsbestämmelser, körteknik, daglig tillsyn, lastning och lossning, samt praktisk körning i varierande miljöer.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att framföra PB8 på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna framföra och hantera PB8 inom ramen för Hemvärnets verksamhet.",
      "subGoals": [
        "Redogöra för och tillämpa gällande säkerhetsregler vid framförande av PB8.",
        "Utföra daglig tillsyn och enklare underhåll av fordonet.",
        "Visa förmåga att framföra PB8 under olika förhållanden och i varierande terräng.",
        "Kunna lasta och lossa fordonet på ett säkert sätt."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens förmåga att framföra PB8 och tillämpa säkerhetsbestämmelser bedöms.",
      "prerequisites": [
        "Inneha giltigt B-körkort.",
        "Godkänd säkerhetsprövning enligt Försvarsmaktens krav."
      ],
      "literature": "Försvarsmaktens handböcker och reglementen för fordonsförare samt instruktionsbok för PB8.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "halvar-figurantkurs",
      "name": "HALVAR Figurantkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att agera figurant vid HALVAR-utbildningar inom Hemvärnet. Fokus ligger på att skapa realistiska övningsmoment för att stödja utbildning och träning av förband.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som figurant vid HALVAR-utbildningar och övningar.",
      "syllabus": "Rollspel och agerande som figurant, säkerhetsrutiner vid övningar, kommunikation med instruktörer, samt grundläggande förståelse för HALVAR-systemet.",
      "purpose": "Att deltagaren ska kunna medverka som figurant på ett säkert och ändamålsenligt sätt vid HALVAR-utbildningar.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna agera som figurant vid HALVAR-utbildningar enligt gällande rutiner och säkerhetsföreskrifter.",
      "subGoals": [
        "Förstå och tillämpa säkerhetsrutiner vid figurantverksamhet.",
        "Agera trovärdigt och pedagogiskt i olika övningsmoment.",
        "Samarbeta med instruktörer och övriga deltagare för att skapa realistiska utbildningssituationer.",
        "Känna till grunderna i HALVAR-systemet och dess användning vid utbildning."
      ],
      "examination": "Löpande bedömning av deltagarens agerande som figurant under praktiska övningar.",
      "prerequisites": [
        "Grundläggande militär utbildning eller motsvarande erfarenhet.",
        "God fysisk och psykisk status."
      ],
      "literature": "Instruktionsmaterial för HALVAR-utbildning samt relevanta säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "hemvärns-personnel-recovery-officerskurs-(hv-pr-o)",
      "name": "Hemvärns Personnel Recovery Officerskurs (Hv PR-O)",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper om Personnel Recovery (PR) och rollen som PR Officer inom Hemvärnet. Deltagarna får förståelse för PR-processen, planering och genomförande av insatser för att återta personal i händelse av isolering eller tillfångatagande.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som PR Officer eller har behov av fördjupad kunskap inom Personnel Recovery.",
      "syllabus": "Introduktion till Personnel Recovery, PR-processen, roller och ansvar, planering och ledning av PR-insatser, samverkan med andra förband och myndigheter, samt tillämpade övningar.",
      "purpose": "Att ge deltagaren förmåga att verka som PR Officer inom Hemvärnet och kunna planera, leda och samordna PR-insatser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna agera som PR Officer och tillämpa PR-processen inom Hemvärnet.",
      "subGoals": [
        "Förklara grunderna i Personnel Recovery och PR-processen.",
        "Redogöra för PR Officerens roll och ansvar inom Hemvärnet.",
        "Planera och leda enklare PR-insatser.",
        "Samverka med andra aktörer vid PR-händelser.",
        "Tillämpa kunskaperna i praktiska övningar."
      ],
      "examination": "Löpande bedömning under kursen samt praktiska övningar där deltagarens förmåga att tillämpa PR-processen och agera som PR Officer utvärderas.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Tjänstgöring inom Hemvärnet."
      ],
      "literature": "FM handböcker och reglementen avseende Personnel Recovery samt kompletterande utbildningsmaterial från Försvarsmakten.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "informatörwebredaktör-bataljon",
      "name": "Informatör/webredaktör bataljon",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att verka som informatör och webbredaktör på bataljonsnivå inom Hemvärnet. Fokus ligger på informationshantering, intern och extern kommunikation samt hantering av digitala kanaler.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som är eller ska placeras som informatör eller webbredaktör på bataljonsnivå.",
      "syllabus": "Informationshantering, grundläggande kommunikationsteori, arbete med Försvarsmaktens digitala plattformar, publicering och uppdatering av information, kriskommunikation samt riktlinjer för intern och extern kommunikation.",
      "purpose": "Att ge deltagaren förutsättningar att självständigt kunna arbeta som informatör och webbredaktör på bataljonsnivå inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, producera och publicera information enligt Försvarsmaktens riktlinjer samt hantera bataljonens digitala informationskanaler.",
      "subGoals": [
        "Förstå och tillämpa Försvarsmaktens riktlinjer för informationshantering.",
        "Självständigt kunna publicera och uppdatera information på bataljonens digitala plattformar.",
        "Kunna planera och genomföra intern och extern kommunikation.",
        "Känna till grunderna i kriskommunikation och informationssäkerhet."
      ],
      "examination": "Löpande bedömning av praktiska moment samt genomförande av övningsuppgifter inom informationshantering och publicering.",
      "prerequisites": [
        "Grundläggande datorkunskaper.",
        "God förmåga att uttrycka sig i tal och skrift på svenska."
      ],
      "literature": "Försvarsmaktens handböcker och riktlinjer för informationshantering och kommunikation.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "is-hv-super-user",
      "name": "IS Hv Super User",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupad kunskap och färdighet i att hantera och administrera informationssystem inom Hemvärnet på avancerad nivå.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka som superanvändare av informationssystem.",
      "syllabus": "Fördjupad systemadministration, användarhantering, felsökning, säkerhetsrutiner samt praktiska övningar i informationssystemets funktioner.",
      "purpose": "Att deltagaren ska kunna stödja och utbilda andra användare samt säkerställa driften av informationssystem inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna agera som superanvändare och administratör av Hemvärnets informationssystem.",
      "subGoals": [
        "Förstå och tillämpa avancerade funktioner i informationssystemet.",
        "Genomföra användaradministration och behörighetsstyrning.",
        "Felsöka och åtgärda vanliga problem i systemet.",
        "Utbilda och stödja andra användare i systemets användning.",
        "Tillämpa säkerhetsrutiner enligt Försvarsmaktens riktlinjer."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens förmåga att hantera och administrera systemet utvärderas.",
      "prerequisites": [
        "Grundläggande utbildning i Hemvärnets informationssystem.",
        "Vana vid datoranvändning och administrativa uppgifter."
      ],
      "literature": "Systemmanualer, Försvarsmaktens handböcker och relevanta reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "is-hv-teknikerkurs",
      "name": "IS Hv Teknikerkurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i att hantera, driftsätta och underhålla informationssystem inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som tekniker för informationssystem.",
      "syllabus": "Introduktion till Försvarsmaktens informationssystem, teknisk hantering, felsökning, driftsättning, underhåll och säkerhetsrutiner.",
      "purpose": "Att deltagaren ska kunna stödja förbandet genom att självständigt hantera och underhålla informationssystem inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som IS-tekniker inom Hemvärnet.",
      "subGoals": [
        "Förstå och tillämpa grundläggande principer för informationssystem inom Hemvärnet.",
        "Utföra driftsättning och felsökning av informationssystem.",
        "Tillämpa säkerhetsrutiner vid hantering av teknisk utrustning.",
        "Ge tekniskt stöd till användare inom förbandet."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens färdigheter i hantering, felsökning och driftsättning av informationssystem bedöms fortlöpande under kursen.",
      "prerequisites": [
        "Grundläggande militär utbildning (GMU/VPL/GU) eller motsvarande.",
        "Intresse och viss erfarenhet av teknisk utrustning är meriterande."
      ],
      "literature": "Aktuella handböcker och instruktioner för Försvarsmaktens informationssystem.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "krigsförbandsplaneringskurs",
      "name": "Krigsförbandsplaneringskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger kunskap om planering och genomförande av verksamhet på krigsförbandsnivå inom Hemvärnet. Deltagarna får fördjupad förståelse för planeringsprocessen, ordergivning och samordning av förbandets resurser.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som har eller ska ha ansvar för planering på krigsförbandsnivå.",
      "syllabus": "Planeringsmetodik, ordergivning, samordning av resurser, tillämpning av Försvarsmaktens planeringsprocess samt praktiska övningar i krigsförbandsplanering.",
      "purpose": "Att ge deltagarna förmåga att självständigt planera och leda verksamhet på krigsförbandsnivå inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna tillämpa Försvarsmaktens planeringsprocess och genomföra krigsförbandsplanering inom Hemvärnet.",
      "subGoals": [
        "Förstå och tillämpa Försvarsmaktens planeringsprocess.",
        "Utforma och delge order på krigsförbandsnivå.",
        "Samordna resurser och verksamhet inom ramen för krigsförbandets uppgifter.",
        "Genomföra praktiska övningar i planering och ledning."
      ],
      "examination": "Löpande bedömning samt praktiska övningar och redovisningar under kursen.",
      "prerequisites": [
        "Tidigare genomförd chefsutbildning eller motsvarande erfarenhet inom Hemvärnet."
      ],
      "literature": "FM Handböcker, reglementen och aktuella styrdokument för krigsförbandsplanering.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "kvartermästarkurs-1",
      "name": "Kvartermästarkurs 1",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att kunna verka som kvartermästare inom Hemvärnet. Fokus ligger på logistik, materielhantering och försörjningstjänst.",
      "targetAudience": "Avsedd för dig som är eller ska placeras i befattning som kvartermästare inom Hemvärnet.",
      "syllabus": "Grundläggande logistik, materiel- och förrådshantering, beställningsrutiner, transportplanering samt ansvar och arbetsuppgifter för kvartermästare.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att kunna tjänstgöra som kvartermästare i hemvärnsförband.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och genomföra kvartermästarens uppgifter inom Hemvärnet.",
      "subGoals": [
        "Redogöra för kvartermästarens roll och ansvar i hemvärnsförband.",
        "Tillämpa rutiner för materiel- och förrådshantering.",
        "Planera och genomföra försörjningstjänst vid övningar och insatser.",
        "Använda Försvarsmaktens system och regelverk för logistik och beställningar."
      ],
      "examination": "Löpande praktiska och teoretiska moment där deltagarens förmåga att lösa kvartermästaruppgifter bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning (GU, GMU eller motsvarande)."
      ],
      "literature": "Försvarsmaktens handböcker och reglementen för logistik och materieltjänst.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "kvartermästarkurs-2",
      "name": "Kvartermästarkurs 2",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Fördjupande kurs för kvartermästare inom Hemvärnet med fokus på planering, ledning och genomförande av försörjningstjänst på plutons- och kompaninivå.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som kvartermästare inom Hemvärnet.",
      "syllabus": "Planering och ledning av försörjningstjänst, materiel- och förrådshantering, logistik, beställningsrutiner samt tillämpade övningar.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter för att självständigt kunna verka som kvartermästare inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera, leda och genomföra försörjningstjänst på plutons- och kompaninivå inom Hemvärnet.",
      "subGoals": [
        "Redogöra för kvartermästarens ansvar och arbetsuppgifter.",
        "Tillämpa rutiner för materiel- och förrådshantering.",
        "Planera och genomföra försörjningstjänst vid övning och insats.",
        "Samarbeta med andra funktioner inom förbandet för att säkerställa logistiken."
      ],
      "examination": "Löpande bedömning samt praktiska och teoretiska moment där deltagarens förmåga att planera och leda försörjningstjänst utvärderas.",
      "prerequisites": [
        "Genomförd Kvartermästarkurs 1 eller motsvarande kunskaper.",
        "Grundläggande militär utbildning."
      ],
      "literature": "Handbok för kvartermästare, Försvarsmaktens reglementen och anvisningar.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "marin-hemvärnstaktik",
      "name": "Marin hemvärnstaktik",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper i taktik och stridsteknik för marin hemvärnsverksamhet. Deltagaren får ökad förståelse för marina förbandens uppgifter, metoder och samverkan inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som tjänstgör eller ska tjänstgöra i marina förband eller har behov av kunskap om marin taktik.",
      "syllabus": "Marina förbandens organisation och uppgifter, grundläggande marin taktik, stridsteknik i kustnära miljö, ledning och samverkan, tillämpade övningar.",
      "purpose": "Att ge deltagaren förmåga att tillämpa grundläggande taktiska principer och stridsteknik inom marin hemvärnsverksamhet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka inom marina hemvärnsförband med förståelse för taktiska principer och samverkan.",
      "subGoals": [
        "Redogöra för marina hemvärnsförbands organisation och uppgifter.",
        "Tillämpa grundläggande taktiska principer i kustnära miljö.",
        "Genomföra enklare ledning och samverkan inom marina hemvärnsförband.",
        "Delta i tillämpade övningar med fokus på marin taktik och stridsteknik."
      ],
      "examination": "Löpande bedömning under praktiska och teoretiska moment samt deltagande i tillämpade övningar.",
      "prerequisites": [
        "Genomförd grundläggande militär utbildning eller motsvarande.",
        "Lämplig fysisk status för tjänstgöring i marin miljö."
      ],
      "literature": "Handbok för marin hemvärnsverksamhet, relevanta FM handböcker och reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "nordisk-chefskurs",
      "name": "Nordisk chefskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen syftar till att ge deltagarna fördjupade kunskaper och erfarenhetsutbyte inom ledarskap och samarbete mellan de nordiska hemvärnsorganisationerna.",
      "targetAudience": "Avsedd för chefer och befäl inom Hemvärnet som har behov av att utveckla sin förmåga att samarbeta och leda i en nordisk kontext.",
      "syllabus": "Ledarskap i multinationella miljöer, nordiskt samarbete, erfarenhetsutbyte, gemensamma övningar och seminarier.",
      "purpose": "Att stärka deltagarnas ledarskapsförmåga och förståelse för samverkan mellan de nordiska hemvärnsförbanden.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna tillämpa kunskap om ledarskap och samarbete i nordiska hemvärnssammanhang.",
      "subGoals": [
        "Förklara skillnader och likheter mellan de nordiska hemvärnsorganisationerna.",
        "Tillämpa ledarskap i multinationella grupper.",
        "Bidra till ökat erfarenhetsutbyte och samverkan mellan nordiska hemvärnsförband."
      ],
      "examination": "Löpande bedömning av deltagande i övningar, seminarier och grupparbeten.",
      "prerequisites": [
        "Tjänstgöring som chef eller befäl inom Hemvärnet.",
        "Godkänd grundläggande chefsutbildning."
      ],
      "literature": "Utvalda nordiska handböcker och utbildningsmaterial, samt kurskompendium.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "scanbal",
      "name": "Scanbal",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i användning av Scanbal-systemet inom Hemvärnet. Fokus ligger på praktisk hantering, tillämpning och förståelse för systemets funktion och användningsområden.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska använda eller stödja verksamhet med Scanbal-systemet.",
      "syllabus": "Introduktion till Scanbal-systemet, säkerhetsföreskrifter, praktisk hantering, felsökning samt tillämpade övningar.",
      "purpose": "Att deltagaren ska kunna använda Scanbal-systemet på ett säkert och effektivt sätt inom ramen för Hemvärnets verksamhet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera och tillämpa Scanbal-systemet i sin befattning.",
      "subGoals": [
        "Förklara Scanbal-systemets uppbyggnad och funktion.",
        "Tillämpa säkerhetsrutiner vid användning av Scanbal.",
        "Genomföra grundläggande felsökning och underhåll.",
        "Använda Scanbal i praktiska övningar."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens förmåga att hantera och tillämpa Scanbal-systemet bedöms fortlöpande under kursen.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning eller motsvarande."
      ],
      "literature": "Instruktionsmaterial och handböcker för Scanbal-systemet samt relevanta Försvarsmaktens reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "stabschefskurs",
      "name": "Stabschefskurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger fördjupad kunskap om rollen som stabschef inom hemvärnsbataljon, med fokus på ledning, samordning och arbetsmetoder i bataljonsstab.",
      "targetAudience": "Avsedd för dig som är eller ska placeras som stabschef i hemvärnsbataljon.",
      "syllabus": "Stabschefens roll och ansvar, arbetsmetodik i bataljonsstab, planering och ledning av stabens arbete, samverkan inom och utom förbandet, samt tillämpade övningar.",
      "purpose": "Att ge deltagaren förutsättningar att verka som stabschef i hemvärnsbataljon.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna leda och samordna bataljonsstabens arbete enligt Försvarsmaktens riktlinjer.",
      "subGoals": [
        "Redogöra för stabschefens roll och ansvar inom hemvärnsbataljon.",
        "Tillämpa arbetsmetodik för planering och ledning i bataljonsstab.",
        "Samordna och leda stabens arbete vid olika typer av insatser.",
        "Samverka med andra funktioner och externa aktörer."
      ],
      "examination": "Löpande bedömning genom praktiska och teoretiska moment samt tillämpade övningar i stabsmiljö.",
      "prerequisites": [
        "Genomförd grundläggande chefsutbildning eller motsvarande.",
        "Tjänstgöring eller planerad placering som stabschef i hemvärnsbataljon."
      ],
      "literature": "FM handböcker, reglementen samt utbildningsmaterial från HvSS.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "grundkurs-stabstjänst",
      "name": "Grundkurs Stabstjänst",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper i stabstjänst inom Hemvärnet, med fokus på stabens arbetsmetoder, rutiner och samverkan vid ledning av förband.",
      "targetAudience": "Avsedd för personal som ska tjänstgöra i stab inom Hemvärnet.",
      "syllabus": "Stabens organisation och arbetsmetoder, ordergivning, rapportering, sambandsrutiner, informationshantering samt praktiska övningar i stabsmiljö.",
      "purpose": "Att ge deltagaren grundläggande kunskaper och färdigheter för att kunna tjänstgöra i stab inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna arbeta i en stab och tillämpa grundläggande stabstjänst inom Hemvärnet.",
      "subGoals": [
        "Redogöra för stabens uppgifter och organisation.",
        "Tillämpa grundläggande rutiner för ordergivning och rapportering.",
        "Använda relevanta sambands- och informationssystem i stabsmiljö.",
        "Delta i och bidra till stabens arbetsprocesser vid ledning av förband."
      ],
      "examination": "Löpande bedömning genom praktiska övningar och moment i stabsmiljö.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning (GU, GMU eller motsvarande)."
      ],
      "literature": "FM handböcker och reglementen för stabstjänst samt relevanta instruktioner från Hemvärnet.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "grundkurs-störa",
      "name": "Grundkurs Störa",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i att planera, genomföra och utvärdera störverksamhet inom Hemvärnet. Teori varvas med praktiska övningar för att ge deltagarna en god förståelse för störningens roll i förbandets verksamhet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra i befattning med ansvar för eller deltagande i störverksamhet.",
      "syllabus": "Störteori, materielkunskap, planering och genomförande av störinsatser, säkerhetsbestämmelser, sambandsrutiner samt praktiska övningar i fält.",
      "purpose": "Att ge deltagaren grundläggande kunskaper och färdigheter för att kunna delta i och genomföra störverksamhet inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna planera och genomföra enklare störinsatser enligt gällande instruktioner och säkerhetsföreskrifter.",
      "subGoals": [
        "Redogöra för grunderna i störteori och dess tillämpning inom Hemvärnet.",
        "Hantera och använda aktuell störmateriel på ett säkert och korrekt sätt.",
        "Planera och genomföra enklare störinsatser i samverkan med andra funktioner.",
        "Tillämpa gällande säkerhetsbestämmelser vid störverksamhet."
      ],
      "examination": "Löpande bedömning under kursen genom praktiska och teoretiska moment. Godkänd kurs kräver aktivt deltagande och uppvisad förmåga att genomföra störinsatser enligt instruktion.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning (GU, GMU eller motsvarande).",
        "Godkänd säkerhetsprövning enligt Försvarsmaktens krav."
      ],
      "literature": "Aktuella handböcker och instruktioner för störverksamhet inom Hemvärnet samt Försvarsmaktens säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "grundkurs-underrättelsetjänst-hv",
      "name": "Grundkurs Underrättelsetjänst Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper i underrättelsetjänst inom Hemvärnet, med fokus på inhämtning, bearbetning och rapportering av information för att stödja förbandets verksamhet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra i underrättelsebefattning eller har behov av grundläggande kunskaper i underrättelsetjänst.",
      "syllabus": "Grunder i underrättelsetjänst, inhämtning och bearbetning av information, rapportering, säkerhetstjänst, tillämpade övningar och samverkan inom förbandet.",
      "purpose": "Att ge deltagaren grundläggande förståelse och färdigheter för att kunna verka i underrättelsebefattning inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna utföra grundläggande underrättelsetjänst inom Hemvärnet och bidra till förbandets underrättelsearbete.",
      "subGoals": [
        "Redogöra för underrättelsetjänstens syfte och grundläggande arbetsmetoder.",
        "Tillämpa metoder för inhämtning och bearbetning av information.",
        "Rapportera och dokumentera underrättelseinformation enligt gällande rutiner.",
        "Förstå och tillämpa säkerhetsaspekter inom underrättelsetjänst.",
        "Samverka med övriga funktioner inom förbandet i underrättelsearbetet."
      ],
      "examination": "Löpande bedömning under praktiska och teoretiska moment samt avslutande övning där deltagarens förmåga att tillämpa kursens innehåll prövas.",
      "prerequisites": [
        "Genomförd grundutbildning för Hemvärnet eller motsvarande.",
        "Lämplig fysisk och psykisk status för tjänstgöring i Hemvärnet."
      ],
      "literature": "FM handböcker och reglementen för underrättelsetjänst samt kompletterande utbildningsmaterial från HvSS.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "vaktb-kurs",
      "name": "VaktB kurs",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter för att tjänstgöra som vakt inom Hemvärnet. Fokus ligger på bevakningstjänst, säkerhetsrutiner och tillämpning av relevanta regelverk.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som vakt eller har behov av fördjupade kunskaper inom bevakningstjänst.",
      "syllabus": "Bevakningstjänst, säkerhetsrutiner, rapportering, tillämpning av regelverk, praktiska övningar i vaktuppgifter.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att kunna tjänstgöra som vakt inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna utföra vaktuppgifter enligt gällande regelverk och rutiner inom Hemvärnet.",
      "subGoals": [
        "Förstå och tillämpa säkerhetsrutiner vid bevakningstjänst.",
        "Kunna rapportera och agera vid incidenter.",
        "Känna till och följa relevanta regelverk och instruktioner för vaktpersonal.",
        "Genomföra praktiska vaktuppgifter på ett korrekt och säkert sätt."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens förmåga att utföra vaktuppgifter och tillämpa säkerhetsrutiner bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning eller motsvarande."
      ],
      "literature": "Gällande handböcker och instruktioner för bevakningstjänst inom Hemvärnet.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "stridsledning-sensor-hund-hv",
      "name": "Stridsledning Sensor Hund Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i att leda och samordna insatser med sensorsystem och hund inom Hemvärnet. Fokus ligger på stridsledning, sambandsrutiner och effektivt utnyttjande av sensorer och hundekipage i olika typer av uppgifter.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra i befattning med ansvar för stridsledning av sensor- och hundresurser.",
      "syllabus": "Stridsledning av sensor- och hundresurser, sambands- och rapporteringsrutiner, samverkan mellan olika funktioner, tillämpade övningar och praktiska moment.",
      "purpose": "Att deltagaren ska kunna leda och samordna insatser med sensorsystem och hund inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna verka som stridsledare för sensor- och hundresurser inom Hemvärnet.",
      "subGoals": [
        "Förklara och tillämpa grundläggande principer för stridsledning av sensor- och hundresurser.",
        "Genomföra sambands- och rapporteringsrutiner enligt gällande bestämmelser.",
        "Samverka med andra funktioner inom Hemvärnet vid insatser.",
        "Planera och leda enklare uppdrag med sensor- och hundresurser."
      ],
      "examination": "Löpande bedömning under kursen genom praktiska övningar och moment där deltagarens förmåga att leda och samordna sensor- och hundresurser utvärderas.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning inom Hemvärnet.",
        "Lämplig befattning eller planerad placering inom sensor- eller hundfunktion."
      ],
      "literature": "Aktuella handböcker och reglementen för sensor- och hundtjänst inom Hemvärnet.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "säkerhetstjänstkurs-hv",
      "name": "Säkerhetstjänstkurs Hv",
      "shortName": null,
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper i säkerhetstjänst inom Hemvärnet, med fokus på att förebygga, upptäcka och hantera säkerhetshot mot verksamheten.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra med ansvar för säkerhetstjänst eller behöver grundläggande förståelse för säkerhetsarbetet.",
      "syllabus": "Säkerhetshot, skyddsvärda uppgifter, informationssäkerhet, fysisk säkerhet, rapporteringsrutiner samt tillämpade övningar och scenarier.",
      "purpose": "Att ge deltagaren kunskap och förståelse för säkerhetstjänstens betydelse och tillämpning inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna identifiera och hantera grundläggande säkerhetshot samt tillämpa säkerhetsrutiner inom Hemvärnet.",
      "subGoals": [
        "Redogöra för grundläggande begrepp inom säkerhetstjänst.",
        "Identifiera och rapportera säkerhetshot och avvikelser.",
        "Tillämpa rutiner för informations- och fysisk säkerhet.",
        "Förstå och följa Försvarsmaktens regelverk för säkerhetstjänst."
      ],
      "examination": "Löpande bedömning genom praktiska övningar och teoretiska moment. Kursen avslutas med ett kunskapstest.",
      "prerequisites": [
        "Genomförd grundutbildning inom Hemvärnet eller motsvarande."
      ],
      "literature": "Försvarsmaktens handböcker och reglementen inom säkerhetstjänst.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf",
        "hvss-kurskatalog-2025.pdf"
      ]
    },
    {
      "id": "hv-intro-automatkarbin-4",
      "name": "Hv-Intro Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande utbildning i hantering, säkerhet och skjutteknik med automatkarbin 4 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska använda automatkarbin 4.",
      "syllabus": "Vapnets funktion och handhavande, säkerhetsbestämmelser, grundläggande skjutteknik, vapenvård samt praktiska övningar.",
      "purpose": "Att deltagaren ska kunna hantera och använda automatkarbin 4 på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt och säkert kunna hantera och använda automatkarbin 4 inom Hemvärnet.",
      "subGoals": [
        "Redogöra för automatkarbin 4:s funktion och säkerhetsregler.",
        "Utföra grundläggande vapenvård.",
        "Tillämpa säker vapenhantering vid övning och skjutning.",
        "Genomföra grundläggande skjutmoment med automatkarbin 4."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens hantering, säkerhetsmedvetande och skjutskicklighet med automatkarbin 4 bedöms.",
      "prerequisites": [],
      "literature": "Handbok för automatkarbin 4, Försvarsmaktens säkerhetsbestämmelser för vapenhantering.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "basförmåga-8,4-cm-granatgevär",
      "name": "Basförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i hantering och användning av 8,4 cm granatgevär inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra med 8,4 cm granatgevär.",
      "syllabus": "Vapnets funktion och säkerhet, grundläggande skjutteknik, handhavande, ammunitionstyper, riktmedel samt praktiska övningar i skjutning och vapenvård.",
      "purpose": "Att deltagaren ska kunna hantera och använda 8,4 cm granatgevär på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera, ladda och avfyra 8,4 cm granatgevär samt tillämpa säkerhetsbestämmelser.",
      "subGoals": [
        "Redogöra för vapnets uppbyggnad och funktion.",
        "Visa korrekt handhavande och säkerhetsrutiner.",
        "Genomföra grundläggande skjutning med 8,4 cm granatgevär.",
        "Utföra vapenvård enligt gällande instruktioner."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens kunskaper i säkerhet, handhavande och skjutning bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsgenomgång för vapenhantering."
      ],
      "literature": "Handbok för 8,4 cm granatgevär, Försvarsmaktens reglementen och säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "basförmåga-automatkarbin-4",
      "name": "Basförmåga Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i hantering, säkerhet och skjutteknik med automatkarbin 4 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska använda automatkarbin 4 i sin tjänst.",
      "syllabus": "Vapnets funktion och hantering, säkerhetsbestämmelser, grundläggande skjutteknik, vapenvård samt praktiska skjutövningar.",
      "purpose": "Att deltagaren ska kunna hantera och använda automatkarbin 4 på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt och säkert kunna hantera och använda automatkarbin 4 i tjänst.",
      "subGoals": [
        "Redogöra för automatkarbin 4:s funktion och säkerhetsbestämmelser.",
        "Visa korrekt hantering och vapenvård.",
        "Tillämpa grundläggande skjutteknik vid övningsskjutning.",
        "Agera säkert vid all vapenhantering enligt gällande reglementen."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens hantering, säkerhetsmedvetande och skjutskicklighet bedöms.",
      "prerequisites": [
        "Godkänd säkerhetsgenomgång enligt Försvarsmaktens krav."
      ],
      "literature": "Handbok Automatkarbin 4, relevanta Försvarsmaktens reglementen och säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "basförmåga-granattillsats-40mm",
      "name": "Basförmåga Granattillsats 40mm",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i hantering och användning av granattillsats 40mm inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra med eller hantera granattillsats 40mm.",
      "syllabus": "Vapnets funktion och säkerhet, hantering och skjutteknik, ammunitionstyper, säkerhetsbestämmelser samt praktiska övningar.",
      "purpose": "Att deltagaren ska kunna hantera och använda granattillsats 40mm på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt och säkert kunna hantera och använda granattillsats 40mm i tjänst.",
      "subGoals": [
        "Redogöra för granattillsatsens funktion och säkerhetsbestämmelser.",
        "Visa korrekt hantering och laddning av granattillsats 40mm.",
        "Genomföra skjutning med granattillsats 40mm enligt givna instruktioner.",
        "Identifiera och hantera olika ammunitionstyper för granattillsats 40mm."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens hantering, säkerhetsmedvetande och skjutskicklighet bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsgenomgång för vapenhantering."
      ],
      "literature": "Försvarsmaktens handböcker och instruktioner för granattillsats 40mm.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "basförmåga-kulspruta-58",
      "name": "Basförmåga Kulspruta 58",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande utbildning i hantering och användning av Kulspruta 58 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal i Hemvärnet som ska tjänstgöra med Kulspruta 58.",
      "syllabus": "Vapnets funktion och säkerhet, grundläggande skjutteknik, vapenvård, handhavande och tillämpade övningar.",
      "purpose": "Att deltagaren ska kunna hantera och använda Kulspruta 58 på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera, använda och vårda Kulspruta 58.",
      "subGoals": [
        "Förstå och tillämpa säkerhetsbestämmelser för Kulspruta 58.",
        "Utföra grundläggande vapenvård och funktionskontroll.",
        "Genomföra skjutning med Kulspruta 58 enligt givna instruktioner.",
        "Hantera vapnet under olika förhållanden och i tillämpade övningar."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens hantering, säkerhetsmedvetande och skjutskicklighet med Kulspruta 58 bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning eller motsvarande.",
        "Godkänd säkerhetsgenomgång för vapenhantering."
      ],
      "literature": "Handbok Kulspruta 58, relevanta Försvarsmaktens reglementen och instruktioner.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "basförmåga-pansarskott-m86",
      "name": "Basförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande kunskaper och färdigheter i hantering och användning av pansarskott m/86 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska utbildas i och hantera pansarskott m/86.",
      "syllabus": "Vapnets funktion och säkerhetsbestämmelser, hantering och skjutteknik, riktmedel och avståndsbedömning, praktiska övningar i laddning och avfyring samt åtgärder vid fel och risker.",
      "purpose": "Att deltagaren ska kunna hantera och använda pansarskott m/86 på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt och säkert kunna hantera och använda pansarskott m/86 i enlighet med gällande instruktioner.",
      "subGoals": [
        "Redogöra för pansarskott m/86:s funktion och säkerhetsregler.",
        "Visa korrekt hantering och skjutteknik.",
        "Identifiera och åtgärda vanliga fel och risker vid användning.",
        "Tillämpa säkerhetsbestämmelser vid all hantering av vapnet."
      ],
      "examination": "Praktiska och teoretiska moment där deltagaren visar säker hantering, korrekt användning och förståelse för säkerhetsbestämmelser. Godkänd instruktör bedömer deltagarens färdigheter.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning eller motsvarande.",
        "Godkänd säkerhetsgenomgång enligt Försvarsmaktens krav."
      ],
      "literature": "Instruktionsbok Pansarskott m/86, relevanta Försvarsmaktens handböcker och säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "pistolkurs-fortsättning",
      "name": "Pistolkurs fortsättning",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Fördjupningskurs i pistolskytte med fokus på avancerad vapenteknik, säker vapenhantering och tillämpade skjutövningar under varierande förhållanden.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som tidigare genomfört grundläggande pistolkurs och behöver vidareutveckla sina färdigheter.",
      "syllabus": "Avancerad skjutteknik, fördjupad vapenvård, säkerhetsrutiner, skytte i olika ställningar och situationer, samt tillämpade övningar med fokus på träffsäkerhet och snabbhet.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter i hantering och användning av pistol inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna hantera och använda pistol på ett säkert och effektivt sätt även under mer krävande förhållanden.",
      "subGoals": [
        "Tillämpa avancerade säkerhetsrutiner vid hantering av pistol.",
        "Genomföra skjutövningar med hög precision och anpassning till olika situationer.",
        "Utföra grundlig vapenvård och felsökning.",
        "Använda olika skjutställningar och tekniker beroende på uppgift."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens färdighet i säker vapenhantering och skjutteknik bedöms.",
      "prerequisites": [
        "Genomförd grundläggande pistolkurs eller motsvarande.",
        "Godkänd säkerhetsprövning enligt Försvarsmaktens krav."
      ],
      "literature": "Försvarsmaktens handbok för pistol, relevanta reglementen och säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "spetsförmåga-8,4-cm-granatgevär",
      "name": "Spetsförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper och färdigheter i hantering och användning av 8,4 cm granatgevär inom Hemvärnet. Fokus ligger på säkerhet, skjutteknik och taktisk användning.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra med eller ansvara för 8,4 cm granatgevär.",
      "syllabus": "Vapnets funktion och handhavande, säkerhetsbestämmelser, skjutteknik, ammunitionstyper, eldledning samt tillämpade övningar i fält.",
      "purpose": "Att deltagaren ska kunna hantera och använda 8,4 cm granatgevär på ett säkert och effektivt sätt i enlighet med Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna verka med 8,4 cm granatgevär inom Hemvärnet.",
      "subGoals": [
        "Redogöra för vapnets konstruktion, funktion och säkerhetsbestämmelser.",
        "Visa korrekt handhavande och skjutteknik med 8,4 cm granatgevär.",
        "Tillämpa eldledning och val av ammunition utifrån olika måltyper.",
        "Genomföra praktiska övningar i fält med vapnet under ledning."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens kunskaper i säkerhet, handhavande och skjutteknik bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsutbildning för vapenhantering."
      ],
      "literature": "Handbok för 8,4 cm granatgevär, Försvarsmaktens reglementen och säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "spetsförmåga-pansarskott-m86",
      "name": "Spetsförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger fördjupade kunskaper och färdigheter i hantering och användning av Pansarskott m/86 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska verka med eller utbilda i Pansarskott m/86.",
      "syllabus": "Vapnets funktion och verkan, säker vapenhantering, skjutteknik, praktiska övningar samt tillämpning i stridssituationer.",
      "purpose": "Att deltagaren ska kunna hantera och använda Pansarskott m/86 på ett säkert och effektivt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna verka med Pansarskott m/86 enligt gällande bestämmelser.",
      "subGoals": [
        "Redogöra för vapnets konstruktion, funktion och verkan.",
        "Tillämpa säker vapenhantering vid all användning.",
        "Genomföra skjutning med Pansarskott m/86 under olika förhållanden.",
        "Använda vapnet taktiskt i enlighet med Hemvärnets stridsteknik."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens hantering, säkerhet och träffsäkerhet med Pansarskott m/86 bedöms.",
      "prerequisites": [
        "Genomförd grundläggande vapenutbildning inom Hemvärnet.",
        "Godkänd säkerhetsgenomgång för aktuellt vapen."
      ],
      "literature": "Handbok och instruktioner för Pansarskott m/86 samt relevanta Försvarsmaktens reglementen.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "tilläggsförmåga-8,4-cm-granatgevär",
      "name": "Tilläggsförmåga 8,4 cm Granatgevär",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskap och färdighet i hantering och användning av 8,4 cm granatgevär inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tilldelas eller redan har befattning där 8,4 cm granatgevär ingår.",
      "syllabus": "Vapnets funktion och säkerhet, grundläggande skjutteknik, ammunitionstyper, riktmedel och eldledning, samt praktiska övningar i hantering och skjutning.",
      "purpose": "Att deltagaren ska kunna hantera och använda 8,4 cm granatgevär på ett säkert och effektivt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera, ladda och avfyra 8,4 cm granatgevär samt tillämpa säkerhetsbestämmelser.",
      "subGoals": [
        "Redogöra för vapnets uppbyggnad och funktion.",
        "Visa korrekt hantering och säkerhetsrutiner.",
        "Genomföra grundläggande skjutning mot olika måltyper.",
        "Identifiera och använda olika ammunitionstyper.",
        "Tillämpa eldledning och riktmedel i praktiska moment."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens hantering, säkerhet och träffsäkerhet med 8,4 cm granatgevär bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsgenomgång för vapenhantering."
      ],
      "literature": "Handbok för 8,4 cm granatgevär, Försvarsmaktens reglementen och säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "tilläggsförmåga-automatkarbin-4",
      "name": "Tilläggsförmåga Automatkarbin 4",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger deltagaren utökad kompetens i hantering och användning av Automatkarbin 4 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som behöver utökad förmåga att hantera och använda Automatkarbin 4.",
      "syllabus": "Vapnets funktion och handhavande, säkerhetsbestämmelser, skjutteknik, vapenvård samt praktiska övningar.",
      "purpose": "Att ge deltagaren fördjupade kunskaper och färdigheter i användning av Automatkarbin 4.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt och säkert kunna hantera och använda Automatkarbin 4 enligt gällande bestämmelser.",
      "subGoals": [
        "Redogöra för Automatkarbin 4:s funktion och säkerhetsregler.",
        "Visa korrekt handhavande och skjutteknik.",
        "Genomföra vapenvård enligt instruktion.",
        "Tillämpa säkerhetsrutiner vid all hantering av vapnet."
      ],
      "examination": "Praktiska och teoretiska moment där deltagarens kunskaper och färdigheter i hantering, säkerhet och skjutning med Automatkarbin 4 bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsprövning för vapenhantering."
      ],
      "literature": "Handbok Automatkarbin 4, Försvarsmaktens säkerhetsbestämmelser för vapenhantering.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "tilläggsförmåga-granattillsats-40mm",
      "name": "Tilläggsförmåga Granattillsats 40mm",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger utbildning i hantering och användning av granattillsats 40mm inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska använda granattillsats 40mm.",
      "syllabus": "Teori och praktik kring säker hantering, användning och skjutteknik med granattillsats 40mm.",
      "purpose": "Att deltagaren ska kunna hantera och använda granattillsats 40mm på ett säkert och korrekt sätt.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna använda granattillsats 40mm enligt gällande bestämmelser.",
      "subGoals": [
        "Redogöra för säkerhetsbestämmelser vid hantering av granattillsats 40mm.",
        "Visa korrekt laddning och avfyring av granattillsats 40mm.",
        "Tillämpa skjutteknik och träffbildsbedömning."
      ],
      "examination": "Praktiska och teoretiska moment som visar att deltagaren kan hantera och använda granattillsats 40mm enligt säkerhetsföreskrifter.",
      "prerequisites": [
        "Genomförd grundläggande vapentjänst.",
        "Godkänd säkerhetsgenomgång för aktuellt vapen."
      ],
      "literature": "Handbok och instruktioner för granattillsats 40mm samt Försvarsmaktens säkerhetsföreskrifter.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "tilläggsförmåga-kulspruta-m58",
      "name": "Tilläggsförmåga Kulspruta m/58",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskap och färdighet i hantering och användning av kulspruta m/58 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tilldelas eller redan har befattning där kulspruta m/58 ingår.",
      "syllabus": "Vapnets funktion och handhavande, säkerhetsbestämmelser, skjutteknik, vapenvård samt praktiska övningar i användning av kulspruta m/58.",
      "purpose": "Att deltagaren ska kunna hantera och använda kulspruta m/58 på ett säkert och effektivt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera, använda och vårda kulspruta m/58 inom ramen för Hemvärnets verksamhet.",
      "subGoals": [
        "Redogöra för kulspruta m/58:s funktion och säkerhetsbestämmelser.",
        "Visa korrekt handhavande och skjutteknik med kulspruta m/58.",
        "Genomföra vapenvård enligt gällande instruktioner.",
        "Tillämpa vapnets användning i praktiska övningar."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens kunskaper i handhavande, säkerhet och skjutning med kulspruta m/58 bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning eller motsvarande.",
        "Godkänd säkerhetsutbildning för vapenhantering."
      ],
      "literature": "Handbok för kulspruta m/58 samt Försvarsmaktens säkerhetsbestämmelser för vapen och ammunition.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "tilläggsförmåga-pansarskott-m86",
      "name": "Tilläggsförmåga Pansarskott m/86",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger deltagaren kunskap och färdighet i hantering och användning av Pansarskott m/86 inom Hemvärnet.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tilldelas eller redan har tilldelats Pansarskott m/86 som personlig utrustning.",
      "syllabus": "Vapnets funktion och egenskaper, säker vapenhantering, skjutteknik, praktiska övningar samt säkerhetsbestämmelser vid användning av Pansarskott m/86.",
      "purpose": "Att deltagaren ska kunna hantera och använda Pansarskott m/86 på ett säkert och korrekt sätt enligt Försvarsmaktens bestämmelser.",
      "finalGoal": "Efter genomförd kurs ska deltagaren självständigt kunna hantera, ladda och avfyra Pansarskott m/86 samt tillämpa gällande säkerhetsrutiner.",
      "subGoals": [
        "Redogöra för Pansarskott m/86 tekniska data och funktion.",
        "Visa korrekt hantering och säkerhetsrutiner vid användning.",
        "Genomföra skjutning med Pansarskott m/86 under övningsförhållanden."
      ],
      "examination": "Praktiskt prov där deltagaren visar säker hantering och korrekt användning av Pansarskott m/86 samt genomför skjutning enligt instruktion.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsgenomgång för vapenhantering."
      ],
      "literature": "Instruktionsbok Pansarskott m/86, Försvarsmaktens säkerhetsföreskrifter för vapenhantering.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "skarpskytt-psg90-hv",
      "name": "Skarpskytt PSG90 Hv",
      "shortName": null,
      "category": "Vapenkurser",
      "courseCode": null,
      "description": "Kursen ger grundläggande utbildning i rollen som skarpskytt inom Hemvärnet med fokus på vapenhantering, skjutteknik och tillämpning av PSG90.",
      "targetAudience": "Avsedd för personal inom Hemvärnet som ska tjänstgöra som skarpskytt med PSG90.",
      "syllabus": "Vapenhantering och säkerhet, skjutteknik, avståndsbedömning, målangivning, kamouflering och förflyttning, praktiska skjutövningar.",
      "purpose": "Att ge deltagaren de kunskaper och färdigheter som krävs för att verka som skarpskytt med PSG90 inom Hemvärnet.",
      "finalGoal": "Efter genomförd kurs ska deltagaren kunna hantera och använda PSG90 som skarpskytt inom Hemvärnet på ett säkert och effektivt sätt.",
      "subGoals": [
        "Förstå och tillämpa säker vapenhantering med PSG90.",
        "Genomföra skjutning mot olika mål på varierande avstånd.",
        "Använda grundläggande skjutteknik och avståndsbedömning.",
        "Tillämpa kamouflering och skydd vid förflyttning och skjutställning.",
        "Rapportera och kommunicera målangivelser enligt gällande rutiner."
      ],
      "examination": "Praktiska och teoretiska prov där deltagarens hantering av PSG90, skjutresultat och tillämpning av kursens moment bedöms.",
      "prerequisites": [
        "Genomförd grundläggande soldatutbildning.",
        "Godkänd säkerhetsprövning för vapenhantering."
      ],
      "literature": "Handbok PSG90, relevanta Försvarsmaktens reglementen och instruktioner.",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "indirekt-ledarskap",
      "name": "Indirekt ledarskap",
      "shortName": "IL",
      "category": "Ledarskapsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "ledarskap-och-självkännedom",
      "name": "Ledarskap och självkännedom",
      "shortName": "LoS",
      "category": "Ledarskapsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "utveckling-grupp-ledare",
      "name": "Utveckling grupp ledare",
      "shortName": "UGL",
      "category": "Ledarskapsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "utvecklande-ledarskap",
      "name": "Utvecklande ledarskap",
      "shortName": "UL",
      "category": "Ledarskapsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "chef-musikkar",
      "name": "Chef musikkår",
      "shortName": "CMK",
      "category": "Musikutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "HvSS",
      "baseTemplateIds": [],
      "sourceFiles": [
        "hvss-kurskatalog-2023.pdf"
      ]
    },
    {
      "id": "gu-f",
      "name": "Grundläggande soldatutbildning för frivillig personal, GU-F",
      "shortName": "GU-F",
      "category": "Grundläggande militärutbildning",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "tccc-cls",
      "name": "TCCC-CLS (Combat Life Saver)",
      "shortName": "TCCC-CLS",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "pb8",
      "name": "PB8 (Personbil 8)",
      "shortName": "PB8",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "gk-tung-slapkarra",
      "name": "Gk Tung släpkärra",
      "shortName": "GKTSK",
      "category": "Funktionsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "MRM",
      "baseTemplateIds": [],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    },
    {
      "id": "instruktörskurs-12",
      "name": "Instruktörskurs 1 + 2",
      "shortName": "IK12",
      "category": "Instruktörsutbildningar",
      "courseCode": null,
      "description": "",
      "targetAudience": "",
      "syllabus": "",
      "purpose": "",
      "finalGoal": "",
      "subGoals": [],
      "examination": "",
      "prerequisites": [],
      "literature": "",
      "additionalInfo": null,
      "typicalDuration": 0,
      "courseResponsible": "MRM",
      "baseTemplateIds": [
        "instruktörskurs-1",
        "instruktörskurs-2"
      ],
      "sourceFiles": [
        "mr-m-utbildningskatalog-2026-a1.pdf"
      ]
    }
  ]
}